{
    "nodes": [
        {
            "id": "dirs",
            "url": ".././dirs",
            "category": "root",
            "title": "Directories",
            "content": "```yaml\n---\ntitle : Directories\n---\n```\n\n<ul>\n   {% for item in site.data.dirs-list%}\n      <li><a href=\"{{ item.link }}\">{{ item.title }}</a></li>\n   {% endfor %}\n</ul>\n"
        },
        {
            "id": "myundergradThesis",
            "url": ".././myundergradThesis",
            "category": "root",
            "title": "SEEG-based Localization of the Epileptogenic Zone from Complexity Measures Using Machine Learning",
            "content": "```yaml\n---\ntitle: SEEG-based Localization of the Epileptogenic Zone from Complexity Measures Using Machine Learning\n---\n```\n\nThis project was carried out during my visit as a research assistant to the Biomedical Imaging Lab at the University of Southern California.\nMoreover, it counted as my undergraduate capstone project/thesis for the degree of Electronics Engineer at Universidad de Antioquia.\n\n## Relevant Links\n\n- [Related Undergraduate Thesis](https://drive.google.com/file/d/1DBxdYuWOrBxcHbKUoenyRB_PmI1DhNZd/view?usp=sharing)\n- [2023 AES Meeting Poster](https://drive.google.com/file/d/1WVtUo-4-H_rttqZbF2HA0KJW5-oFLS9S/view?usp=sharing)\n- [2023 AES Meeting Poster Video](https://youtu.be/T70ZVLpQb2k)\n\n## Contact\n\nYou can find me on:\n\n- Email: yjmantilla@gmail.com\n- [Instagram: yjmantilla](https://www.instagram.com/yjmantilla/)\n- Mattermost: yjmantilla\n- Linkedin: yorguinjose\n- Twitter: @yjmantilla\n- [orcid](https://orcid.org/0000-0003-4473-0876)\n- [cvlac](https://scienti.minciencias.gov.co/cvlac/visualizador/generarCurriculoCv.do?cod_rh=0001659280)\n- [Google Scholar](https://scholar.google.com/citations?user=9W-bHVkAAAAJ)\n"
        },
        {
            "id": "abyss-gaze",
            "url": ".././bubbles/abyss-gaze",
            "category": "bubbles",
            "title": "Abyss Gaze",
            "content": "```yaml\n---\ntitle: \"Abyss Gaze\"\n---\n```\n\n“Beware that, when fighting monsters, you yourself do not become a monster... for when you gaze long into the abyss. The abyss gazes also into you.”\n\n― Friedrich W. Nietzsche"
        },
        {
            "id": "aesthethic-of-deepness",
            "url": ".././bubbles/aesthethic-of-deepness",
            "category": "bubbles",
            "title": "Aesthethic of Deepness",
            "content": "```yaml\n---\ntitle: \"Aesthethic of Deepness\"\n---\n```\n\n> Intense curiosity over vague boringness.\nElizabeth Filips - https://youtu.be/Kz_brQBl8xk?t=569\n\nI would argue, thats why being a hipster is a thing...\n\nThere is something attractive on stuff that are unique to you... Like a shiny stone found among the beach overview...\n\nThere is this despective sense in the following:\n\n> ... so much more fun and in-depth than just reading this chapter summary somewhere...\n\nIt sounds almost rebellious, like taking your own journey on the topic rather than being handled the answer. This waywardness is also present in [[curiosity-jumping]]\n\n[[archeology-of-knowledge]]\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[curiosity-jumping]: .././bubbles/curiosity-jumping \"curiosity-jumping\"\n[archeology-of-knowledge]: .././bubbles/archeology-of-knowledge \"archeology-of-knowledge\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "aesthethic-of-failure",
            "url": ".././bubbles/aesthethic-of-failure",
            "category": "bubbles",
            "title": "Aesthethic of Failure",
            "content": "```yaml\n---\ntitle: \"Aesthethic of Failure\"\n---\n```\n\n“Whatever you now find weird, ugly, uncomfortable and nasty about a new medium will surely become its signature. CD distortion, the jitteriness of digital video, the crap sound of 8-bit - all of these will be cherished and emulated as soon as they can be avoided. It’s the sound of failure: so much modern art is the sound of things going out of control, of a medium pushing to its limits and breaking apart. The distorted guitar sound is the sound of something too loud for the medium supposed to carry it. The blues singer with the cracked voice is the sound of an emotional cry too powerful for the throat that releases it. The excitement of grainy film, of bleached-out black and white, is the excitement of witnessing events too momentous for the medium assigned to record them.”\n\n― Brian Eno, A Year With Swollen Appendices"
        },
        {
            "id": "ai-4-health",
            "url": ".././bubbles/ai-4-health",
            "category": "bubbles",
            "title": "AI for Health",
            "content": "```yaml\n---\ntitle: \"AI for Health\"\n---\n```\n\n## Google's Article\n\nEste artículo es importante para quienes les interesa ver el paso de la inteligencia artificial de la investigación a la clínica.\nNo lo he leído completo pero destaca el rol de la mínima calidad de datos que pide el sistema vs la que se puede obtener en situaciones reales.\n\nPaper:\n- https://dl.acm.org/doi/abs/10.1145/3313831.3376718\n\nResumenes:\n\n- https://techcrunch.com/2020/04/27/google-medical-researchers-humbled-when-ai-screening-tool-falls-short-in-real-life-testing/\n- https://www.technologyreview.com/2020/04/27/1000658/google-medical-ai-accurate-lab-real-life-clinic-covid-diabetes-retina-disease/\n\n\n## Philips Article\n\n- https://www.philips.com/a-w/about/news/archive/blogs/innovation-matters/2021/20210419-why-ai-in-healthcare-needs-human-centered-design.html\n- https://www.philips.com.co/a-w/about/news/archive/standard/blogs/innovation-matters/2021/20210419-why-ai-in-healthcare-needs-human-centered-design"
        },
        {
            "id": "ai-and-science",
            "url": ".././bubbles/ai-and-science",
            "category": "bubbles",
            "title": "AI and Science",
            "content": "```yaml\n---\ntitle: AI and Science\n---\n```\n\n- https://www.quantamagazine.org/how-artificial-intelligence-is-changing-science-20190311/\n- https://www.scientificamerican.com/article/ai-designs-quantum-physics-experiments-beyond-what-any-human-has-conceived/\n"
        },
        {
            "id": "algorithms-as-abstract-representations",
            "url": ".././bubbles/algorithms-as-abstract-representations",
            "category": "bubbles",
            "title": "Algorithms as Abstract Representations",
            "content": "```yaml\n---\ntitle: \"Algorithms as Abstract Representations\"\n---\n```\n\n- What if algorithms are a better representation of reality than formulas (math)\n- Is there a math of the algorithms?\n- Work of Stephen Wolfram\n- I have some annotations about this on whatsapp note groups."
        },
        {
            "id": "archeology-of-knowledge",
            "url": ".././bubbles/archeology-of-knowledge",
            "category": "bubbles",
            "title": "Archeology of Knowledge",
            "content": "```yaml\n---\ntitle: Archeology of Knowledge\n---\n```\n\nhttps://en.wikipedia.org/wiki/The_Archaeology_of_Knowledge"
        },
        {
            "id": "are_yes_or_no_questions_science",
            "url": ".././bubbles/are_yes_or_no_questions_science",
            "category": "bubbles",
            "title": "Are Yes or No Questions Science?",
            "content": "```yaml\n---\ntitle: Are Yes or No Questions Science?\n---\n```\n\nhttps://www.facebook.com/groups/983759965442123?multi_permalinks=1550529565431824&hoisted_section_header_type=recently_seen\n\nGruneco --> Research questions cannot be answered with yes/no. Thats unscientific.\n\nYou can prove a positive but not a negative? Russels Teapot\n\nRelated to [[burden-of-proof.md]]\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "art-and-code",
            "url": ".././bubbles/art-and-code",
            "category": "bubbles",
            "title": "Art and Code",
            "content": "```yaml\n---\ntitle: Art and Code\n---\n```\n\n- https://www.youtube.com/watch?v=6avJHaC3C2U"
        },
        {
            "id": "avatar-of-challenge",
            "url": ".././bubbles/avatar-of-challenge",
            "category": "bubbles",
            "title": "Avatar of Challenge",
            "content": "```yaml\n---\ntitle: Avatar of Challenge\n---\n```\n\nUsually, in my darkest hours I will think of the challenge I'm dealing with as its own agent. Something that is challenging me to overcome it.\n\nIt will have a personification, or rather an avatar, animorph, etc... For me, it is a wolf, or canine-like creature. I'm not sure if it is the same as the [[wolf-of-reality]], thought I think it is, only with a less menacing aura/appearance.\n\nThis avatar will usually have eyes (which remind me of the [[eyes-i-see-at-close-eyes]] I sometimes see). I relate this to [[abyss-gaze]].\n\nFor me, it is similar to the Big Bad Wolf character in Puss in Boots 2, when you are down, he tells you to \"pick it up\" (your weapon) and keep fighting.\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[wolf-of-reality]: .././bubbles/wolf-of-reality \"wolf-of-reality\"\n[eyes-i-see-at-close-eyes]: .././bubbles/eyes-i-see-at-close-eyes \"eyes-i-see-at-close-eyes\"\n[abyss-gaze]: .././bubbles/abyss-gaze \"abyss-gaze\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "bestiary",
            "url": ".././bubbles/bestiary",
            "category": "bubbles",
            "title": "Bestiary",
            "content": "```yaml\n---\ntitle: Bestiary\n---\n```\n\nhttps://en.wikipedia.org/wiki/Bestiary\n\nhttps://en.wikipedia.org/wiki/Book_of_Imaginary_Beings"
        },
        {
            "id": "biomimicry",
            "url": ".././bubbles/biomimicry",
            "category": "bubbles",
            "title": "Biomimicry",
            "content": "```yaml\n---\ntitle: Biomimicry\n---\n```\n\nhttps://en.wikipedia.org/wiki/Biomimetics"
        },
        {
            "id": "books",
            "url": ".././bubbles/books",
            "category": "bubbles",
            "title": "Books",
            "content": "```yaml\n---\ntitle: Books\n---\n```\n\n## Books I have read\n\n- Cien años de Soledad\n- Libro de Animales\n- Fisica Grandes Cuestiones\n- The power of habit\n- So good until they cant ignore you\n- Rayuela\n- Biology for Engineers\n- The man who mistook his wife for a hat\n\n## Books I wish to read\n\n- Deep Work\n- Rapt: Attention and the Focused Life\n- ...\n\n## Books I like the prefaces of... or find curious\n\n- The Art of Insight in Science and Engineering Mastering Complexity Sanjoy Mahajan\n"
        },
        {
            "id": "brain-as-a-computer",
            "url": ".././bubbles/brain-as-a-computer",
            "category": "bubbles",
            "title": "Brain as a Computer",
            "content": "```yaml\n---\ntitle: Brain as a Computer\n---\n```\n\n## Counterarguments\n\n- [Why We Might Be Looking At The Brain In The Wrong Way …with important implications for AI, Towards Data Science](https://towardsdatascience.com/why-we-might-be-looking-at-the-brain-in-the-wrong-way-7c17fb11c259)\n- [Why your brain is not a computer, The Guardian](https://www.theguardian.com/science/2020/feb/27/why-your-brain-is-not-a-computer-neuroscience-neural-networks-consciousness)\n- [your-brain-does-not-process-information-and-it-is-not-a-computer](https://aeon.co/essays/your-brain-does-not-process-information-and-it-is-not-a-computer)"
        },
        {
            "id": "burden-of-proof",
            "url": ".././bubbles/burden-of-proof",
            "category": "bubbles",
            "title": "Burden of Proof",
            "content": "```yaml\n---\ntitle: Burden of Proof\n---```\n"
        },
        {
            "id": "cannabis-hallucinations",
            "url": ".././bubbles/cannabis-hallucinations",
            "category": "bubbles",
            "title": "Cannabis Hallucinations",
            "content": "```yaml\n---\ntitle: Cannabis Hallucinations\n---\n```\n\nLa única vez que me mal-viaje fue con unos brownies...\n\nLa experiencia quizás algun día la relate acá pero por ahora la anecdota más cercana que encontré en internet proviene de [acá](https://www.quora.com/Could-cannabis-cause-hallucinations/answers/111997945)\n\n>This is the story of my experiences I had twice which really made me stop smoking weed.\n\n>The first one was pretty random. After ripping 4–5 hits of bong I was pretty calmed down and started passing out. And suddenly I went in hallucination. I started dreaming random stuff such as wars, games, space and things. And all was getting inter-connected. The transition were like I had views of war going on from the perspective of cameras in movies. Watching each scene. Which suddenly started blurring and turned in 2-d ones. Like those 2-d games but at same time I was thinking about views of blood and the souls flying out. It then transitioned to millions of other things which i myself even cant recall.\n\n>During all this time my friends where trying to wake me up. Cause for some unknown reason I got out of my room and passed out in corridor. Bo idea how it happened. I have blurred memories of the time. When I saw my friends and only remember few moments during this. And the most interesting fact was that I already dreamt of places and people i was about to encounter that night. Or maybe it just messed up in my mind that it happened that way. But that night I felt weird.\n\n>I remember a moment when i was on a couch. Lying down. And my friend stalking to each other and looking after me. But then I passed out again. And when I opened my eyes. I was going to lay on that couch and my friends sat as same as I saw earlier. It was like I was getting views of future or maybe experiencing present and travelling back in past to re experience it. This part got weirder and weirder later on. It was like I was stuck on that same moment. I was thinking a lot of things. Felt time passing by opening my eyes and the same moment is still in front of me. Bot even a single nanoseconds of moments happened. And that loop thing was damn confusing. I was battling in my mind to get out of loop and think something else but then getting lost into it and getting back to the thoughts that I thought of getting out of loop and loosing my mind again. Make this 1000 folds deep. And think that you thought of a thing which was though of the same thing and same and same and so on. Folds of thoughts with no ends. I was stuck in it. Don’t know how exactly to describe that more. And during all this time the time was froze. All this happened in half hours according to my friends. That I got high to the moment I was on couch was all half hours. And it felt like eternity my loop of thoughts. And time frozen during all those folds of thoughts\n\n>To describe more. The thoughts of fold were like when I thought that i already thought about getting out of these dreams hundreds times. I started thinking why am I thinking of this. But if I am thinking what’s causing it. It was like all the why conundrums were coming to me. J was thinking about existence and start of universe and then suddenly realising that these are thoughts and I have to get out of it. And then realising i already thought of getting out of it. And felt getting back. I even thought that aav I am stuck I can move forward and this is end of it . End of time and universe . The starting of universe was a visualisation of dot moving very fast. And as it was moving it was emitting objects and masses and different things of forms I cant even explain. And then everything came in existence. And when I thought that am stuck I felt like very thing is dragging back. The particles is moving back and slowing down. Everything was rewinding and started thinking about where prticle came in existence if we came from them. But during all these thoughts I don’t know how my times I got back to the folds of thought that these are loop and I have to get out. And whenever i opened my eyes during that time . Everything was still as it can be.\n\n>No one knows about this experience and maybe cause i do t know how to describe everything. What i describes above can also seemed to be weird to a lot of people. But all I can say I don’t have exact words and ways to describe everything. And it may take eternity to describe everything that I thought during that half hour of time.\n\n>You might think am crazy but I am not. During all the time that I don’t smoke am a brilliant kid pursuing my university degree and a great hobbyist for painting and music. Everything is normal in life except that one moment I can recall every now and then. I might need to talk to someone maybe a psychiatrist but am not sure if they will understand what I had in my mind. And I don’t know where to find someone who can understand those things and explain me everything that happened."
        },
        {
            "id": "chaos-magick",
            "url": ".././bubbles/chaos-magick",
            "category": "bubbles",
            "title": "Chaos Magick",
            "content": "```yaml\n---\ntitle: Chaos Magick\n---```\n"
        },
        {
            "id": "choose-your-battles",
            "url": ".././bubbles/choose-your-battles",
            "category": "bubbles",
            "title": "Choose your battles",
            "content": "```yaml\n---\ntitle: Choose your battles\n---\n```\n\nYou have a limited supply of fucks to give. \nMark Manson, The subtle art of not giving a fuck\n\nChoose your battles wisely. You have to focus. Thomas Frank has a post on this.\n\nMy recommendation is that grades are important until they are enough, you have to excel only in the courses that truly matter to you.\n\nAlso Jaime Balmes has a quote on this in his essay about criteria.\n\nhttp://www.clerus.org/bibliaclerusonline/pt/cbi.htm"
        },
        {
            "id": "cognitive-inspired-vs-biologically-inspired",
            "url": ".././bubbles/cognitive-inspired-vs-biologically-inspired",
            "category": "bubbles",
            "title": "Cognitive Inspired vs Biologically Inspired",
            "content": "```yaml\n---\ntitle: Cognitive Inspired vs Biologically Inspired\n---\n```\n\nCheck out the comment here:\n\nhttps://www.reddit.com/r/MachineLearning/comments/fsaj3r/research_references_on_biologically/fm1tufl/"
        },
        {
            "id": "convencion-signos-optica",
            "url": ".././bubbles/convencion-signos-optica",
            "category": "bubbles",
            "title": "Convención de signos en óptica geométrica",
            "content": "```yaml\n---\ntitle:  Convención de signos en óptica geométrica\n---\n```\n\n## Una regla fácil para recordar los signos en óptica geométrica\n\nEsta regla la infirió un compañero mío de la USBve llamado Gabriele. No recuerdo su apellido pero la regla es así (la citó tal cual el la promulgo):\n\n\n>Un principio intuitivo para no tener que aprenderse las convenciones de signo:\n>1) De donde viene la luz define el positivo para el objeto. (o)\n>2) El lado donde está el observador define el positivo para la imagen, el radio y el foco. (i, r, f)\n>3) El observador está frente al espejo o detrás de la lente. (Esta es la parte intuitiva, porque así se acostumbra usar los espejos y las lentes).\n\n\nEsta regla tiene muy buen sentido intuitivo. [[intuitive-physics]]\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "cs-lewis-suppose-story-enemy",
            "url": ".././bubbles/cs-lewis-suppose-story-enemy",
            "category": "bubbles",
            "title": "C.S. Lewis on the Story of the Enemy",
            "content": "```yaml\n---\ntitle: C.S. Lewis on the Story of the Enemy\n---```\n"
        },
        {
            "id": "curiosity-jumping",
            "url": ".././bubbles/curiosity-jumping",
            "category": "bubbles",
            "title": "Curiosity Jumping",
            "content": "```yaml\n---\ntitle: Curiosity Jumping\n---\n```\n\n> you are more likely to stick to a task long term if you are leaving it when you are not finding it interesting.\n\nhttps://youtu.be/Kz_brQBl8xk?t=758\n\n> When I am stuck for one moment I leave it and do something else. With this method, to work on different things simultaneously, I never encounter any mental blockages.\n\nLuhmann, Baecker, and Stanitzek 1987\n\nThis is also productive, leave that piece of work you are feeling stuck with and do something else. When you come back later you may crack it. [[focused-and-diffused]] This productivity idea was also mentioned by David Altuve (USB).\n\nThere is a sort of belief that whatever bored you will attract you when it becomes relevant to your curiosity journey, as Elizabeth puts it:\n\n> i think you need to have a strong curiosity about the topic as a whole and then kind of flick from one thing that you find interesting to the next thing to the next thing to the next thing you will come back to the thing that you suddenly left when it becomes relevant in another point so rather than forcing yourself to just take in all this information without it sticking anywhere you can go to it as and when it becomes relevant and interesting\n\nElizabeth Filips\n\nRelated is https://zettelkasten.de/posts/trust-the-process-nickmilo22/\n\nIn a way, this is exactly what I'm doing with my wayward project [[wayward]]\n\nI would argue, curiosity jumping is also motivated by \"[[for-the-sake-of-play]]\"\n\n>I only study what I feel like studying...\nElizabeth Filips\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[focused-and-diffused]: .././bubbles/focused-and-diffused \"focused-and-diffused\"\n[wayward]: .././bubbles/stub \"wayward\"\n[for-the-sake-of-play]: .././bubbles/for-the-sake-of-play \"for-the-sake-of-play\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "diagrams-and-their-usage",
            "url": ".././bubbles/diagrams-and-their-usage",
            "category": "bubbles",
            "title": "Diagrams and their usage",
            "content": "```yaml\n---\ntitle: Diagrams and their usage\n---\n```\n\n- Controllability and observability:\ndiagrams and duality Jason Michael Erbele\n\nhttps://math.ucr.edu/home/baez/ACT2017/ACT2017_erbele.pdf"
        },
        {
            "id": "different-kinds-of-papers",
            "url": ".././bubbles/different-kinds-of-papers",
            "category": "bubbles",
            "title": "Different Kinds of Papers",
            "content": "```yaml\n---\ntitle: Different Kinds of Papers\n---\n```\n\nApparently there are different kind of papers.\n\nhttps://www.bmj.com/about-bmj/resources-readers/publications/how-read-paper"
        },
        {
            "id": "do-dogs-have-regional-accents",
            "url": ".././bubbles/do-dogs-have-regional-accents",
            "category": "bubbles",
            "title": "Do Dogs Have Regional Accents?",
            "content": "```yaml\n---\ntitle: Do Dogs Have Regional Accents?\n---\n```\n\nMJ told me of this question. Great one."
        },
        {
            "id": "doodles",
            "url": ".././bubbles/doodles",
            "category": "bubbles",
            "title": "Doodles",
            "content": "```yaml\n---\ntitle: Doodles\n---\n```\n\n- Fractals\n- That circle thing I couldnt remember where i got it from."
        },
        {
            "id": "eyes-i-see-at-close-eyes",
            "url": ".././bubbles/eyes-i-see-at-close-eyes",
            "category": "bubbles",
            "title": "Eyes I see when close my eyes",
            "content": "```yaml\n---\ntitle: Eyes I see when close my eyes\n---\n```\n\ncat like? I see them when I close my eyes and look up. I doubt it is related to [[phosphenes]]\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "fear-of-failure",
            "url": ".././bubbles/fear-of-failure",
            "category": "bubbles",
            "title": "Fear of Failure",
            "content": "```yaml\n---\ntitle: Fear of Failure\n---```\n"
        },
        {
            "id": "filas-y-columnas",
            "url": ".././bubbles/filas-y-columnas",
            "category": "bubbles",
            "title": "Filas y Columnas",
            "content": "```yaml\n---\ntitle: Filas y Columnas\n---\n```\n\nA decir verdad tuve problemas para distinguir que era una fila y una columna en una matriz sino hasta mate3 de la USBve, cuando una amiga (no recuerdo quien), me dijo que pensará en las columnas de los edificios. En ese momento para mi se me aclaró todo y más nunca tuve problemas para distinguir entre filas y columnas.\n\nBásicamente una columna es perpendicular al eje que une tus ojos jajaja."
        },
        {
            "id": "flight-of-ideas-racing-thoughts",
            "url": ".././bubbles/flight-of-ideas-racing-thoughts",
            "category": "bubbles",
            "title": "Flight of Ideas - Racing Thoughts",
            "content": "```yaml\n---\ntitle: Flight of Ideas - Racing Thoughts\n---\n```\n\nhttps://en.wikipedia.org/wiki/Racing_thoughts\n\nhttps://www.sciencedaily.com/releases/2016/11/161101151952.htm\n\nhttps://www.huffpost.com/entry/mind-wandering-creativity-mental-illness_n_5818acc4e4b0990edc33827a\n\nhttps://www.verywellmind.com/what-are-racing-thoughts-378823\n\nhttps://www.verywellmind.com/flight-of-ideas-380318\n\n\n- People on pot cannot focus on faces (once heard from Gustavo.)?"
        },
        {
            "id": "focused-and-diffused",
            "url": ".././bubbles/focused-and-diffused",
            "category": "bubbles",
            "title": "Focused and Diffused",
            "content": "```yaml\n---\ntitle: Focused and Diffused\n---```\n"
        },
        {
            "id": "for-the-sake-of-play",
            "url": ".././bubbles/for-the-sake-of-play",
            "category": "bubbles",
            "title": "For the Sake of Play",
            "content": "```yaml\n---\ntitle: For the Sake of Play\n---\n```\n\n>Then I had another thought: Physics disgusts me a little bit now, but I used to enjoy doing physics. Why did I enjoy it? I used to play with it. I used to do whatever I felt like doing – it didn’t have to do with whether it was important for the development of nuclear physics, but whether it was interesting and amusing for me to play with. When I was in high school, I’d see water running out of a faucet growing narrower, and wonder if I could figure out what determines that curve. I found it was rather easy to do. I didn’t have to do it; it wasn’t important for the future of science; somebody else had already done it. That didn’t make any difference. I’d invent things and play with things for my own entertainment.\n\nRichard Feynman\n\nhttps://recreationalphysics.com/what-richard-feynman-wrote/#:~:text=Richard%20Feynman%20wrote%20about%20his,used%20to%20play%20with%20it.\n\nRelevant: https://www.youtube.com/watch?v=N5sCa-RYzlo"
        },
        {
            "id": "freedom-and-belonging",
            "url": ".././bubbles/freedom-and-belonging",
            "category": "bubbles",
            "title": "Freedom and Belonging",
            "content": "```yaml\n---\ntitle: Freedom and Belonging\n---\n```\n\nQuote by Mark Manson. The subtle art of not giving a fuck\n"
        },
        {
            "id": "games",
            "url": ".././bubbles/games",
            "category": "bubbles",
            "title": "Games",
            "content": "```yaml\n---\ntitle: Games\n---\n```\n\n## The weird\n\n- Wikipedia Game\n- The game\n- Spot It!\n- Dice Breaker.\n"
        },
        {
            "id": "graphs-of-graphs",
            "url": ".././bubbles/graphs-of-graphs",
            "category": "bubbles",
            "title": "Graphs of Graphs",
            "content": "```yaml\n---\ntitle: Graphs of Graphs\n---\n```\n\nFrom a conversation with a friend\n\n>In any case, the point of all of this rambling is that spiritually, im scared of the immaterial and my spirituality as in -my sense of transcendence- consist on my view of admiring reality with all of its complexity and simplicity, with all i can understand and I cannot. And through communication with others, human and non-human, living and non-living Im part of a mysterious network that is made by us all.  For me, the ultimate graph that describes all of the relations between all of which have existed and have not existed is infinitely beautiful and unimaginable, is beyond comprehension and of size unmatched.  Truly I think not even gods can grasp it, because they would be only a part of it. To me, this graph connects me and you and all of the atoms between us. It connects beings emotionally, physically and spiritually. It is the realms of realms, the connection of connections, the world of worlds, and the law of laws. It contains every step made by me and every ant and every cell. Within it, is all history in all senses, future and past. It is \"beyond\"."
        },
        {
            "id": "hamilton",
            "url": ".././bubbles/hamilton",
            "category": "bubbles",
            "title": "Hamilton",
            "content": "```yaml\n---\ntitle: Hamilton\n---```\n"
        },
        {
            "id": "how-to-learn",
            "url": ".././bubbles/how-to-learn",
            "category": "bubbles",
            "title": "How to Learn",
            "content": "```yaml\n---\ntitle: How to Learn\n---\n```\n\nThis is a collection of resources I have found regarding this topic, focusing on self and lifelong learning. Sort of what I would need for a research career.\n\n## How to Easily Learn Difficult Things\n\n[Elizabeth Filips](https://youtu.be/Kz_brQBl8xk)\n\nElizabeth describes a 6-step process:\n\n1. Context-Broadening\n1. Dopamine Priming\n1. Singular Deep Dive\n1. Challenge Sandwich\n1. Getting Broody\n1. False Deadlines\n\n### Context-Broadening\n\n- Place the topic in the appropiate context (ie, the world)\n- Purpose: To make more sense and evoke excitement (make it interesting)\n\n> I have to understand the world, you see.\nRichard Feynman\n\n- Optimize Curiosity and Emotional Investment around the topic\n\nConcretely, search info that make it interesting for you both from the intellectual and the emotional. Ie, a story of a person (maybe a famous one).\n\nAnother purpose of this is to connect this new topic to your world-model. \"Situar el tema\".\n\n### Dopamine Priming\n\nOptimize emotional-investment specifically by:\n\n1. Understand the consequences and benefits of learning of it.\n1. Frame the topic in such a way that makes it interesting (almost itching) to you.\n\n[[the-power-of-emotional-investment]]\n\n>The scarcest interest is desire.\n??? maybe Elizabeth herself.\n\n### The Singular Deep Dive\n\n- Aka the bottom-up approach.\n- First narrow into the specific thing and let your curiosity naturally expand from there (by questions).\n\n> I find overviews tiring, even if Im excited about something... I would get bore.\n\nThe specific as it focuses on a concrete problem grants more interest? [[problem-solvingly]]\n\nAlso, deepness is attractive??? There is an [[aesthethic-of-deepness]].\n\nLet you curiosity branch naturally into the whole. [[por-las-ramas]]\n\n- Jump a lot... [[flight-of-ideas-racing-thoughts]] --> [[curiosity-jumping]]\n\nThe combination of intense curiosity + emotional investment is the fuel for this infinite branching trees of questions.\n\n### Challenge Sandwich\n\nA challenge motivates you an defies your knowledge. Challenges are questions and/or projects/problems to do/solve. Which depends on the kind of topic, math is problem-based, fact topics like medicine is more question-based.\n\nYou can come up with challenges that could appear on your evaluation goal (an exam, or maybe life itself?).\n\nAs you solve these challenges solidifies knowledge.\n\n> Experienced academic readers usually read a text with questions in mind and try to relate it to other possible approaches, while inexperienced readers tend to adopt the question of a text and the frames of the argument and take it as a given.\nSonke Ahrens\n\n>\"Inteweave the challenges and the knowledge\"\nElizabeth Filips\n\n>The ability to use one own understanding is a challenge not a given\nSonke Ahrens\n\nYou can related these challenges and new knowledge to the first context broadening you did... Relate it to the world, kind of like a new placement of the topic, which is a more informed version of the first one you did.\n\n### Getting Broody\n\nTradeoff between familiarity and unfamiliarity.\n\nFamiliarity has one danger--> the [[mere-exposure-effect]]\n\nSo doing many challenges is not the same as improving.\n\nBrooding-->Recognize that learning will take more time than what the illusory familiarity is suggesting. In a sense, is resting from the topic [[focused-and-diffused]], and then go back to it. Is related to spaced repetition. [[memory-retention]]\n\nTo sediment is to rest and retest the knowledge in spaced cycles.\n\n### False Deadlines\n\n> Academic or nonfiction texts almost always take significantly more time than expected: If you ask academic or nonfiction writers, students or professors how much time they expect it would take them to finish a text, they systematically underestimate the time they need.\nKahneman 2013,245ff\n\nMy interpretation is that by creating false deadlines you create a sense of urgency that facilitates memory retention. You would put the deadlines nearer to assure that later the knowledge will be assimilated (as you tend to underestimate the real time, you pressure yourself to do it quickly).\n\n\n\n\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[the-power-of-emotional-investment]: .././bubbles/the-power-of-emotional-investment \"the-power-of-emotional-investment\"\n[problem-solvingly]: .././bubbles/problem-solvingly \"problem-solvingly\"\n[aesthethic-of-deepness]: .././bubbles/aesthethic-of-deepness \"aesthethic-of-deepness\"\n[por-las-ramas]: .././bubbles/por-las-ramas \"por-las-ramas\"\n[flight-of-ideas-racing-thoughts]: .././bubbles/flight-of-ideas-racing-thoughts \"flight-of-ideas-racing-thoughts\"\n[curiosity-jumping]: .././bubbles/curiosity-jumping \"curiosity-jumping\"\n[mere-exposure-effect]: .././bubbles/mere-exposure-effect \"mere-exposure-effect\"\n[focused-and-diffused]: .././bubbles/focused-and-diffused \"focused-and-diffused\"\n[memory-retention]: .././bubbles/memory-retention \"memory-retention\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "how-to-read-a-scientific-paper",
            "url": ".././bubbles/how-to-read-a-scientific-paper",
            "category": "bubbles",
            "title": "Resources Found for paper reading",
            "content": "```yaml\n---\ntitle: Resources Found for paper reading\n---\n```\n\n## How to Read a Paper - S. Keshav\n\nNot summarized yet.\n\nhttps://web.stanford.edu/class/ee384m/Handouts/HowtoReadPaper.pdf\n\n## How to Read a Scientific Paper Efficiently and Critically\n\nThese are just my notes (almost verbatim) from the video \"How to Read a Scientific Paper Efficiently and Critically\" of the channel \"Scientific Writing with Karen L. McKee\".\n\nhttps://youtu.be/lXJeU2dzzWo\n\n### Scenario 1: Reading a single paper\n\n#### The general scientific paper structure\n\n- Abstract\n- Introduction\n- Methods\n- Results\n- Discussion\n- Conclusions\n\n#### First Goal: Get an overview of the paper\n\nCheck\n\n- Abstract\n- Highlights\n- Conclusions (skip to them)\n\nWhy?\n\nGet overall idea of what was found and why the author thinks it is important.\n\n#### Scanning figures and tables\n\n- Basically check if the figures and tables agree with the conclusions or outcome said by the author.\n\n- Strive to get your own impression of the data/evidence before reading the author's interpreation.\n\n#### Reading the introduction\n\nRead the instruction trying to find answers to the following questions:\n\n- What's the stated topic of the paper and why is it important?\n- What research has been done so far and what information is needed?\n- Is the literature cited appropiate, relevant, and up-to-date?\n- What problems, questions or hypotheses are addressed in the study?\n\nWrite the answers to these questions in your own words after reading the introduction.\n\n#### How they went about answering their questions?\n\nBasically go to the materials and methods part (the methodology)\n\nIf you are familiar with the phenomena under study you may skim through the part that describes it and only come back if you has questions. Otherwise, read it more purposefully.\n\nPay close attention to the experimental design and analyses.\n\nQuestions to ask:\n\n- Is the experiment well-designed?\n\nBasically does it have appropiate controls, randomization, and replication?\n\n- Are the analytical methods appropiate and up-to-date?\n\n- What precautions were taken to minimize bias or operator error?\n\n- Were the statistical tests appropiate?\n\nAfter reading the methodology ponder about the following questions for some time:\n\n- What would I have done differently?\n- Was this an in-depth and rigurous study or not?, based on what you have read up to this point?\n\nMake note of your answers.\n\n#### Skim through the results\n\nHaving already scrutinized the figures and tables you already have an idea of the results. The results section thus, adds details or data summaries not readily apparent on the figures and tables.\n\nAnswer these questions:\n\n- Did the study provide clear answers to the questions or hypotheses addressed?\n- Were the findings not clear-cut?\n\nThere is nothing wrong with having results not providing complete answers. Nevertheless, if that happens then in the discussion section there should be details about why was this the case.\n\n#### Reading the discussions\n\nRead and try to find answers to the following questions.\n\n- How does the author interpret the main findings?\n- Does the author describe alternative explanations for the outcome?\n- How does the main findings compare to previous research in general terms? Do they agree or disagree?\n- What are the main strenghts and limitations of the study? How do they affect the interpretation?\n\nThese questions should have been answered by the author in the discussion.\n\nIf they dont, the quality of the work or its writing could be improved.\n\n#### Rereading the conclusions\n\nReread and answer:\n\n- Does the paper describe something new or is it a confirmation of prior work?\n- What are the broader implications of the findings?\n- Do the results have relevance to other types of systems/phenomena,etc?\n- Do the findings have any practical applications?\n- What additional needs to be done in the future?\n\n#### Rereading the whole paper\n\nUseful to corfirm points based on some sections of subsections of the paper.\n\n#### This is just one of the many approaches for paper reading\n\nSo, you know.. it works for her.\n\n#### Other strategies\n\n- Reading the paper closer from start to finish, and then go back and ask the questions listed previously.\n\n#### Main values of reading papers\n\nBe efficient and discerning\n\n### Scenario 2: Reading multiple papers\n\nReading a set of papers in preparation for writing a paper.\n\nGoals:\n\n- Identify potentially relevant papers by doing literature research using keywords.\n\nSome papers may be more important than others, some may not be relevant at all.\n\nMain strategy:\n\n- Use the title and abstract to quickly discern those suitable for further reading.\n\n- Find papers in databases, ie \"Web of Science\".\n\n- Strategically use logical connectors when looking for keywords.\n\n- You may require the search terms to appear in the title.\n\n- Using sort on the results wisely:\n\nRecently vs more citations tradeoff.\n\nSome allow to sort by \"relevance\".\n\n- Refine/specialize/narrow the search if too many papers come up. Reduce 70 to 20 papers ie.\n\n- Scan abstract of each of the results to discern which to read in more detail.\n\n- Papers directly relevant should have mentioned the search terms in the abstract. That may constitute a good way to discern.\n\n- Additional papers can be found by looking for the cited literature on the papers you already have found.\n\n- You may export the list of citations and papers for easier manipulation inside research software and citations manager like mendeley.\n"
        },
        {
            "id": "html-shortcuts",
            "url": ".././bubbles/html-shortcuts",
            "category": "bubbles",
            "title": "html shortcuts",
            "content": "```yaml\n---\ntitle: html shortcuts\n---\n```\n\nHtml shortcuts are a way to create a link that automatically redirects to another page. This is useful as they are OS agnostic and can be used in any application that supports html.\n\n## Method 1\n\n```html\n<html>\n    <head>    <meta http-equiv=\"refresh\" content=\"0; url=https://drive.google.com/file/d/1DBxdYuWOrBxcHbKUoenyRB_PmI1DhNZd/view?usp=sharing\" />\n    </head>\n    <body>\n    </body>\n    </html>\n    \n```\n\n## Method 2\n\n```html\n<html><body><script type='text/javascript'>window.location.href='https://en.wikipedia.org/wiki/Curta';</script><a href='https://en.wikipedia.org/wiki/Curta'>https://en.wikipedia.org/wiki/Curta</a></body></html>\n```\n"
        },
        {
            "id": "kids-are-pure-potential",
            "url": ".././bubbles/kids-are-pure-potential",
            "category": "bubbles",
            "title": "When you are young you are pure potential",
            "content": "```yaml\n---\ntitle: When you are young you are pure potential\n---\n```\n\nWhere did I get this phrase, I dont remember at all..."
        },
        {
            "id": "knowledge-cartography",
            "url": ".././bubbles/knowledge-cartography",
            "category": "bubbles",
            "title": "Knowledge Cartography",
            "content": "```yaml\n---\ntitle: Knowledge Cartography\n---\n```\n"
        },
        {
            "id": "knowledge-graph",
            "url": ".././bubbles/knowledge-graph",
            "category": "bubbles",
            "title": "Knowledge Graph",
            "content": "```yaml\n---\ntitle: Knowledge Graph\n---\n```\n\n[[knowledge-cartography]]\n\n## Similar Ideas\n\nsecond brain : https://www.buildingasecondbrain.com/\n\nzettelkasten: https://zettelkasten.de/posts/overview/#the-introduction-to-the-zettelkasten-method\n\nhttps://www.thoughtasylum.com/2021/07/03/i-do-not-use-zettelkasten/\n\nhttps://www.google.com/search?q=do+researchers+use+zettelkasten\n\nhttps://www.google.com/search?q=do+famous+researchers+use+zettelkasten\n\nhttps://www.notably.ai/blog/is-modern-zettelkasten-notetaking-the-ultimate-evolution-of-knowledge-synthesis\n\nhyper-textuality\n\nhttps://en.wikipedia.org/wiki/Unique_identifier\n\nhttps://zettelkasten.de/posts/collectors-fallacy/\n\nhttps://zettelkasten.de/posts/collectors-fallacy-confession/\n\nhttps://zettelkasten.de/posts/dont-rely-on-source-have-faith-in-yourself/\n\nhttps://en.wikipedia.org/wiki/Niklas_Luhmann\n\nhttps://forum.zettelkasten.de/discussion/2438/hello-from-chile-ii\n\ntree hierarchy vs network\n “top-down” bird’s eye and on-the-ground “street view” from https://zettelkasten.de/posts/catographing-folgezettel-debate/\n\nhttps://zettelkasten.de/posts/embrace-dark-folgezettel-power/\n\nhttps://zettelkasten.de/posts/catographing-folgezettel-debate/\n\nhypergraph?\n\nhttps://zettelkasten.de/posts/catographing-folgezettel-debate/\n\nhttps://zettelkasten.de/posts/three-layers-structure-zettelkasten/\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[knowledge-cartography]: .././bubbles/knowledge-cartography \"knowledge-cartography\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "la-ilogica-de-las-cosas",
            "url": ".././bubbles/la-ilogica-de-las-cosas",
            "category": "bubbles",
            "title": "La Ilogica de las Cosas",
            "content": "```yaml\n---\ntitle: La Ilogica de las Cosas\n---\n```\n\nNatalia Padilla Contreras invented this concept.\n\nFor me is like finding absurd explanations to events, and somehow, that embellishes the world and our lives. I relate it to chaos magick somehow.\n\n[[chaos-magick]]\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[chaos-magick]: .././bubbles/chaos-magick \"chaos-magick\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "learn-from-the-machine",
            "url": ".././bubbles/learn-from-the-machine",
            "category": "bubbles",
            "title": "Learn from the machine",
            "content": "```yaml\n---\ntitle: Learn from the machine\n---\n```\n\n"
        },
        {
            "id": "life-authentic",
            "url": ".././bubbles/life-authentic",
            "category": "bubbles",
            "title": "Life Authentic",
            "content": "```yaml\n---\ntitle: Life Authentic\n---\n```\n\nFrom somewhere I got the idea that unhappiness stems from living a life not aunthethic to you."
        },
        {
            "id": "literature-matrix",
            "url": ".././bubbles/literature-matrix",
            "category": "bubbles",
            "title": "Literature Matrix",
            "content": "```yaml\n---\ntitle: Literature Matrix\n---\n```\n\nI first encountered this concept on the course \"Vigilancia Tecnologica\" of the UdeA, although they didnt give it an explicit name. My professor of Fundamentos de Inteligencia Computacional (Claudia Isaza), also show it and made us make one without giving it a name.  Nevertheless the concept itself does exist.\n\nhttps://www.youtube.com/watch?v=QvP-43D2U2c"
        },
        {
            "id": "memory-retention",
            "url": ".././bubbles/memory-retention",
            "category": "bubbles",
            "title": "Memory Retention",
            "content": "```yaml\n---\ntitle: Memory Retention\n---\n```\n\nLook for memory retention curves.\nEbbinghaus' Forgetting Curve"
        },
        {
            "id": "mere-exposure-effect",
            "url": ".././bubbles/mere-exposure-effect",
            "category": "bubbles",
            "title": "Mere Exposure Effect",
            "content": "```yaml\n---\ntitle: Mere Exposure Effect\n---\n```\n\nWe confuse getting familiar with real performance skill\nLook for Robert F.Bornstein"
        },
        {
            "id": "methods-rather-than-topics",
            "url": ".././bubbles/methods-rather-than-topics",
            "category": "bubbles",
            "title": "Methods Rather Than Topics",
            "content": "```yaml\n---\ntitle: Methods Rather Than Topics\n---\n```\n"
        },
        {
            "id": "modularism-vs-holism-in-neuroscience",
            "url": ".././bubbles/modularism-vs-holism-in-neuroscience",
            "category": "bubbles",
            "title": "Modularism vs Holism in Neuroscience",
            "content": "```yaml\n---\ntitle: Modularism vs Holism in Neuroscience\n---\n```\n\nFor some reason this dichotomy is not mentioned in english as much as it is in spanish. For now I just leave some literature I have seen regarding it in both languages:\n\n## Spanish\n\nMy professors at GRUNECO would tell me the main idea was whether the function emerged from the network or from a single area (conectivismo vs locacionismo/localizacionismo).\n\nNotice Connectionism in English is more a term of AI rather than neuroscience, check the [wikipedia page](https://en.wikipedia.org/wiki/Connectionism)\n\n- Briefly mentioned in [Wikipedia's Neurociencia Afectiva](https://es.wikipedia.org/wiki/Neurociencia_afectiva). Notice the dichotomy is not mentioned in the English version of the article...\n- [Holismo vs Localizacionismo, ¿perspectivas diferentes?,  GERMÁN ALBELEIRA](https://hablemosdeneurociencia.com/holismo-localizacionismo/)\n- [Historia de la neurociencia: el conocimiento del cerebro y la mente desde una perspectiva interdisciplinar, Camilo Enrique Sánchez, UNAL](https://www.redalyc.org/journal/809/80944720015/html/).\n\n## English\n\n- When looking for \"Jean-Baptiste Bouillaud vs Broca\", or \"holism vs neuroscience\" on Google.\n- [Between Bouillaud and Broca: An unknown Italian debate on cerebral localization of language,Stefano Zago et al](https://pubmed.ncbi.nlm.nih.gov/26263383/)\n- [Modern Brain Mapping – What Do We Map Nowadays?, Maria Nazarova et al](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4468863/)\n- [Breaking the Brain: Reductionism, Holism, and the Formation of the Neurosciences, Blair Granville](https://ourarchive.otago.ac.nz/handle/10523/1818)\n- [Localization versus holism and intrinsic versus extrinsic views of the brain: A neurophilosophical approach, Georg Franz Josef Northoff](https://tmu.pure.elsevier.com/en/publications/localization-versus-holism-and-intrinsic-versus-extrinsic-views-o)"
        },
        {
            "id": "movies",
            "url": ".././bubbles/movies",
            "category": "bubbles",
            "title": "Favorite Movies",
            "content": "```yaml\n---\ntitle: Favorite Movies\n---\n```\n\n- 12 angry men\n- The Truman Show\n- Jo Jo rabbit\n- La la land\n- The departed\n- The last temptation of christ\n- Shutter Island\n- A scanner darkly\n- Blade runner 2049\n- Hamilton\n- Increible Mr Fox\n- Prisoners\n- Love, Death & Robots (2019) - Beyond the Aquila Rift\n- The lives of others\n- The Secret Life of Walter Mitty\n- Into the Wild\n\n## Encanto\n\nIm not fully colombian (Im a venezuelan-colombian mix) , but in any case I was really happy with the representation and the movie struck many chords within myself, particularly being a migrant. I have seen some Colombian people that didnt like it but overall I think most colombians loved it. The movie can only show so much of Colombia when it is only just below two hours of screening. In my opinion, with the little time they had; I think they did a lot. \n\nRegarding magical realism, Im not knowledgeable of the genre besides having read \"One Hundred Years of Solitude\" in high school (i really liked it), along with some short latinoamerican novels; so in that sense I cannot really analyze the movie from that pov apart from the obvious idea of magic being embedded in the mundane, as a normal part of reality. \n\nI think Encanto will age quite well precisely because the themes it touches and its good execution of them. I have seen people relating to it even if they dont have latinoamerican roots.  I have lost some good hours seeing the reactions from people of other parts of the world here in youtube... The only problem I noticed was of pacing (the end feels rushed, if only we could stay more time in that universe); but in my opinion the strengths of the movie supersedes that problem. Some people think that Mirabel being heroic by just being more empathetic with his sister is underwhelming, and to be honest I felt like that too for a bit; but in retrospective I think thats one of the strengths, it is not a colossal adventure, but a mundane one embedded in magic. Is magical realism...\n\n## Movies I wouldnt watch again, for good reasons\n\nSome movies did a good job on perturbing me. So, I like the way they did that, but wouldn't watch them again.\n\n- Joker\n- Parasyte\n- Carnage\n\n## Favorite scenes\n\nhttps://youtube.com/playlist?list=PLhK4xqnociM-FR5rIFBCW8DPkNyp0diZL\n"
        },
        {
            "id": "neuro-ai",
            "url": ".././bubbles/neuro-ai",
            "category": "bubbles",
            "title": "Neuro-AI",
            "content": "```yaml\n---\ntitle: Neuro-AI\n---\n```\n\nI was always looking for this concept by myself but lately it seems it has gained some momentum to become an area by itself. Check the MAIN 2021 conference:\n\n- Student Panel discussion: Career paths in Neuro-AI /  Raymond Chua (McGill University), Jean-Baptiste Poline (McGill University), Irina Rish (Université de Montréal & Mila), Hao Ting Wang (Université de Montréal) [Moderator: Charlotte Maschke (McGill University)]\n\n- Panel discussion: Inspiring the future : Activism and Advocacy in Neuro-AI  / Ahmed El Hady (University of Konstanz / Princeton University), Jordan Harrod (Harvard-MIT Program in Health Sciences and Technology, MA, USA), LLana James (AI, Medicine and Data Justice Post-Doctoral Fellow - Queen's University), Jason E. Lewis (Concordia University) - [Co-moderators: Danielle Nadin (Black In Neuro) & Karim Jerbi (Université de Montréal & Mila)]\n\n\n## Some discussion on reddit and other places:\n\nI have also found people discussing the concept indirectly:\n\n- [How are computational neuroscience and machine learning overalapping?](https://www.reddit.com/r/MachineLearning/comments/o644ei/d_how_are_computational_neuroscience_and_machine/)\n- [Is Neuroscience background useful for ML research?](https://www.reddit.com/r/MachineLearning/comments/cs9j5i/d_is_neuroscience_background_useful_for_ml/)\n- [Future Career: Computational Neuroscience vs Computer Science](https://www.reddit.com/r/compmathneuro/comments/g7qamh/future_career_computational_neuroscience_vs/)\n- [Are the connections between deep learning and neuroscience still relevant?](https://www.reddit.com/r/MachineLearning/comments/ayvxvc/d_are_the_connections_between_deep_learning_and/)\n- [What Can AI Get from Neuroscience?, Steve M. Potter](https://cpn-us-w2.wpmucdn.com/sites.gatech.edu/dist/f/516/files/2016/11/Potter-2007-What-can-AI-get-from-Neuroscience.pdf)\n- [November Edition: On Neuroscience and Its Connections to AI and Machine Learning] (https://towardsdatascience.com/november-edition-on-neuroscience-and-its-connections-to-ai-and-machine-learning-1006edbcda5a)\n\nIt is also related to biologically plausible ml\n\n- [References on biologically inspired/plausible machine learning](https://www.reddit.com/r/MachineLearning/comments/fsaj3r/research_references_on_biologically/fm1tufl/)"
        },
        {
            "id": "neuroscience-of-curiosity",
            "url": ".././bubbles/neuroscience-of-curiosity",
            "category": "bubbles",
            "title": "Neuroscience of Curiosity",
            "content": "```yaml\n---\ntitle: Neuroscience of Curiosity\n---\n```\n\n```markdown\nURL list from Wednesday, Jan. 4 2023 23:58 PM\nTo copy this list, type [Ctrl] A, then type [Ctrl] C.\n\ndopamine drives curious people - Google Search\nhttps://www.google.com/search?q=dopamine+drives+curious+people&biw=1511&bih=710&ei=fVe2Y_uyIIeRwbkPhu6oyAc&ved=0ahUKEwi75fyD0a_8AhWHSDABHQY3Cnk4HhDh1QMIDw&uact=5&oq=dopamine+drives+curious+people&gs_lcp=Cgxnd3Mtd2l6LXNlcnAQAzIFCAAQogQyBQgAEKIEMgUIABCiBDoKCAAQRxDWBBCwAzoFCAAQkQI6BQgAEIAEOgsILhCABBDHARDRAzoICC4QgAQQ1AI6BAgAEEM6BQguEIAEOgcILhDUAhBDOgsILhCvARDHARCABDoFCAAQhgM6BggAEBYQHjoICAAQFhAeEA86BQghEKABOgQIIRAVOggIIRAWEB4QHUoECEEYAEoECEYYAFD-C1ijOWChOmgDcAF4AIABpgGIAd4gkgEEMC4zMZgBAKABAbABAMgBCMABAQ&sclient=gws-wiz-serp\n\nIntellectual curiosity - Wikipedia\nhttps://en.wikipedia.org/wiki/Intellectual_curiosity\n\nThe surprising link between curiosity and Dopamine - Idea to Value\nhttps://www.ideatovalue.com/crea/nickskillicorn/2022/08/the-surprising-link-between-curiosity-and-dopamine/\n\nCuriosity killed the ape: are wild or captive orangutans more creative? - Idea to Value\nhttps://www.ideatovalue.com/crea/nickskillicorn/2019/01/curiosity-killed-the-ape-are-wild-or-captive-orangutans-more-creative/\n\nThe Hungry Mind: Intellectual Curiosity Is the Third Pillar of Academic Performance - Sophie von Stumm, Benedikt Hell, Tomas Chamorro-Premuzic, 2011\nhttps://journals.sagepub.com/doi/10.1177/1745691611421204\n\nCuriosity and the pleasures of learning: Wanting and liking new information: Cognition and Emotion: Vol 19, No 6\nhttps://www.tandfonline.com/doi/abs/10.1080/02699930541000101\n\nThe Itch of Curiosity | WIRED\nhttps://www.wired.com/2010/08/the-itch-of-curiosity/\n\nCuriosity and the desire for agency: wait, wait … don’t tell me! | Cognitive Research: Principles and Implications | Full Text\nhttps://cognitiveresearchjournal.springeropen.com/articles/10.1186/s41235-021-00330-0\n\nThe 'Why' Behind Asking Why: The Science of Curiosity - Knowledge at Wharton\nhttps://knowledge.wharton.upenn.edu/article/makes-us-curious/\n\nHow Are Curiosity and Interest Different? Naïve Bayes Classification of People’s Beliefs | SpringerLink\nhttps://link.springer.com/article/10.1007/s10648-021-09622-9\n\nWhy are some people more curious than others? - Big Think\nhttps://bigthink.com/neuropsych/curiosity-in-humans/\n\nOpenness to Experience: The Gates of the Mind - Scientific American\nhttps://www.scientificamerican.com/article/openness-to-experience-the-gates-of-the-mind/\n```"
        },
        {
            "id": "notetaking",
            "url": ".././bubbles/notetaking",
            "category": "bubbles",
            "title": "Note Taking",
            "content": "```yaml\n---\ntitle: Note Taking\n---\n```\n\n"
        },
        {
            "id": "novelty-search",
            "url": ".././bubbles/novelty-search",
            "category": "bubbles",
            "title": "Novelty Search",
            "content": "```yaml\n---\ntitle: Novelty Search\n---\n```\n\nhttps://www.oreilly.com/radar/open-endedness-the-last-grand-challenge-youve-never-heard-of/"
        },
        {
            "id": "outliers",
            "url": ".././bubbles/outliers",
            "category": "bubbles",
            "title": "Outliers",
            "content": "```yaml\n---\ntitle: Outliers\n---\n```\n\n"
        },
        {
            "id": "overheating",
            "url": ".././bubbles/overheating",
            "category": "bubbles",
            "title": "Overheating",
            "content": "```yaml\n---\ntitle: Overheating\n---\n```\n\nI have overheating problems (computer shuts down with no error message suggests so). Currently my approach to solve this problem was to:\n\n1. Monitor with https://openhardwaremonitor.org/ (note, it saves the logs so the location of the executable, it is also capable of plotting.)\n1. Here I verified that my cpu reached 90°C+ temperatures sometimes. Maybe this is expected when the computer was new and the thermal paste functioned at optimum.\n1. In any case, I decided after some research to limit the performance of the cores to lower the temperatures. This is done with https://www.techpowerup.com/download/techpowerup-throttlestop/ . Initially I thought of undervolting (less voltage --> less frequency --> less speed --> less disipatted power)\n1. Basically I just activated the \"Battery\" Profile and with that temperature was down to 60°C+.\n\nI hope this solves the random shutdowns that were driving me mad.\n\nNote: Intel XTU no longer works with my 8250u cpu. So thats why I used ThrottleStop (although you could find and older version such as [6.5.1.321](https://community.intel.com/t5/Processors/How-is-8-th-gen-8250u-not-supported-by-newer-versions-of-XTU/td-p/633651)). In any case, ThrottleStop seems to be [more reliable and universal](https://www.techpowerup.com/forums/threads/throttling-on-intel-i5-8250u.266531/)"
        },
        {
            "id": "paralysis-by-analysis",
            "url": ".././bubbles/paralysis-by-analysis",
            "category": "bubbles",
            "title": "Paraslysis by Analysis",
            "content": "```yaml\n---\ntitle: Paraslysis by Analysis\n---\n```\n"
        },
        {
            "id": "perfection-is-paralyzing",
            "url": ".././bubbles/perfection-is-paralyzing",
            "category": "bubbles",
            "title": "Perfection is Paralyzing",
            "content": "```yaml\n---\ntitle: Perfection is Paralyzing\n---\n```\n\n[[paralysis-by-analysis]]\n[[fear-of-failure]]\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[paralysis-by-analysis]: .././bubbles/paralysis-by-analysis \"paralysis-by-analysis\"\n[fear-of-failure]: .././bubbles/fear-of-failure \"fear-of-failure\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "perspective-reality",
            "url": ".././bubbles/perspective-reality",
            "category": "bubbles",
            "title": "Perspective Reality",
            "content": "```yaml\n---\ntitle: Perspective Reality\n---\n```\n"
        },
        {
            "id": "philosophy-jokes",
            "url": ".././bubbles/philosophy-jokes",
            "category": "bubbles",
            "title": "Philosophy Jokes",
            "content": "```yaml\n---\ntitle: Philosophy Jokes\n---\n```\n\n## An engineer, a scientist, a mathematician, and a philosopher\n\n>An engineer, a scientist, a mathematician, and a philosopher are hiking through the hills of Scotland, when they see a lone black sheep in a field.\n\n>The engineer says, “What do you know, it looks like the sheep around here are black.” The scientist looks at him skeptically and replies, “Well, at least some of them are.” The mathematician considers this for a moment and replies, “Well, at least one of them is.” Then the philosopher turns to them and says, “Well, at least on one side.”\n\n[source](https://spot.colorado.edu/~huemer/philjoke.htm)\n\n## A boy is about to go on his first date\n\n>A boy is about to go on his first date, and his father gives him the following advice: “If you ever don’t know what to talk about, just remember the three F’s: food, family, and philosophy. You can always start a conversation about one of those subjects.”\n\n>The boy picks up his date and they go to a soda fountain. Ice cream sodas in front of them, they stare at each other for a long time, as the boy’s nervousness builds. He remembers his father’s advice, and chooses the first topic. He asks the girl: “Do you like potato pancakes?” She says “No,” and the silence returns.\n\n>After a few more uncomfortable minutes, the boy thinks of his father’s suggestion and turns to the second item on the list. He asks, “Do you have a brother?” The girl says “No,” and there is silence once again.\n\n>The boy then plays his last card. He thinks of his father’s advice and asks the girl: “If you had a brother, would he like potato pancakes?”\n\n[source](https://spot.colorado.edu/~huemer/philjoke.htm)\n"
        },
        {
            "id": "phrase-compression",
            "url": ".././bubbles/phrase-compression",
            "category": "bubbles",
            "title": "Phrase Compression",
            "content": "```yaml\n---\ntitle: Phrase Compression\n---\n```\n\nDistill an idea into a single phrase. Kind of like an aphorism?"
        },
        {
            "id": "por-las-ramas",
            "url": ".././bubbles/por-las-ramas",
            "category": "bubbles",
            "title": "Por las Ramas",
            "content": "```yaml\n---\ntitle: Por las Ramas\n---\n```\n\nA methodology from Biohacking Colombia.\n"
        },
        {
            "id": "problem-solvingly",
            "url": ".././bubbles/problem-solvingly",
            "category": "bubbles",
            "title": "Problem Solvingly",
            "content": "```yaml\n---\ntitle: Problem Solvingly\n---\n```\n\nI wonder what I meant by \"solvingly\". AI suggest: \"I think I meant that problem solving is a process, and that it is not a state. It is not a state of being, it is a process of becoming. It is a process of becoming.\""
        },
        {
            "id": "random-matrices-and-brain",
            "url": ".././bubbles/random-matrices-and-brain",
            "category": "bubbles",
            "title": "Random Matrices and the Brain",
            "content": "```yaml\n---\ntitle: Random Matrices and the Brain\n---\n```\n"
        },
        {
            "id": "rapt-attention",
            "url": ".././bubbles/rapt-attention",
            "category": "bubbles",
            "title": "Rapt Attention",
            "content": "```yaml\n---\ntitle: Rapt Attention\n---\n```\n\nCal Newport on Deep Work.\n\nMy rarified approach, my rapt attention.\n\nThere is also this book he quotes \"Rapt\" or something like that.\n\nAnd this image\n\n![Image](https://pbs.twimg.com/media/FlQPFeBakAAZBd5?format=jpg&name=small)\n\nhttps://twitter.com/ChatsVoid/status/1608927564973887488?s=20&t=UCNWbs-tD5sMO7XWHtpaDg"
        },
        {
            "id": "representation",
            "url": ".././bubbles/representation",
            "category": "bubbles",
            "title": "Representation",
            "content": "```yaml\n---\ntitle: Representation\n---\n```\n\n- Irina Rish, [[learn-from-the-machine]]\n- How do humans represent the world in their mind and brain?\n- Representation in matrices --> factorization, remember from Punkis' tutor Archana Venkataraman.\n- Thought experiment: [[imagine-24-balls]]\n- intelligence without representation paper\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[learn-from-the-machine]: .././bubbles/learn-from-the-machine \"learn-from-the-machine\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "schema",
            "url": ".././bubbles/schema",
            "category": "bubbles",
            "title": "Schema",
            "content": "```yaml\n---\ntitle: Schema\n---\n```\n\nCheck out the way dendron applies it: https://wiki.dendron.so/notes/c5e5adde-5459-409b-b34d-a0d75cbb1052/\n\nNevertheless, for my usecase I think I prefer the chaotic nature of reality."
        },
        {
            "id": "scientific-writing-with-karen-mckee",
            "url": ".././bubbles/scientific-writing-with-karen-mckee",
            "category": "bubbles",
            "title": "Scientific Writing with Karen L. McKee",
            "content": "```yaml\n---\ntitle: Scientific Writing with Karen L. McKee\n---\n```\n\nJust found this [channel](https://www.youtube.com/channel/UCNDEeAVnl0p1Wj5ngF8JlMA). I should probably summarize some of her awesome videos.\n\nSome videos that caught my eye:\n\n- How to Read a Scientific Paper Efficiently and Critically: https://www.youtube.com/watch?v=lXJeU2dzzWo\n- Writing is Thinking: https://youtu.be/tX9asHdFSv4 --> [[writing-and-thinking]]\n- How to Use Narrative Structure in a Scientific Paper: https://youtu.be/XW77hpjNTvY \n- How to Write Clearly: Cohesion and Coherence: https://youtu.be/FpOPA3GFeJg \n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[writing-and-thinking]: .././bubbles/writing-and-thinking \"writing-and-thinking\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "soft-vs-hard-computing",
            "url": ".././bubbles/soft-vs-hard-computing",
            "category": "bubbles",
            "title": "Soft vs Hard Computing Duality",
            "content": "```yaml\n---\ntitle: Soft vs Hard Computing Duality\n---\n```\n\nTaken from [here](http://www2.cs.uh.edu/~ceick/6367/Soft-Computing.pdf)\n\nThis is related to [[computation]]\n\n## What is Soft Computing ? (adapted from L.A. Zadeh)\n\nSoft computing differs from conventional (hard) computing in that, unlike hard computing, it is tolerant of imprecision, uncertainty, partial truth, and approximation. In effect, the role model for soft computing is the human mind. \n\n## What is Hard Computing?\n\n- Hard computing, i.e., conventional computing, requires a precisely stated analytical model and often a lot of computation time.\n- Many analytical models are valid for ideal cases.\n- Real world problems exist in a non-ideal environment.\n\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "sonic-design",
            "url": ".././bubbles/sonic-design",
            "category": "bubbles",
            "title": "Sonic Design",
            "content": "```yaml\n---\ntitle: Sonic Design\n---\n```\n\nFrom Alice Gebura @ https://youtu.be/Kr3quGh7pJA\n\n>I enjoyed watching it but I also disagree with some of it.\n \n>What I like – the overview of various schools of theory, the correlation of music and dance (I have always believed movement should be part of music education and vice versa), demonstrating the shallowness and ignorance of the “Ben Shapiro argument,” Owen Pallett and their ilk, the limitations of Schenkerian analysis. \n \n>What I don’t like – the generalization that music degree programs are missing all the things mentioned. While music programs at liberal arts colleges are skimpy, this isn’t true of conservatories and dedicated music schools. I started out in 1972 at a liberal arts college and learned a lot from the traditional courses offered which were robust and enlightening, but limited in scope. All it took was some research on my part – in the 1970s–to find Berklee and then NEC, the 2 schools I ended up getting degrees from. Berklee covers all the jazz harmony systems the video mentions and more, and George Russell was at NEC teaching his Lydian chromatic system. (I enjoyed seeing a very young George in this video!!)  And you could study global music systems by taking Ethnomusicology classes at both schools. Any one of the theory systems discussed in the video are lacking in one or more dimensions. A passionate musician looks at all of the theory systems and realizes this. \n \n>Also I disagree with the premise that we are better off analyzing Chopin with the Lydian Chromatic system rather than traditional harmony. I would argue that both systems shed some light on what Chopin is doing with musical language but limiting your view of Chopin to musical language is to miss what is at the heart of Chopin - musical space and tone color, as he was exploiting recent technical innovations that expanded the range and frequency saturations of the piano. \n \n>In fact, Sonic Design by Cogan and Escot (1976) -which isn’t mentioned in the video - does exactly what you are advocating – looking at all music systems to come up with a set of parameters that can be applied towards understanding all music. The video refers to cross cultural music analysis but it focuses  on “scales/chords” and rhythm – what Cogan and Escot called musical languages and time.  The video ignores musical space and color – two parameters Cogan and Escot deal with extensively.\n \n>The video mentions consonance/dissonance theory and articulation. For example, it says staccato is a form of “dissonance.” What isn't said is that articulation greatly influences spectral result. Technically, plucking introduces noise artifacts that disrupt overtones (spectra). But to whom is this dissonant? “Dissonance” is a judgement call - which you don't point out. \n \n>I disagree that Schenkerian analysis is the root of all music theory [white male/western european]. Berklee had no Schenker analysis classes and NEC had only one. Schacter was on the list of books to read in undergrad but it was used to understand a specific era, and it was almost invisible at Berklee. There are certainly specialists in Schenkerian analysis but my observation is that few musicians even know what it is. As you point out Schenkerian analysis is useful for understanding a specific body of music and where I studied no one ever claimed it was more than that, in fact my teachers pointed out its limitations – in the 1970s. Schenkerian analysis is limiting even within the arena it purports to explain. It certainly can’t explain Chopin. Schenker was a racist but the video doesn't make it clear that he was not an anomaly, belief in white superiority was the basis for politics, science, and the arts in that place and time. That shouldn’t be news to anyone with a basic education in history.  \n \n>The video narrator complains the white male perspective limits the field of music theory. I suppose there are music depts. where that’s true. But to make a sweeping generalization that this is the case everywhere is simply not accurate. \n \n>What is true is that you can’t rely on every college or university to have as much depth in the music dept. as you get at a dedicated music school. As someone with 2 music degrees I had an excellent education at the 3 schools I attended. Each one presented a unique perspective and environment. I was exposed to traditional western harmony, jazz harmony, Asian music systems, Native American systems, and a boatload of contemporary/20th century music. We read linguistics, anthropology and physics texts to supplement our understanding of music and its analysis. I wouldn’t trade it for anything.\n\n>Obviously I'm from a previous generation and my teachers have either passed away or are retired. I don't know what goes on today in my alma maters. I will say that back in the day the administration at NEC never seemed to appreciate the jazz dept. or the innovation going on in the theory dept. Society's problems with social justice and the treatment of women were certainly in evidence in the schools I attended. I could burn your ears with some of the stories. But the topic is music theory...."
        },
        {
            "id": "squire-attire",
            "url": ".././bubbles/squire-attire",
            "category": "bubbles",
            "title": "Squire Attire",
            "content": "```yaml\n---\ntitle: Squire Attire\n---\n```\n\nhttps://youtu.be/JbW20JS11TY?t=1747\n\n> Hey, we would like to show the squire something if you don't mind.\n\n> Well actually I do mind, that flung-out-of-a-burning-building, landed-in-a-vegetable-truck-covered-by-melasas look simply wont do...\n> The squire insists that his guest to be dressed appropiatly.\n> I require you retire that attire and return before squire tires, attired in a'ttire more desired by the squire.\n\n> Im sorry, could you say that again?\n\n> Not in a million years... Good day."
        },
        {
            "id": "stub",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "Stub",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "text-libro-de-animales",
            "url": ".././bubbles/text-libro-de-animales",
            "category": "bubbles",
            "title": "Libro de Animales",
            "content": "```yaml\n---\ntitle: Libro de Animales\n---\n```\n\n"
        },
        {
            "id": "the-blessing-is-in-the-breaking",
            "url": ".././bubbles/the-blessing-is-in-the-breaking",
            "category": "bubbles",
            "title": "The Blessing is in the Breaking",
            "content": "```yaml\n---\ntitle: The Blessing is in the Breaking\n---\n```\n\nExtract from https://qr.ae/prrOMg\n\n- https://www.quora.com/How-do-guys-deal-with-breakups-after-10-years-of-a-relationship\n\n> Just like anybody else, men can experience remorse or regret over a decision they made. To think that men can’t regret their behavior is naive, to say the least.\n\n>I once had a professor of philosophy tell me something rather profound about how relationships work. Ever since he mentioned it to me, it has stuck around, and I’ve repeated it many times. He said, “Moses, you never know the beginning of something unless you also know its ending. You can’t understand what the significance of a book’s beginning is without also knowing its ending. The same goes for relationships: it is only when it ends that you understand it.”\n\n>Of course, being the young buck that I was, I disagreed with him at times. But life has taught me otherwise. I think he’s right. You don’t actually know the other person until you two fight and breakup.\n\n>It’s in the way a person breaks up with you that you learn the most about them. You learn how they will treat you when they are at their worst. And believe me, sometimes the things we imagine about the Other are completely wrong. The girl you thought would be kind and compassionate is batshit crazy. The guy you thought was understanding and loving is a goddamn abusive son of a bitch.\n\n>And you would not know any of this had you not broken up.\n\n>I once heard a pastor say, “The blessing is in the breaking.” He used to say it all of the time. Of course, I’m taking his remark out of context but it works here too. The blessing is in the breaking. When you break up with someone, you get a glimpse of a side of them you’ve never seen before. The end determines the beginning. What was present yet hidden at the beginning is now revealed at the end.\n\n>I once dated a girl that appeared to be the epitome of grace. I used to marvel at how gracious and caring and kind she was. When we did break up, one of the most unexpected things happened: the graciousness and the care that I thought I had once seen in her, vanished in a heartbeat. We’re not talking just a little change-of-heart or “Oh, she's having a bad day”; we’re talking a Dr. Jekyl/Mr. Hyde type of change. It went from zero-to-sixty in a second.\n\n>After the breakup, she refused to speak to me, even though I asked if we could break up on “cordial terms.” None of that happened. What followed was a nightmare not worth repeating here (and, to be frank, it’s all rather personal anyhow). What I will say is this: you don’t really know someone until you’ve broken up with them. The way she treated me during the break-up taught me more than enough about who she was as a person on a very intimate level. And, to be honest, it wasn’t the person I was dating.\n\n>And, finally, in regards to your question. Yes, of course, guys experience remorse. I know I have. Sometimes time away from a person makes you recognize what it is that made you love them in the first place. Distance isn’t always a bad thing. Breaking up or taking a break isn't always a bad thing. There is a lesson to be learned there, too.\n\n>On a brighter note, I recently got into an argument with a friend of mine over something silly. He offended me; I confronted him about it. And, you know, instead of being an asshole (which I thought he would be), he took the high road and apologized. I wasn’t expecting it at all. It caught me by surprise. Again: there are things that you learn in the breaking.\n\n>The blessing is in the breaking. And the end determines the beginning.\n\n>Good luck, ya’ll. Stay safe out there! It can certainly be a cruel, cruel world!\n\nMoses Yuriyvich Mikheyev @ Quora"
        },
        {
            "id": "the-can-that-moves",
            "url": ".././bubbles/the-can-that-moves",
            "category": "bubbles",
            "title": "The Can that Moves",
            "content": "```yaml\n---\ntitle: The Can that Moves\n---\n```\n\nThis is a game that Massimo told me about, probably invented at IVIC (Instituto Venezolano de Investigaciones Científicas).\n\nIt consist of a can that you roll on one direction, but after a while it goes on the opposite one as if it had its own will. The idea is that people try to guess what kind of mechanism the can has inside to have such behavior (by following the hypothesis-test cycle of the scientific method)\n\nRelated to [[reverse-engineering-games]]\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "the-engineers-methodology",
            "url": ".././bubbles/the-engineers-methodology",
            "category": "bubbles",
            "title": "The Engineer's Methodology",
            "content": "```yaml\n---\ntitle: The Engineer's Methodology\n---\n```\n\n> Se puede porque se pudo.\n\nEl Mazo, Universidad de Antioquia"
        },
        {
            "id": "the-importance-of-sediment",
            "url": ".././bubbles/the-importance-of-sediment",
            "category": "bubbles",
            "title": "The Importance of Sediment",
            "content": "```yaml\n---\ntitle: The Importance of Sediment\n---\n```\n\nWhen I did my first trip to Canada and met with my old school friend J, he told he didnt like to binge watch shows. I dont recall his exacts words but nowadays I conceptualize it as follows:\n\nWe need time to digest experiences and things. If we cram it, reflection is lost, deepness is lost. You need time to assimilate. The flavor of what you got from it will be different.\n\nIn a way is like the subconscious goes through the thing it self through time, it needs to sediment for each to reach a significant meaning (redundant?)...\n"
        },
        {
            "id": "the-minimal-viable-product",
            "url": ".././bubbles/the-minimal-viable-product",
            "category": "bubbles",
            "title": "The Minimal Viable Product",
            "content": "```yaml\n---\ntitle: The Minimal Viable Product\n---\n```\n\nPerfection comes later, as it is paralyzing.\n\nThis notion can be extended for example to the \"minimal viable paper\".\n\n[[paralysis-by-analysis]]\n[[perfection-is-paralyzing]]\n\n\n\n\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[paralysis-by-analysis]: .././bubbles/paralysis-by-analysis \"paralysis-by-analysis\"\n[perfection-is-paralyzing]: .././bubbles/perfection-is-paralyzing \"perfection-is-paralyzing\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "the-power-of-emotional-investment",
            "url": ".././bubbles/the-power-of-emotional-investment",
            "category": "bubbles",
            "title": "The Power of Emotional Investment",
            "content": "```yaml\n---\ntitle: The Power of Emotional Investment\n---\n```\n\nThings go into memory by 3 mechanisms (if I remember correctly...)\n\n- Relevance\n- Importance\n- Repetition\n\nIf I remember correctly (IFIRC), relevance distinguishes from importance by having an emotional valence.\n\n>La razón es fría, pero ve claro; darle calor y no ofuscar su claridad; las pasiones son ciegas, pero dan fuerza; darles dirección y aprovecharse de su fuerza.\n\nJaime Balmes\n\nElizabeth Filips has some ideas related to this. https://youtu.be/Kz_brQBl8xk .\n\n## Neuroscience\n\n- Dopamine is a critical driver of human activities based on the anticipation of reward. In particular curiosity. I branched yet again into another search: [[neuroscience-of-curiosity]] (Is dopamine emotion? is it longing?)\n\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[neuroscience-of-curiosity]: .././bubbles/neuroscience-of-curiosity \"neuroscience-of-curiosity\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "thinking-about-code",
            "url": ".././bubbles/thinking-about-code",
            "category": "bubbles",
            "title": "Thinking About Code",
            "content": "```yaml\n---\ntitle: Thinking About Code\n---\n```\n\n- https://www.theatlantic.com/technology/archive/2017/09/saving-the-world-from-code/540393/\n"
        },
        {
            "id": "to-do",
            "url": ".././bubbles/to-do",
            "category": "bubbles",
            "title": "To Do",
            "content": "```yaml\n---\ntitle: To Do\n---\n```\n\n- Digitize notebooks and extract stuff for the knowledge base.\n- Extract stuff from the black hole of \"random\" folders..., at least, from what my [[curiosity-jumping]] guides me...\n- Extract formative research (stuff i shared with eva)\n\n\n\n\n\n\n\n\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[curiosity-jumping]: .././bubbles/curiosity-jumping \"curiosity-jumping\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "understanding-and-innovation",
            "url": ".././bubbles/understanding-and-innovation",
            "category": "bubbles",
            "title": "Understanding and Innovation",
            "content": "```yaml\n---\ntitle: Understanding and Innovation\n---\n```\n\n> El que no entiende no innova\n\nCastro, un profesor de física de la USB\n"
        },
        {
            "id": "video-irina-rish-agi-complex-systems-transhumanism",
            "url": ".././bubbles/video-irina-rish-agi-complex-systems-transhumanism",
            "category": "bubbles",
            "title": "Irina Rish - AGI, Complex Systems, Transhumanism",
            "content": "```yaml\n---\ntitle: Irina Rish - AGI, Complex Systems, Transhumanism\n---\n```\n\nhttps://www.youtube.com/watch?v=8-ilcF0R7mI\n\n\n>What an amazing, interesting person! I like the mix of ideas from transhumanism and machine learning. She briefly mentions that people should also learn from ML models not only the other way around. And I think this is extremely underexplored area of research. Some time ago, in a vain of similar thoughts, I wrote an article on medium called \"Can humans speak the language of machines?\" where I dectribed an experience of trying to learn vector-based language produced by universal sentence encoder from Google. And It worked! That means that people could also communicate in vector spaces that widely more richer than usual text-based communication.\nAlexey Borsky\n\n28:32\nhistory shows that every time you hard code something in like rule-based expert\n28:37\nsystem you will be outperformed later on by something which is more generic and\n28:42\nkind of emerges\n\nRelated to Lex Fridman data scalation quote https://youtu.be/OwWN2OfHKpk?t=600\n\n\n\n"
        },
        {
            "id": "visceralization",
            "url": ".././bubbles/visceralization",
            "category": "bubbles",
            "title": "Visceralization",
            "content": "```yaml\n---\ntitle: Visceralization\n---\n```\n"
        },
        {
            "id": "web-videos",
            "url": ".././bubbles/web-videos",
            "category": "bubbles",
            "title": "Web Videos",
            "content": "```yaml\n---\ntitle: Web Videos\n---\n```\n\nInclude here topic-based youtube playlist in unlisted mode"
        },
        {
            "id": "will-of-places",
            "url": ".././bubbles/will-of-places",
            "category": "bubbles",
            "title": "Will of Places",
            "content": "```yaml\n---\ntitle: Will of Places\n---\n```\n\nI feel like places kind of have a will. Some places actively root for you, for example, universities. I feel them like that.\n\nWhen I'm about to leave a country, I'm usually more mindful of this. Probably because of the surreal sensation, and the hyperfocus of noticing little details, how people are, how the environment is, when you get nostalgic as you leave.\n\nIn a sense, you can find companionship in landmarks, and places, environments and so on...\n\nSimilar ideas can be found in Clannad,1st season and Under the Bridge by Red Hot Chilli Peppers.\n\n>Nagisa:\"If perhaps this town has the same will as that of the people's hearts, and if we should bring happiness to those who live in this town, if such feelings should exist, then perhaps the town brought about this miracle. But that wouldn't be a miracle, would it? The people who love this town live here, and the town that loves them will love them. That should be the case, no matter where it may be. We love the town, bringing it up.\"\nTomoya: \"So the town is a big family?\"\nNagisa: \"Yes, the Dango Daikazoku.\"\n\nhttps://whammyman5.livejournal.com/4076.html"
        },
        {
            "id": "wolf-of-reality",
            "url": ".././bubbles/wolf-of-reality",
            "category": "bubbles",
            "title": "Wolf of Reality",
            "content": "```yaml\n---\ntitle: Wolf of Reality\n---\n```\n\nJust a wolf (usually female, \"la realidad\"), that I imagine when I'm feeling bad because of the current state of my [[perspective-reality]]. I will imagine that this wolf -although challenging me as reality-, does not mean harm to me; and even more so, tries to soothe me.\n\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[perspective-reality]: .././bubbles/perspective-reality \"perspective-reality\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "writing-a-paper",
            "url": ".././bubbles/writing-a-paper",
            "category": "bubbles",
            "title": "Writing a Paper",
            "content": "```yaml\n---\ntitle: Writing a Paper\n---\n```\n\n## The outline method\n\n- https://howtowriteanacademicpaper.com/sentence-outline.html\n- http://employees.oneonta.edu/keelgl/Outlining%20example.pdf\n- https://bacwritingfellows.commons.gc.cuny.edu/using-an-outline/\n- https://academicguides.waldenu.edu/writingcenter/writingprocess/outlining\n- https://advice.writing.utoronto.ca/planning/topic-sentences/\n- https://courses.lumenlearning.com/boundless-writing/chapter/steps-of-writing-a-paper/\n\n## The minimal viable paper\n\nFrom the outline method one can easily use LLMs to generate a minimal viable paper."
        },
        {
            "id": "writing-and-thinking",
            "url": ".././bubbles/writing-and-thinking",
            "category": "bubbles",
            "title": "Writing and Thinking",
            "content": "```yaml\n---\ntitle: Writing and Thinking\n---\n```\n\nI think this also applies to code. Code forces you to get rid of ambiguity, which forces us to understand.\n\nCuriosly, I found related papers randomly when searching about the zettelkasten [[knowledge-graph]]\n\n![](https://zettelkasten.de/posts/collectors-fallacy-confession/201503031557_envelope.jpg)\nsource: https://zettelkasten.de/posts/collectors-fallacy-confession/\n\n>Sönke Ahrens' How to Take Smart Notes, chapter 5, \"Writing Is the Only Thing That Matters\".\nhttps://www.reddit.com/r/Zettelkasten/comments/o1w5qi/is_zettelkasten_worth_the_effort/\n## Checkout\n\nhttps://www.jstor.org/stable/374203\n\nhttps://writingisthinking.com/the-writing-is-thinking-philosophy/\n\nhttps://www.sciencedirect.com/science/article/abs/pii/S0388000107000046\n\nhttps://www.animalz.co/blog/the-problem-with-writing-is-thinking/\n\nhttps://medium.com/mind-cafe/writing-is-the-purest-form-of-metacognition-ef6458472f02\n\nhttps://journals.sagepub.com/doi/full/10.1037/1089-2680.12.1.9\n\n\n\n\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[knowledge-graph]: .././bubbles/knowledge-graph \"knowledge-graph\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "writting-during-vs-after-journey",
            "url": ".././bubbles/writting-during-vs-after-journey",
            "category": "bubbles",
            "title": "Writing During vs After Journey",
            "content": "```yaml\n---\ntitle: Writing During vs After Journey\n---\n```\n\nRMB had some comments and books about this...\n\nBolívar wrote during... Something like that.\n\nWritings after the fact are devoid of the tension maybe... As it is resolved by the time you finally sit down to write.\n\nIf you write during, you can really see the struggles on the spot, infraganti. The quality of the narration will be purer.\n\nOtherwise, some of the emotion is lost by the resolution of the situation through the natural passage of time.\n\n"
        },
        {
            "id": "colmenas-individuos",
            "url": ".././essays/colmenas-individuos",
            "category": "essays",
            "title": "De Colmenas e Individuos",
            "content": "```yaml\n---\n  title : De Colmenas e Individuos\n---\n```\n\n<p style='text-align: justify;'>\nErase una vez tres seres sin nombre y completamente iguales. Estos tenían sexo y por alguna extraña razón, del acto se producían seres iguales a ellos. La primera vez se crearon 9, la segunda 99, la tercera 999; y así se generó la primera colmena, sin nombre alguno. Los seres hasta ahora solo tenían sexo porque no sabían hacer más nada, no tenían ninguna otra necesidad: no había hambre, no había enfermedades,  ni guerras, ni muerte.\n</p>\n<br/>\n<p style='text-align: justify;'>\nEntre ellos no habían nombres, ni tampoco la idea de identidad, la conciencia era colectiva. Sin embargo, -contra todo pronóstico- la colmena empezó a sentir un vacío existencial y de repente, desde la naturaleza misma de las mutaciones, aparecen dos seres diferentes y desconectados de la conciencia colectiva de la colmena.\n</p>\n\n<br/>\n<p style='text-align: justify;'>\nLos dos primeros \"diferentes\" - como fueron llamados  mucho tiempo después -  se sentían diferentes y alineados de la colmena y sentían la necesidad de encontrar otros seres igualmente diferentes a ellos. Así se pusieron la misión de desconectar a la colmena ser a ser; primero 2, luego 4, 8 y así se creo la primera nación (¿o noción?) de individualidad. Entre ellos surgió el nombre: Cero y Dos para los primeros diferentes y de esta manera sucesivamente para los demás. Estos seres diferentes peleaban y se persuadían entre ellos, no se ponían de acuerdo en nada. Había quienes abogaban por volver a la colmena ya que las diferencias les dolían. Otros solo recurrían a seguir ciegamente las enseñanzas de Cero y Dos, ya que por alguna razón -según ellos- así \"la diferencia\" dolía menos. Algunos escapan del grupo de los diferentes pero no regresaban a la colmena, solo ellos mismos saben a donde fueron. En la nación de lo heterogéneo había de todo, y lo normal era que cada quien fuera por su rumbo.\n</p>\n\n<br/>\n\n<p style='text-align: justify;'>\nDurante todo este tiempo la colmena siguió sufriendo bajas debido a la continua des-conexión perpetrada por \"los diferentes\". Esto creo la primera noción de \"problema\" en el reino de lo perfectamente homogéneo. Así la colmena dejo de tener solo sexo y empezó a idear estrategias para contener a los \"diferentes\". Extrañamente así la colmena se sentía más llena, con más sentido. Ya no todo era solo sexo. La colmena, contra toda ley lógica ideo más problemas para entretenerse. Crearon el hambre, la enfermedad, la guerra y la muerte. Perdiendo el control, la colmena se desbarató ante su nuevo entretenimiento.\n</p>\n\n<br/>\n\n<p style='text-align: justify;'>\nSolo quedaban así en el mundo la nación de \"los diferentes\", la nación de lo heterogéneo. Sin embargo, entre sus nuevas generaciones se hizo fuerte la corriente de volver a la colmena, de recrearla, de volver a lo homogéneo. No soportaban el dolor de \"la diferencia\", no encontraban abrigo en \"la identidad\". Y así, tal cual como se desbarató, conexión a conexión la colmena renació.\n</p>\n\n<br/>\n\n<p style='text-align: justify;'>\nDicha historia se repitió en 999 iteraciones y de 1024 maneras. Alguna vez un individuo o la propia colmena (o tal vez ambos) pensó que \"todo era un paradójico péndulo\". Entre la colmena y el individuo existe la necesidad de pertenecer y de individualidad. En aquella paradoja se crea y se descrea la sociedad. En ella nace lo anárquico y lo sistemático, lo democrático y lo autoritario. Ya nadie esta seguro de nada pero sin duda se entretienen bastante.\n</p>\n\n# Autores\n\n- Yorguin José Mantilla\n- Maury Marmolejo Din\n- Juan Esteban Gutiérrez\n- Raúl Arcila\n\n# Anotaciones\n\nEsta vaina fue hecha en 10 minutos en una clase, así que no espere mucho de ella.\n\n"
        },
        {
            "id": "feminismo",
            "url": ".././essays/feminismo",
            "category": "essays",
            "title": "Feminismo - Una primera exploración a propósito de la película \"Las brujas de Zugarramurdi\" de Aléx de la Iglesia",
            "content": "```yaml\n---\n  title : Feminismo - Una primera exploración a propósito de la película \"Las brujas de Zugarramurdi\" de Aléx de la Iglesia\n---\n```\n\n> Me preocupa mil que el feminismo de redes sociales esté tan lleno de veganas antiespecistas militantes. No porque me desagrade el veganismo y el antiespecismo, que me parecen posturas super interesantes, sino porque ellas ven sus ideas como consecuencia necesaria del feminismo. Ergo, una feminista no vegana es en realidad una feminista \"falsa\". Es preocupante la denostación del feminismo de otras mujeres en pos del \"purismo\" que ellas defienden.\n\n<p style='text-align: justify;'>\nSiendo honesto creo que nunca había procrastinado tanto al hacer un ensayo; y digo ensayo ya que realmente no\nme interesa hacer un texto expositivo en este caso. En ese sentido me he concentrado más en la reflexión y\nanálisis personal. Durante los últimos tres días he estado leyendo acerca de estos movimientos, he hecho alguno\nque otro test para determinar mi posición más fácilmente, me he visto la película de Alex de la Iglesia y algunos\nvídeos de \"un violador en tu camino\". Por ahí en el segundo día se me ocurrió que sería interesante saber que\npensaban mis contactos de Facebook acerca del feminismo; la cita previa es perteneciente a uno de ellos.\nMe remito a dicha cita para ilustrar que alguien desinformado -como yo al comenzar el semestre- puede pensar\nerróneamente que el feminismo es homogéneo entorno a sus postulados y posiciones. El hecho de que exista un\nfeminismo anti-especista [1] y de que haya gente feminista con opiniones como las de mi contacto deja en claro\nde que hay mucho debate en torno a que debería ser el feminismo y qué es lo esencial de este. Muchos de los\nroces entre distintas corrientes feministas derivan de diferencias culturales y étnicas entre los grupos\nrepresentados; otras separaciones derivan de disonancias más filosóficas: ¿Cuál es el problema en sí? ¿Cómo\ndebería resolverse? ¿En qué términos se define la igualdad y la equidad? ¿Qué posición moral se adopta\nrespecto a X acción? ¿Es el \"hombre\" oprimido junto con la \"mujer\" o este representa meramente un papel de\nopresor? Tal variedad de matices hace sin duda difícil la exploración conceptual del mundo del feminismo.\n</p>\n\n## El camino del macho: de héroe a dragón\n\n<p style='text-align: justify;'>\nEn efecto, sería una simplificación muy burda por ejemplo tratar de caracterizar el feminismo mediante un\nhimno como lo es \"un violador en tu camino\" ya que analizando la letra es fácil darse cuenta de que proviene de\nuna posición feminista-radical de elementos que existen todavía en el mundo: la violación y el homicidio de\nmujeres. Uno puede tomar dichos problemas y estudiarlos bajo la lente de cada forma de feminismo. En\nparticular el himno se inspira de los escritos de Rita Segato, quien ha tratado el tema de violencia de género\ndesde un punto de vista teórico [2], planteando que la violación no es un asunto sexual sino de ejercer poder\npolítico sobre un género, en este caso perpetrado por el patriarcado. Otro de los conceptos que es bueno traer a\ncolación de esta autora es la idea del \"mandato de masculinidad\" [2], que es en mi opinión otra forma de\nnombrar el rol masculino, lo que es ser \"macho\". Dicho elemento también se ve reflejado implícitamente en \"un\nviolador en tu camino\"; si bien sus creadoras citan al himno de los carabineros de Chile de forma irónica [3], el\nhimno original de los carabineros en sí contiene lo que constituye para mí un mito fundacional de lo masculino:\n</p>\n\n> Duerme tranquila, niña inocente, sin preocuparte del bandolero, que por tu sueño dulce y sonriente vela\n> tu amante carabinero.\n\n<p style='text-align: justify;'>\nKipnis en [4] reflexiona acerca del arquetipo fragmentado de Héroe (hombre generalmente), Dragón-Victimario\n(hombre también) y la Princesa-Victima (mujer generalmente). Según su análisis todos estos personajes se\nencuentran en todas las personas y que generan aún repercusiones en el inconsciente colectivo moderno\nrespecto al género. En esa estrofa en particular es evidente que personaje es cada quien. Curiosamente\nencuentro palabras de Segato acerca de este modelo cuando habla de que el \"el victimismo no es una buena\npolítica para las mujeres\" [5]:\n</p>\n\n> Lo que los medios deberían destacar y repetir sin reserva y hasta con exceso es que quien rescata a Thelma es un grupo de mujeres, son sus pares, sus > colegas, sus amigas, sus hermanas en el proceso político que estamos viviendo en Argentina y en el continente: **mujer salva mujer y muestra al mundo lo que tiene que cambiar. No hay un príncipe valiente. Hay política, que es más lindo, más heroico y más verdadero. La mano salvadora viene de nuestra amistad y alianza.**\n\n<p style='text-align: justify;'>\nKipnis menciona que surgen problemas cuando alguno de estos \"personajes\" nos domina, y que mientras los\nefectos nocivos de la sobre-identificación con el arquetipo de Princesa se han vuelto claros a través de los años\npara las mujeres, los efectos nocivos de la sobre-identificación con el Héroe no son obvios para los hombres. La\nverdad me ha dejado impresionado la cantidad de paralelismos susceptibles de trazarse entre estas ideas con las\npropias del \"mandato de masculinidad\" de Segato. Por ejemplo, mientras ella dice que el hombre no se visualiza\ncomo persona digna de respeto a menos de que tenga algún atributo de \"potencia\" [6], Kipnis recalca que al\nsentirse que debe ser Héroe el hombre busca tener un nivel de éxito más allá de la capacidad de los mortales\npara poder ser amado por una mujer [4]. Ambos concluyen que dicho molde implica finalmente conductas\nviolentas y ausentes de empatía.\nEl arquetipo de Héroe a su vez ha influenciado la asimetría entre el concepto de sororidad y el concepto de\nfraternidad. A saber originalmente Miguel de Unamuno acuño el termino de sororidad para dar nombre a la\n\"hermandad femenina\" en contraste con el de fraternidad (que vendría de hermano) [7]. Es irónico en el sentido\nde que la solidaridad y cercanía en la sororidad a mi parecer es más profunda que la ofrecida por la fraternidad.\nPienso que esto emerge de la propia noción de masculinidad entendida como estoicismo, independencia y\nfortaleza. Kipnik reflexiona diciendo que el Héroe es incapaz de hacer conexiones profundas con los otros al\npresentarse solitario, narcisista y egoísta. A lo mucho los hombres podrán hablar entre sí de mujeres, muy al\nestilo que se presenta en Las brujas de Zugarramurdi por los tres principales personajes hombres. Cualquier otro\ntema profundo es ya demasiado sensible y la vulnerabilidad es demasiado incomoda de mostrar, -de nuevo-\nmuy al estilo de la confesión de sentimientos entre los inspectores en la película. Esta incapacidad emocional\nexplica en parte la asimetría de las tasas de suicidio según el género, donde los hombres pueden llegar a ser 5\nveces más propensos a cometerlo [8]. A nivel contemporáneo es curioso ver la necesidad de incluir la aclaración\nde \"no-homo\" cada vez que se hace alguna acción que atenta contra la masculinidad, en particular con el\nintercambio emocional entre amigos [9].\n</p>\n\n## El camino de la bruja: de princesa a prostituta\n\n<p style='text-align: justify;'>\nLas brujas de Zugarramurdi por otra parte también ofrece el trío Héroe/Dragón/Princesa en su narrativa con una\nligera variación en cuanto a los géneros. El Héroe se representa de forma más constante en el Padre del Niño,\nmientras que la Princesa en este caso es el Niño. Digamos la subversión más clara es el Dragón al verse\nrepresentado en las Brujas y finalmente en la versión grotesca de la Venus de Willendorf.\nLa película hace un uso muy caricaturesco de la bruja como arquetipo. Algo que queda muy claro es que la\ncualidad de \"bruja\" de alguna forma tiene que ver con la mujer soltera, o sin éxito romántico (¿Qué es lo mismo\nque no tener éxito?). Esto se ve tanto en la Madre del Niño como en la Nieta de las Brujas. Ya para el final de la\npelícula la Nieta, como resultado de enamorarse del Padre, empieza a presentar cualidades heroicas (al menos\ndesde el punto de vista del Padre), y no tanto de bruja. Curiosamente podemos ver como recibe el afecto del\nPadre solo cuando su acto heroico es completado, previo a eso la reciprocidad es alimentada solo por miedo o\natracción sexual; esto es consistente con el arco del Héroe que se prueba a si mismo ante la Damisela. Por su\nparte la Madre del Niño pasa de Héroe (al tratar de salvar a su Hijo) a Dragón al convertirse en Bruja. Ahora\nbien, cabe aclarar que si bien en la película pareciera sugerir una noción de quien es bueno y quien es malo, está\nen realidad es muy flexible. A saber la única razón por la cual uno podría considerar a las Brujas como\nantagonistas es por una posible identificación nuestra con los personajes \"normales\", con aquellos que no tienen\npoder mágico; lo cual es alimentado por el uso del miedo y el horror a lo largo del film. La primera escena se\nbasa en el robo de una joyería por parte de dos de los protagonistas, revelando pues que en realidad estos dos\npersonajes están en el margen de lo antisocial, es decir a su vez son anormales. Al eliminar el aspecto mágico\ndel film podríamos resultar realmente con un grupo de feministas y un grupo de delincuentes y si tuviera pues\nque ubicar ideológicamente el movimiento de las brujas estaría inclinado a analizarlas bajo un contexto de\nfeminismo radical algo separatista en su metodología.\nA su vez es interesante analizar el uso de la sexualidad en la película ya que muestra algunos estereotipos de\ncómo cada género ve la sexualidad. Por un lado dos de los protagonistas quedan prácticamente hechizados por\nla atracción hacia la Nieta, al punto del que el Padre olvida que tiene rescatar a su Hijo. Refleja pues como al\nhombre “se le dificulta” controlar el impulso sexual, resaltando su cualidad de bestia. Por su parte la Nieta usa\nla sexualidad como instrumento de poder o de persuasión sobre los protagonistas. Luego en otra escena a la\nNieta se le recrimina el hecho de que esté enamorada del Padre, y de que simplemente -debería- reducirlo a un\njuguete sexual. Uno podría pensar que se está haciendo uso del sexo como una forma de ejercer poder, y es\ncurioso verlo a la luz de los pensamientos de Segato. Si la violación es un acto político donde se ejerce poder,\n¿qué se puede decir entorno al sexo como tal?. Dicho tren de pensamiento puede llegar al tema de la\ncosificación sexual de la mujer la cual por momentos se invierte en la película. Christina Sommers[10] y Naomi\nWolf[11] argumentan que la liberación sexual de la mujer ha llevado a las mujeres a una inversión de roles\ndonde se ve a los hombres como objetos sexuales de una manera similar a lo que se critica del tratamiento de la\nmujer por parte del hombre. Contrariamente uno podría interpretar dicha reclamación sobre tener al hombre\ncomo juguete sexual no tanto como una demostración de poder sino como una aceptación del impulso sexual de\nla mujer, de que la mujer también es bestia, en consonancia pues con la liberación sexual de la mujer.\nEl análisis de la sexualidad es un tema que es otro mundo en sí mismo y en el cuál el feminismo incursiona. Por\nejemplo se podría establecer que la Virgen María es un mito fundacional al implicar que la virginidad de la\nmujer es una cualidad valiosa; pareciera que el acto sexual \"ensucia\" de una u otra forma. Es muy común la\ndiscusión sobre la asimétrica percepción de la promiscuidad de hombres y mujeres, mientras uno es exitoso el\notro es una prostituta. Hay quienes justifican dicho doble-estándar mediante modelos biológicos como el\nprincipio de Bateman [12] donde los machos compiten de forma promiscua y las mujeres escogen. Así el éxito\nreproductivo para el macho aumenta con el número de parejas mientras que para la hembra no. La biología no\nsolo informa (¿o desinforma?) este debate sino también el de la asimetría en la inversión parental. Para mí la\nbiología es valiosa en este tipo de debates pero hay que medir bien cuán sano es el uso de argumentos basados\nen el determinismo biológico como si estos fueran la última palabra; a saber, aunque uno obvie el\nreduccionismo y diga que el determinismo biológico es verdadero, uno puede ceñirse a que la humanidad es un\npuente y no una meta... es decir al trans-humanismo para argumentar que no hay razón por la cual restringirse a\nlo \"natural\". Por ejemplo, si se desliga de la mujer el rol de madre y el concepto de fertilidad, el éxito\nreproductivo de ella no estuviera ligado con nociones de escoger \"al mejor\" y aún más sería un sin-sentido en\neste contexto ya que no se tendría sexo \"por reproducirse\"; en ese caso ¿se juzgaría la promiscuidad de la mujer\nde la misma forma?\n</p>\n\n## Conclusión\n\n<p style='text-align: justify;'>\nEl feminismo es un mundo muy diverso y con disonancias entre sus continentes. Para mi este ensayo fue un\nexperimento donde embarque desde el himno de \"un violador en tu camino\", es decir desde una expresión del\nfeminismo radical; sin saber realmente a donde llegaría pero partiendo del material que absorbí del feminismo y\nde los roles de género. En eso me he encontrado con la influencia de los arquetipos/mitos\nfundacionales/personajes en nuestra construcción de la identidad, de los roles y de cómo se juzgan las acciones\nde acuerdo al rol que \"deberíamos cumplir\".\n</p>\n\n## Referencias\n\n\\[1\\]:<https://latfem.org/nada-mas-patriarcal-que-comerse-un-animal><br/>\n\\[2\\]:<https://www.bbc.com/mundo/noticias-50735010><br/>\n\\[3\\]:<https://www.bbc.com/mundo/noticias-america-latina-50690475><br/>\n\\[4\\]:Aaron Kipnis (1994) Men, movies, & monsters: Heroic masculinity as a crucible of male violence.<br/>\n\\[5\\]:<https://www.eldesconcierto.cl/2018/12/17/rita-segato-el-feminismo-no-puede-y-no-debe-construir-a-los-hombres-como-sus-enemigos-naturales/><br/>\n\\[6\\]:<https://www.lahaine.org/mundo.php/segato-por-que-la-masculinidad><br/>\n\\[7\\]:<https://es.wikipedia.org/wiki/Sororidad><br/>\n\\[8\\]:<https://en.wikipedia.org/wiki/Gender_differences_in_suicide><br/>\n\\[9\\]:<https://around.uoregon.edu/content/study-men-often-use-homophobic-tweets-protect-masculinity><br/>\n\\[10\\]: Sommers, Christina (1995). \"The gender wardens\". Who stole feminism?: how women have betrayed\nwomen. pp. 264–265. según <https://en.wikipedia.org/wiki/Sexual_objectification><br/>\n\\[11\\]: Wolf, Naomi (1994). Fire with fire: the new female power and how to use it. New York: Fawcett\nColumbine. pp. 225–228. según <https://en.wikipedia.org/wiki/Sexual_objectification><br/>\n\\[12\\]:<https://en.wikipedia.org/wiki/Bateman%27s_principle><br/>\n\n"
        },
        {
            "id": "peaceful-warrior",
            "url": ".././essays/peaceful-warrior",
            "category": "essays",
            "title": "El camino del guerrero (Peaceful Warrior)",
            "content": "```yaml\n---\n  title : El camino del guerrero (Peaceful Warrior)\n---\n```\n\n## Resumen\n\n<p style='text-align: justify;'>\nEl camino del guerrero (Peaceful Warrior) es una película del 2006 dirigida por Victor Salva, escrita por Kevin Bernhardt y basada en la novela Way of the Peaceful Warrior de Dan Millman. Como tal tanto la película como la novela son semi-autobiográficas, narrando la propia historia de Dan Millman pero agregando varios elementos ficticios. Así, el protagonista de la película hereda directamente el nombre del autor del libro: Dan Millman, y al comienzo de la película se muestra como un joven gimnasta con un prometedor futuro rebosante de éxito. Su sueño es ganar la medalla de oro en los juegos olímpicos y para ello entrena muy duro, a menudo sobreexigiendo su cuerpo.\n<br/>\n<br/>\nSin embargo, a pesar de que Dan parece tenerlo todo claro, sufre de insomnio e inquietud. Entre las cosas que lo atormentan (y de forma muy premonitoria) está la pesadilla de la fractura de sus piernas al caer de una de sus actuaciones. Dan ante estos miedos simplemente recurre a distracciones como salir a correr durante las noches; es así como conoce a quién más adelante apodaría como “Sócrates”. En principio Dan sale a correr y decide parar a comer en una estación de servicio donde trabaja Sócrates. La interacción es relativamente cotidiana hasta qué Dan se marcha y vé que Sócrates sube al techo de la estación de servicio de forma inexplicable; de esta manera empieza la fascinación de Dan por quien sería en un futuro su maestro.\n<br/>\n<br/>\nSin embargo, en un comienzo Dan sigue su vida normalmente y solo vuelve a la estación de servicio para entender como Sócrates logró la hazaña. Sócrates por otra lado se encuentra más interesado en el conocimiento y la filosofía al decirle que el conocimiento no es lo mismo que la sabiduría, ya que esta última es realmente hacerlo. Así mismo, Sócrates cuestiona el objetivo de calificar para las competencias de Dan y más aún cuestiona su felicidad; a lo que Dan responde que tiene todo: dinero, excelencia académica, reconocimiento social, es sexualmente activo y tiene buena forma física… y sin embargo Sócrates le pregunta qué por qué no puede dormir por las noches entonces. Es así como Sócrates revela que, a pesar de que Dan lo tiene “todo” aparentemente, este no tiene paz mental. Dan se ve notablemente irritado por todas esas preguntas y simplemente se va.\n<br/>\n<br/>\nEn efecto Dan es una persona impaciente, egocéntrica, temeraria, con una actitud brusca ante las otras personas; aunque tiene amigos, él mismo no es un amigo para los demás. A medida de que su mente lo sigue atormentando sigue volviendo a la estación de servicio para interactuar con Sócrates. A raíz de esto el maestro le da una serie de tareas y lecciones. Algunos conceptos centrales de la filosofía de Sócrates son la idea de que uno tiene que vivir enteramente en el instante actual, que siempre algo interesante está ocurriendo si se mira más allá, etc. Estas lecciones son impartidas de forma práctica, a través de meditaciones y de una que otra experiencia mística.\n<br/>\n<br/>\nEl impacto de las lecciones en Dan es variado, por un lado logra dar una actuación excepcional en un área de la gimnasia que no era su fuerte; así mismo reevalúa sus hábitos para adoptar otros más estoicos sugeridos por Sócrates. Sin embargo, como resultado de la transformación intensa que sufre Dan respecto a su viejo ser, se empieza a ver más desconcentrado en sus prácticas en el gimnasio y empieza a cuestionar los resultados de las lecciones de Sócrates, además de juzgarlo por no ser una persona exitosa ya que solo dedica a una estación de servicios. Dan decide entonces rechazar las enseñanzas y los hábitos de su maestro para volver a como era antes. Naturalmente todo vuelve a ser como en el pasado, hasta que a raíz de su impaciencia característica Dan cruza con el semáforo en rojo y choca con un auto; como resultado del accidente Dan se fractura una de sus piernas en 21 pedazos. Afortunadamente es llevado al hospital y sobrevive, sin embargo los médicos se ven obligados a implantar una barra de metal en su pierna para mantener la integridad de esta. Finalmente el entrenador de Dan considera que ya no es apropiado que él compita y Dan se siente profundamente herido por esto.\n<br/>\n<br/>\nDan en medio de su furia destruye todos sus trofeos, y tiene una pesadilla donde casi se suicida; pero termina dejando ir a la versión pasada de su ser. De esta manera Dan acepta el presente tal y como es pero, con la pregunta interna de cómo redefinirse, vuelve a buscar a Sócrates. Otra vez, mediante las lecciones Dan llega a la autorrealización de que siempre hay algo ocurriendo y que por lo tanto no debe tener miedo a lo que sigue en su vida a medida de que se redefine. Dan así decide disculparse con aquellos que hirió en el pasado. Finalmente Sócrates lo convence de que no tiene que abandonar su sueño, y de que incluso así en su estado físico puede trabajar en su gimnasia.  Dan inicialmente es reacio a la opción ya qué ya había aceptado su condición pero cede y empieza a entrenar nuevamente. A raíz de esto Dan prácticamente se recupera totalmente y vuelve a pedirle a su entrenador que reconsidere la opción de que compita en los clasificatorios nacionales. El entrenador sin embargo se lo niega y Dan se vuelve a sentir perdido.\n<br/>\n<br/>\nSócrates ve esto y le propone a Dan una excursión en la cual Dan aprende una última lección: el viaje es lo que da la felicidad, no el objetivo en sí. Dan así entiende que hará gimnasia simplemente porque es lo que ama, más allá de las medallas y éxitos que eso le conlleve. Dan vuelve al gimnasio y realiza sus ejercicios como antes, más allá de la aprobación de su entrenador y  esté finalmente se convence de que Dan está en capacidad de competir.\n<br/>\n<br/>\nLa película concluye con Dan buscando a su maestro para verlo antes de los clasificatorios pero Sócrates ya no está en la estación de servicio. Dan reflexiona que al final aquella maniobra imposible de Sócrates ya no importa. Luego, en la competición Dan se prepara para su actuación mientras conversa con su compañero quien es un reflejo de algunos de los valores que Dan tenía en el pasado. Finalmente, Dan comienza su actuación final situándose completamente en el instante presente tal como lo había aprendido de su maestro y finaliza su acto ante la mirada atónita de los asistentes.\n<br/>\n<br/>\n</p>\n\n## Relación con la vida\n\n\n>“Luche por lo que usted quiere en la vida, y que es lo que quiere en la vida… usted solo sabe”. \n\n<br/>\nConversación detrás de la quebrada cerca de mi casa...\n\n<br/>\n<p style='text-align: justify;'>\nLa película toca varios temas de orden filosófico debido a la afición del maestro hacia la filosofía griega y en particular a Sócrates, el maestro de Platón. Así vemos que se exploran constantemente temas diversos como la idea de que “una vida que no se cuestiona, no merece ser vivida” originalmente de Sócrates (el personaje histórico real) y de que “lo único constante es el cambio” de Heráclito. Sin embargo hay tres temas constantes en la película:\n</p>\n<br/>\n1. Vivir en el momento (esta idea tiene orígenes budistas y en la filosofía greco-romana bajo el carpe diem)\n2. ¿Qué es la felicidad y cómo se obtiene?\n3. ¿Quienes somos?\n\n### Sobre la acción transiente\n\n<p style='text-align: justify;'>\nEl primer tema se refiere a la idea de que al aferrarnos a lo que fué (el pasado) y a lo que puede ser (el futuro) no logramos disfrutar, ni concentrarnos, <b>ni vivir en el momento</b>, es así como terminamos infelices y descontentos con el instante presente; incapaces de dar nuestro potencial completo. Esta idea es pues muy notable en los casos donde nuestra actuación es principalmente transiente como en los deportes, la música, la actuación, etc. En lo personal mi experiencia ha sido del lado más musical donde notoriamente existe el fenómeno de “parálisis por análisis”. Esto se puede ilustrar con el “dilema del ciempiés” de Katherine Craster:\n</p>\n\n>Un ciempiés paseaba contento <br/>\n>Hasta que un sapo burlón <br/>\n>Le dijo: «Cuéntame, ¿en qué orden mueves las patas?» <br/>\n>Le llenó de dudas hasta tal punto <br/>\n>Que cayó exhausto en el camino <br/>\n>Sin saber cómo correr. <br/>\n\n<p style='text-align: justify;'>\nBásicamente la idea es que si piensas demasiado en cómo hacerlo, o en las consecuencias de equivocarse, etc lo más probable es que falles como efecto retroalimentado de tu propia ansiedad y de tu propia desvinculación con el acto en sí. Sin embargo en un acto académico esto también tiene su contraparte, por ejemplo durante la resolución de exámenes. En general recuerdo un profesor que decía que ya en el momento de la ejecución del exámen lo mejor que se puede hacer es creerse un genio, sobretodo cuando uno ha llegado mal preparado a este. Esto es debido a que al creerse un genio al menos durante ese breve periodo de tiempo aumentas la probabilidad de dar lo mejor de ti simple y llanamente porque evitas caer en inseguridades y ansiedades provenientes de dudar de tus propias respuestas, además de ahorrar tiempo como resultado. Por otra parte si escoges las preguntas con las que te sientas mejor preparado al principio verás que la confianza que surge de responderlas bien te ayudará a sentirte mejor para las que vienen. En general podemos ver como nuestra propia actitud emocional ante la actividad que realicemos afecta nuestra efectividad.\n</p>\n\n### Un problema de definición\n\n<p style='text-align: justify;'>\nLos otros dos temas se pueden tratar simultáneamente, ya que en cierta manera la definición de nosotros mismos afecta en medida la forma en que entendemos ser felices. ¿Somos felices porque somos nosotros, porque alcanzamos nuestros objetivos, o por qué exactamente?. ¿Nos definimos a partir de nuestros objetivos? ¿Qué pasa si no somos capaces de controlar aquellos objetivos, si a pesar de todo nuestro esfuerzo esos objetivos podrían no cumplirse? En la película es muy claro el peligro de definirse mediante metas debido a que no tenemos control ante ciertas circunstancias, como lo puede ser un accidente.\n</p>\n\n<p style='text-align: justify;'>\nAquí es relevante una percepción cultural de la cual no estoy seguro cuán general es alrededor del mundo: la idea de “estudiar para ser alguien en la vida”. Como tal aquí vemos explícito la idea de definirse mediante una profesión: soy artista, soy médico, soy deportista, soy ingeniero, etc. Lo cierto es que la profesión es tan solo una de las tantas aristas por la cual una persona puede tratar de definirse, el riesgo es pues que uno podría equivaler el éxito en la profesión como indicador de nuestra felicidad. <b>Siempre habrá una persona mejor y peor que tú en tu profesión y esto es por lo menos cierto para todo el conjunto de personas en tu profesión excepto dos.</b>\n</p>\n\n>“Si soy un ingeniero en el tercer mundo probablemente no soy alguien realmente, debería ir al primer mundo y tener éxito allá para ser alguien”.\n\n<p style='text-align: justify;'>\nMe pregunto cuantos estudiantes y profesionales de los campos STEM (Ciencia, Tecnología, Ingeniería, y Matemáticas en inglés) en latinoamérica (y en general países en vías de desarrollo)  tendrán dicha percepción; por lo menos uno, que soy yo. Si uno tiene el sueño de ser premio nobel pero es nacido en un país en vías de desarrollo pues las posibilidades son muy bajas, pero es posible. De hecho están dados los casos de varios nobeles de literatura y de la paz latinoamericanos y algunos en los nobel de química.  Sin embargo hasta ahora no hay ningún medallista Fields (equivalente al premio nobel de matemática) latinoamericano. Entonces para un matemático es prácticamente un accidente haber nacido acá. Sin embargo, mediante conversaciones con personas profesionales y estudiantes que han visitado el extranjero el asunto no es un problema de talento o de potencial sino de recursos. El primer mundo no tiene personas considerablemente más talentosas, sino simplemente más recursos para potenciarlas. Y es que aparentemente en el extranjero todo es mejor, lo cual probablemente sea verdad… Pero la idea de que el éxito solo se puede obtener en el extranjero es debatible. Definir “el éxito” es pues un asunto difícil. El éxito es ¿reconocimiento?, ¿impacto?, ¿el fruto de un trabajo bien hecho?, ¿riqueza?. Así como me pregunto cuantos estudiantes y profesionales latinoamericanos plantean el éxito mediante la migración, me pregunto cuantos académicos, profesionales, estudiantes de posgrado, en los países desarrollados sueñan con ver un impacto real de su trabajo en la sociedad, en las comunidades y demás. Pienso que la evolución natural de una persona una vez obtenga reconocimiento profesional es hacerse esa pregunta… ¿Cuánto realmente impacta mi trabajo de forma positiva en el mundo?. Ciertamente, el hecho de que tu trabajo tenga influencia sobre una comunidad le añade significado, esta es la idea del “significado mediante la comunidad”, o del <b>“soy parte de algo más grande, y a través mi contribución a eso me defino”</b>. Esto se puede ver en la película mediante el personaje de Sócrates y su afición al arte del servicio. Realmente juzgar por qué medio es mejor definirse: “ser el mejor” (meta individual) o “generar impacto comunitario” (meta colectiva), es debatible.\n</p>\n\n### El problema de la elección\n\n<p style='text-align: justify;'>\nDefinirse a través de una profesión es a su vez difícil porque muchas veces dicha profesión está asociada con una pasión inherente que las personas deben tener… Si uno tiene una pasión concreta la idea de “seguir tu pasión” es muy buena, el problema surge en los otros dos casos: a) tienes muchas pasiones y te cuesta elegir, y b) no tienes ninguna pasión en particular. Me atrevería a decir que la mayoría de la gente cae en alguno de esos dos casos más que en el caso ideal. Entonces… ¿qué hacemos el resto de los mortales?. Cal Newport plantea para el caso de que no se tiene una pasión el hecho de que uno no se debe preocupar por encontrarla, ya que esta pasión (o satisfacción profesional) más que algo innato es algo que se construye a medida que se va adquiriendo experticia en tu oficio. El postula que una profesión viable para obtener la satisfacción personal debe cumplir 3 requerimientos: 1) Que por lo menos tengas interés en el área. 2) Que puedas crecer en ella, es decir que puedas desarrollarte y ascender en tu oficio. 3) Que no colisione con tus valores personales (que sientas que no perjudica al mundo activamente por ejemplo). Por otro lado para el caso en que simplemente tenemos demasiadas pasiones posibles la idea es librarte de algunas de ellas ya que, más que alimentarte, las excedentes te distraerán de concentrarte en la prioritaria. En cierta manera esto tiene que ver con la paradoja de la elección: cuando hay demasiados posibles caminos es muy difícil elegir (Barry Schwartz). El hecho de tener demasiadas posibilidades abiertas te hace menos libre paradójicamente; cualquiera que elijas te hará preguntarte qué hubiese pasado al escoger la otra. Es por esto que la libertad se puede alcanzar mediante el compromiso (Mark Manson), y por lo cual pertenecer nos hace libres... libres de porfin poder autorrealizarnos en lo que escogimos.\n</p>\n\n<p style='text-align: justify;'>\nEl problema de la elección es algo a lo que me he enfrentado continuamente. Cuando me gradué de bachiller tenía intereses claros: me gustaba la música, la física y la filosofía. Combine la dos primeras en la meta de estudiar ingeniería de sonido y la última simplemente decidí explorarla como hobbie. Como la ingeniería de sonido no era una carrera de universidad pública me fui por su madre: la ingeniería electrónica. Así mis primeros tres años de la universidad en ingeniería electrónica constituyeron en explorar de forma extracurricular la ingeniería de sonido además de trabajar como músico en competencias de gaitas venezolanas intercolegiales. Al tiempo traté de estudiar en un conservatorio de música. Lo cierto es que es muy difícil mantener dicho ritmo cuando pasas a los semestres más fuertes.  Y tuve que abandonar esos oficios extras, como respuesta a esto participé en la fundación del Club de Audio de la universidad y seguí participando en grupos musicales pero dentro del campus. Básicamente en esos primeros tres años de universidad adquirí todo el conocimiento y práctica que pude acerca de música e ingeniería de sonido. Sin embargo, al final me di cuenta que la ingeniería de sonido no era lo mío, al menos a nivel intelectual no me llenaba completamente y decidí vivir la música también como hobbie junto con la filosofía. En esos momentos tuve que redefinirme ya que hasta entonces lo había hecho a través de mis intereses musicales. Mi pasión por la ingeniería de sonido paso a la ingeniería acústica, luego a los sistemas microelectromecánicos (MEMS), luego a la  acústica del ultrasonido. De ahí se me abrió el campo ya que este último tiene aplicaciones médicas y así es como salte a la ingeniería biomédica y la bioingeniería. Comencé con intereses en la bioinstrumentación y en el procesamiento de bioseñales; luego me empezaron a interesar los aspectos más biológicos como la biología de sistemas y la biología sintética. Estas últimas áreas ya se salían de mi campo de electrónica demasiado por lo que volví a enfocarme en procesamiento de señales. Finalmente desemboque interesándome en el campo de sistemas complejos, la ciencia de datos y la epistemología de ambos; ya que esos tres campos abarcaban a nivel general todos esos intereses qué había tenido en el pasado. Sin embargo todo está sujeto a cambios y es por ello que definirse mediante intereses, profesiones, pasiones puede no ser la mejor idea.\n</p>\n\n### La definición mediante valores\n\n<p style='text-align: justify;'>\nUna opción menos volátil para definirse como persona es optar por tus valores ya que el supuesto es que estos son más constantes y son relativamente independientes de factores que no puedas controlar como accidentes y (en mi caso) de cambios constantes de intereses. La incertidumbre se puede presentar en cualquier momento de nuestras vidas pero podemos enfrentarnos a ella mediante nuestros valores. Así es posible definirse como una persona honesta, respetuosa, etc. Pero ¿cómo podemos definir nuestra felicidad en ese ámbito si no hay un objetivo en sí? Uno puede ver la felicidad como el resultado de cumplir con los valores que has escogido para definirte. Es decir, a pesar de que surjan adversidades se puede ser feliz si te mantienes fiel a ti mismo. Y sin embargo… a pesar de que la idea es atrayente uno puede encontrarse infeliz en determinados momentos. A mi parecer culturalmente ponemos demasiado valor en ser felices, como si tal fuera el motivo de vivir. Y esa presión de ser felices nos causa ansiedad. La vida trae consigo muchas otras emociones que experimentar porque más que un asunto de felicidad, es un asunto de salud emocional. Es correcto sentir lo que sientes en tus circunstancias, y a medida de que uno se transforma a sí mismo, transformamos nuestras propias emociones. En la película vemos que Dan pasa por múltiples emociones para poder redefinirse y en esos momentos Dan no tenía que ser feliz, sino que tenía que experimentar dichas emociones tal cual se daban. Para mí más que un problema de felicidad es un problema de concentración; los momentos que más disfruto son aquellos donde estoy más concentrado: en un partido de fútbol, en una fiesta, en el resolver de un problema matemático, al programar, al jugar, al escribir. Es precisamente en esos instantes donde uno está concentrado que uno <b>“vive en el momento”</b> como dice la película. Ni el pasado, ni el futuro existen cuando estas concentrado. Solo existe el ahora y la acción que realizas. En ese sentido para definirme agregué a esos valores más comunes (honestidad, respeto, solidaridad, etc) el valor de la concentración, entendida como la idea de buscar estar inmerso en aquello que hago.  Otro valor por el cual me defino es hacer cosas que yo quiera (no exclusivamente claro está). No me importa dónde terminaré yendo, si vuelvo a Venezuela, si me quedo en Colombia, o si viajo a un país desarrollado ya que donde sea que esté sé que haré algo interesante por lo menos.\n</p>\n\n### El problema del cambio y conclusión\n\n<p style='text-align: justify;'>\nAún así nuestros valores están modulados por las experiencias que vamos obteniendo a través de nuestras vidas, en otras palabras, no son inmutables. Yo plantearía que para definirse no hay una sola forma correcta. En principio esto es porque el problema de por qué existimos no está resuelto. La película hace énfasis en versiones estoicas de la respuesta mediante el personaje de Sócrates, pero como tal la filosofía no ha llegado a una respuesta única (¿ni llegará?). Por cada respuesta estoica que me den puedo generar respuestas existenciales, hedonistas, absurdistas, nihilistas, etc; e incluso una autoctona colombiana: el nadaismo. En ese sentido, el personaje de Sócrates de la película no tiene la última palabra, pero en su defensa, probablemente nadie la tendrá.\n</p>\n\n<p style='text-align: justify;'>\nPero entonces, ¿cómo respondemos la pregunta de cómo definirnos correctamente? Ya vimos que no hay forma certera de hacerlo y entonces la única opción es estar abiertos a la posibilidad de redefinición personal. Este es el ideal de “lo único constante es el cambio” que mencione al inicio. <b>Si uno es capaz de redefinirse no debe tener miedo ante la adversidad ya que sabe que hallará al menos una manera.</b>\n</p>\n\n"
        },
        {
            "id": "veneco",
            "url": ".././essays/veneco",
            "category": "essays",
            "title": "Sobre el híbrido colombo-venezolano",
            "content": "```yaml\n---\ntitle: Sobre el híbrido colombo-venezolano\n---\n```\n\n>So if I'm not *black* enough and if I'm not *white* enough, then tell me, Tony, what am I?\n\nDr. Don Shirley a Tony Lip\n\n>Argentina is all green and I had horses and animals everywhere. All of a sudden I was in a big city and didn't speak the language. I didn't really feel like I fit in anywhere. I was too English to be Argentine, too Argentine to be English, too American to be anything. The kids just didn't understand me in any shape or form. I used to get locked in lockers. I spent a lot of time in school crying in bathrooms.\n\nAnya Taylor-Joy\n\nEsta frase resume mucho de lo que a veces siento al tener ambas culturas y más aún políticamente al estar los países tan contrastantes:\n\n> Demasiado venezolano como para ser colombiano y demasiado colombiano como para ser venezolano.\n\nAlgun día terminaré este ensayo."
        },
        {
            "id": "week-01--june-7--to--june-13",
            "url": ".././gsoc/week-01--june-7--to--june-13",
            "category": "gsoc",
            "title": "week-01--june-7--to--june-13",
            "content": "```yaml\n---\ntitle: week-01--june-7--to--june-13\n---\n```\n\n## 1 What have you been doing this week?\n\n- Learned the main usage of MNE-BIDS\n- Making a test conversion of source brainvision data to bids, making sure the eeg data was automatically downloaded\n- Characterizing the relevant bids-information that MNE reads\n- Designing the translation rules file (ended up being a yaml file)\n- Going to the meetings with my mentors.\n- Met the team of EZbids\n\n## 2 What are you planning to do next week?\n\n- Participate in the OHBM Brainhack 2021, where the idea is to help the bidscoin team.\n- Finish and document the alpha version of the \"Translation Rules\" configuration file, then pass it to my mentors for feedback.\n- Make a high-level test using a bids validator (that is, be able to produce a valid bids-eeg directory).\n- Find or write a test routine that checks if two BIDS outputs are identical.\n- Implement CI through github actions\n\n## 3 Is anything blocking your progress?\n\nNot particularly, It has been hard knowing how to deal with the huge amount of information bids is able to carry. It is also hard dealing with what MNE infers from the files, since those fields depend on the eeg-formats along with more variables. As of now, the decision was to give priority to \"required\" bids information; we must assure this required information always exist whether from MNE reading or user-input.\n"
        },
        {
            "id": "week-02--june-14--to--june-20",
            "url": ".././gsoc/week-02--june-14--to--june-20",
            "category": "gsoc",
            "title": "week-02--june-14--to--june-20",
            "content": "```yaml\n---\ntitle: week-02--june-14--to--june-20\n---\n```\n\n## 1 What have you been doing this week?\n- Did a conversion example tutorial\n- Implemented a cli for the backend\n- Tested the conversion done was valid with the web bids validator\n- Attended the OHBM Brainhack\n- Did a prototype for the integration of sovabids with bidscoin\n\n\n## 2 What are you planning to do next week?\n- Implement CI un github\n- Make local test interfacing automatically with a bids validator\n- Finish the rules file syntax which is one of the deliverables\n\n## 3 Is anything blocking your progress?\n- No, it was quite a productive week\n"
        },
        {
            "id": "week-03--june-21--to--june-27",
            "url": ".././gsoc/week-03--june-21--to--june-27",
            "category": "gsoc",
            "title": "week-03--june-21--to--june-27",
            "content": "```yaml\n---\ntitle: week-03--june-21--to--june-27\n---\n```\n\n## 1 What have you been doing this week?\n\n- Made some discussion in the BIDSCOIN repo with the advances I had on the BRAINHACK\n- Implemented github actions in sovabids\n- Added test and code coverage functionality and badges\n- Added command line entry point\n- Wrote a function to make a simulated dataset to help with testing\n- Currently making a test to assert correct bids conversion that runs every time something is pushed to the main branch of the repository\n- Currently finishing the schema of the \"rules file\" that configures the conversion\n\n## 2 What are you planning to do next week?\n\n- Implement regex patterns for filepath parsing rather than my custom parser\n- Make some issues (and hopefully PRs) in mne-bids so that their functions allow more configuration on the bids-fields written\n- Make a function that allows the user to preview the conversion rather than DO the conversion. This will involve a \"mapping file\" that encodes how the conversion will be done to each individual file. This will be the output of the \"APPLY RULES\" module.\n- Migrate the actual conversion to the \"CONVERT THEM\" module\n\n## 3 Is anything blocking your progress?\n\nNope, this week wasn't as productive as the one before but that was because of family issues we are currently going through.\n\n"
        },
        {
            "id": "week-04--june-28--to--july-4",
            "url": ".././gsoc/week-04--june-28--to--july-4",
            "category": "gsoc",
            "title": "week-04--june-28--to--july-4",
            "content": "```yaml\n---\ntitle: week-04--june-28--to--july-4\n---\n```\n\n## 1 What have you been doing this week?\n\n- Added channel renaming support, changed backend for channel retyping\n- Documenting the rules file\n- Implemented regex path analysis\n- Migrated the conversion to the convert module\n- Added CLI entry points for the convert module\n- Designed and made the \"mapping file\"\n- Added test for cli tools: sovapply,sovaconvert\n- Documentation of utils,parsers module\n- Added datasets module (useful for testing and examples)\n- Added test for sova2coin (plugin in bidscoin)\n\n## 2 What are you planning to do next week?\n\n- Implement a validator for the rules file\n- Update the bidscoin plugin to the most recent bidscoin version\n- Implement mkdocs for the documentation\n- Implement error handling in the current code\n\n## 3 Is anything blocking your progress?\n\nNot explicitly blocking me, but I'm not sure how to best-design the API for the program.\n"
        },
        {
            "id": "week-05--july-5--to--july-11",
            "url": ".././gsoc/week-05--july-5--to--july-11",
            "category": "gsoc",
            "title": "week-05--july-5--to--july-11",
            "content": "```yaml\n---\ntitle: week-05--july-5--to--july-11\n---\n```\n\n## 1 What have you been doing this week?\n\n- Implemented Sphinx documentation at https://sovabids.readthedocs.io/ (took a lot of the work of this week)\n- Reimplemented the sovabids plugin for the bidscoin (sova2coin) (was too hacky before)\n- Remade the sovabids-bidscoin example in sphinx\n- Made a PR in bidscoin which was accepted https://github.com/Donders-Institute/bidscoin/pull/94\n- Tried to do a little documentation PR in sphinx https://github.com/sphinx-gallery/sphinx-gallery/pull/845\n\n### For this friday and weekend\n\n- Make documentation for the \"Mapping File\"\n- Improve the current API documentation (the examples are good but the functions documentation still lacks, it should also be in the sphinx syntax)\n\n## 2 What are you planning to do next week?\n\n### High Priority\n\n- Improve the architecture of the software (basically preventing the utils module from being a big ball of mud)\n- Design a possible API for connecting the software with a GUI (take inspiration in the plugin made for sovabids)\n- Discuss with the mentors the design of the DISCOVER RULES functionality (Im not even sure if it is needed, what bidscoin knows as \"heuristics\" are actually what we already call \"rules\").\n\n### If there is time, work in these would-be-nice features\n\n- Implement a logger for sovabids\n- Implement a validator for the rules file\n- Implement error handling in the current code\n\n## 3 Is anything blocking your progress?\n\nNot particularly\n"
        },
        {
            "id": "week-06--july-12--to--july-18",
            "url": ".././gsoc/week-06--july-12--to--july-18",
            "category": "gsoc",
            "title": "week-06--july-12--to--july-18",
            "content": "```yaml\n---\ntitle: week-06--july-12--to--july-18\n---\n```\n\n## 1 What have you been doing this week?\n\n- Made documentation for the \"Mapping File\"\n- Finished current API documentation\n- Discussed with the mentors the design of the DISCOVER RULES functionality\n- Designed an API based on the ideal GUI I imagine for the package.\n\n## 2 What are you planning to do next week?\n\nThrough this week I will hopefully get more feedback on the API and the preliminary version of sovabids as a whole. Until then I won't do major changes to the core so I will work on the stuff that has been on the buffer for a while:\n\n- Implement a logger for sovabids\n- Implement a validator for the rules file\n- Implement error handling in the current code\n- Make a conda environment based on the requirements file (useful for users)\n\n## 3 Is anything blocking your progress?\n\nThe API... I mean, is not blocking me. Just that I don't know it should be so that means I don't know how to improve it and \"advance\". I already called for [help](https://github.com/yjmantilla/sovabids/issues/25) though.\n"
        },
        {
            "id": "week-07--july-19--to--july-25",
            "url": ".././gsoc/week-07--july-19--to--july-25",
            "category": "gsoc",
            "title": "week-07--july-19--to--july-25",
            "content": "```yaml\n---\ntitle: week-07--july-19--to--july-25\n---\n```\n\n## 1 What have you been doing this week?\n\n- Splitting the utils module so that it was not a \"big ball of mud\"\n- Online meeting with the mentors about the current issues of sovabids\n- An early-stage implementation of the logging functionality\n- Fixed a bug with the test I did involving the online web bids validator\n- Designed a workflow which may make possible to do conversions without the user explicitly making the rules file\n- Designed a possible format  for the rules file that would take more advantage of metadata sources\n\n## 2 What are you planning to do next week?\n\n- keep cleaning the code\n- finish the logging functionality\n- make a function to infer the path pattern from an example\n- make a function to infer what channels where retyped from an example\n- do a proposal for the new possible format of the rules file\n- do a tutorial of fastapi to start the web API of sovabids\n\n## 3 Is anything blocking your progress?\n\nWith the web api, mainly my lack of experience with it.\n"
        },
        {
            "id": "week-08--july-26--to--august-1",
            "url": ".././gsoc/week-08--july-26--to--august-1",
            "category": "gsoc",
            "title": "week-08--july-26--to--august-1",
            "content": "```yaml\n---\ntitle: week-08--july-26--to--august-1\n---\n```\n\n## 1 What have you been doing this week?\n\n- Made with the mentors, a form to collect information on the target users of the software that was used in an event of the NIF (Neuroimaging facility of Australia)\n- Studied how REST and RPC APIs worked.\n- Did the fastapi tutorial to start the web API of sovabids\n- Implemented an early stage version of the RPC API for the software.\n- Did the proposal for the new possible format of the rules file\n\n## 2 What are you planning to do next week?\n\n- Evaluate the feedback from the NIF event\n- Improve the RPC API.\n- Make a function to infer the path pattern from an example\n- keep cleaning the code\n- finish the logging functionality\n\n## 3 Is anything blocking your progress?\n\nWell, my university started classes already, so now is going to be hard to maintain the same rhythm of development I did previously. Rather than doing 4 hours a day from monday to friday. I will have to do 2 and a half hours a day from monday to friday and do de 6 hours left on the weekend.\n"
        },
        {
            "id": "week-09--august-2--to--august-8",
            "url": ".././gsoc/week-09--august-2--to--august-8",
            "category": "gsoc",
            "title": "week-09--august-2--to--august-8",
            "content": "```yaml\n---\ntitle: week-09--august-2--to--august-8\n---\n```\n\n## 1 What have you been doing this week?\n\n- Made a function to infer the path pattern from an example\n- Added get_files to the API as suggested by one of the mentors\n- Implemented an early-stage web frontend for sovabids\n- Finished the core RPC WEB API.\n\n## 2 What are you planning to do next week?\n\n- Get a fully working version of the front-end\n- Document the WEB RPC API better\n- keep cleaning the code\n- finish the logging functionality\n\n## 3 Is anything blocking your progress?\n\nCurrently the inexperience with web front-end development\n"
        },
        {
            "id": "week-10--august-9--to--august-15",
            "url": ".././gsoc/week-10--august-9--to--august-15",
            "category": "gsoc",
            "title": "week-10--august-9--to--august-15",
            "content": "```yaml\n---\ntitle: week-10--august-9--to--august-15\n---\n```\n\n## 1 What have you been doing this week?\n\n- [x] Got a fully working preliminary version of the front-end\n- [x] Document the WEB RPC API better\n- [x] Analyzed the results of the poll done on w8 and presented them to the mentors\n- [x] Discussed with the mentors the final targets for the GSoC\n- [ ] Make API example doc --> To be done on the weekend\n- [x] finished info level logging functionality for main functions (apply_rules and convert_them)\n\n## 2 What are you planning to do next week?\n\nThe final targets discussed with the mentors:\n\n- Documenting a example of the GUI usage, so that the mentors can test it on various datasets\n- Implement the heuristic for inferring the path pattern from an example in the rules file\n- Make test and documentation for the incremental conversion use-case (the poll determined that to be a really important issue)\n\n## 3 Is anything blocking your progress?\n\nThis week, nope hehe. Just a lot of work from school which restarted a couple of weeks ago.\n"
        },
        {
            "id": "week-11--august-16--to--august-22",
            "url": ".././gsoc/week-11--august-16--to--august-22",
            "category": "gsoc",
            "title": "week-11--august-16--to--august-22",
            "content": "```yaml\n---\ntitle: week-11--august-16--to--august-22\n---\n```\n\n## 1 What have you been doing this week?\n\n- [x] Make API example doc\n- [x] Documenting a example of the GUI usage, so that the mentors can test it on various datasets\n- [x] Implement the heuristic for inferring the path pattern from an example in the rules file\n- [x] Make example documentation for the example-based path pattern heuristic\n- [x] Implement versioning for the software\n\nFor the weekend:\n\n- [ ] Make test and example documentation for the incremental conversion use-case\n\n## 2 What are you planning to do next week?\n\nUpload the final code :P\n\n## 3 Is anything blocking your progress?\n\nNo"
        },
        {
            "id": "dummy-article",
            "url": ".././literature-review/dummy-article",
            "category": "literature-review",
            "title": "Deep Learning and the Brain: Neural Network Insights (dummy paper)",
            "authors": [
                "Dr. Alex Smith",
                "Dr. Maria Garcia"
            ],
            "year": 2023,
            "publisher": "Journal of NeuroAI Research",
            "keywords": [
                "Deep Learning",
                "Neuroscience",
                "Neural Networks",
                "Brain Function"
            ],
            "research_type": "Theoretical Analysis",
            "relevance": "Highly relevant to my research on NeuroAI parallels.",
            "sourceurl": "https://www.ijert.org/dummyarticle.pdf",
            "doi": "10.17577/dummydoi",
            "content": "```yaml\n---\ntitle: \"Deep Learning and the Brain: Neural Network Insights (dummy paper)\"\nauthors: [\"Dr. Alex Smith\", \"Dr. Maria Garcia\"]\nyear: 2023\npublisher: \"Journal of NeuroAI Research\"\nkeywords: [\"Deep Learning\", \"Neuroscience\", \"Neural Networks\", \"Brain Function\"]\nresearch_type: \"Theoretical Analysis\"\nrelevance: \"Highly relevant to my research on NeuroAI parallels.\"\nsourceurl: \"https://www.ijert.org/dummyarticle.pdf\"\ndoi: \"10.17577/dummydoi\"\n---\n```\n\nThis is a dummy paper to illustrate the format of a literature review entry.\n\n## Abstract\nThis study explores the intersection of deep learning and neuroscience...\n\n## Methodology\nThe methodology involves a comparative analysis...\n\n## Main Findings\nThe study finds significant parallels between...\n\n## Significance\nThis research contributes to the understanding of...\n\n## Personal Notes\nThe paper provides a compelling argument for using AI...\n\n## Future Work\nThe authors suggest empirical studies...\n\n## Quotes\n\"Deep learning models, especially convolutional neural networks...\"\n\n## Extended Notes\n**Key Points:**\n- **Convolutional Neural Networks**: Remarkable similarities...\n- **Pattern Recognition**: Potential insights...\n\n**References for Further Reading:**\n- [Neural Networks and Brain Function](https://example.com/neural-networks)\n- [Cognitive Processing in AI](https://example.com/cognitive-ai)\n\n_Personal Reflection_: The theoretical underpinnings are strong, but empirical evidence is needed.\n"
        },
        {
            "id": "reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence-parikshit-gupta",
            "url": ".././literature-review/reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence-parikshit-gupta",
            "category": "literature-review",
            "title": "Reverse Engineering of Human Brain for the field of Artificial Intelligence - Parikshit Gupta",
            "authors": [
                "Parikshit Gupta"
            ],
            "year": 2020,
            "publisher": "International Journal of Engineering Research & Technology (IJERT)",
            "keywords": [
                "Reverse Engineering of Human Brain",
                "Artificial Neural Networks(ANN)",
                "Convolutional Neural Networks(CNN)"
            ],
            "research_type": "Review",
            "relevance": "Unknown",
            "sourceurl": "https://www.ijert.org/reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence",
            "doi": "10.17577/IJERTV9IS050169",
            "content": "```yaml\n---\ntitle: Reverse Engineering of Human Brain for the field of Artificial Intelligence - Parikshit Gupta\nauthors: [\"Parikshit Gupta\"]\nyear: 2020\npublisher: \"International Journal of Engineering Research & Technology (IJERT)\"\nkeywords: [\"Reverse Engineering of Human Brain\", \"Artificial Neural Networks(ANN)\", \"Convolutional Neural Networks(CNN)\"]\nresearch_type: \"Review\"\nrelevance: \"Unknown\"\nsourceurl: \"https://www.ijert.org/reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence\"\ndoi: \"10.17577/IJERTV9IS050169\"\n---\n```\n\nThis document holds my observations for the paper:\n\n```yaml\nReverse Engineering of Human Brain for the field of Artificial Intelligence\n\nAuthor: Parikshit Gupta\n\nURL: https://www.ijert.org/reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence\n```\n\n## The author\n\nParikshit Gupta is a software developer from Mumbai with machine learning knowledge. So far (December 2021) he has only published the discussed paper.\n\nYou can find him on twitter as [Anonymous07P](https://twitter.com/anonymous07p).\n\n## TLDR\n\nThis article mainly discusses how the results of \"reverse engineering\" the brain have permeated towards AI, and in particular Artificial Neural Networks (ANNs) and Convolutional Neural Networks (CNNs); along with some comparisons regarding the differences betweens these networks and Biological Neural Networks.\n\n## Introduction\n\n- Defines \"Reverse Engineering\" (the citation is a bit dated as it is from the 90s).\n- Some context of reverse engineering in software. It is not clear why such context is important for a paper in the AI field, I guess it follows from his background in software development.\n- [[biomimicry]] to defend the case of reverse engineering the brain to advance AI.\n- Some intro to the scale and structure of the brain as a network of neurons.\n- Author mentions that \"by reverse engineering neuroscientists have\nbeen able to understand the brain to a pretty good extent\". I think this is debatable as from what I know we are only a surface understanding.\n- Follows the idea of \"doing-before-knowing\" at some point. Basically that one can build something without understanding how it works (ie building planes before understanding how birds fly). I have heard this argument to from the professor Alvaro Gaviria (\"El Mazo\", UdeA) too... although he phrased it as \"se puede porque se pudo\" (it can be done because we could) and he contextualized it as a fundamental difference between the engineering and science approach. Similar perspectives [can be found randomly on the internet](https://www.reddit.com/r/MachineLearning/comments/cs9j5i/comment/exe18d1/). I think this topic ([[building-before-knowing]]) would make a good discussion on epistemology.\n- Ends the intro by shortly defining ANNs and CNNs.\n\n## Reverse engineering of the human brain\n\nThis part is divided in two sections. Overall it is really basic and may be skipped for someone already familiar with neurobiology.\n\n### Working of the human brain\n\n- Some discussion on the [[connectome]], its importance, usefullness, and possible making.\n- Argues for a modular structure of the brain (as it having specialized parts for particular tasks). This is debatable ( [[modularism-vs-holism-in-neuroscience]] ).\n- There is a prevalent view of the [[brain-as-a-computer]] :\n\n>For learning and performing task we need data be it the case of human brain or any machine-based algorithm. Human brain gets these data through five senses: Taste, Touch, Locate, Notice, and Hearing. These sources provide frequently numerous data at one time. The brain collects all these data and stores the important parts into our memory. Depending on the data received it reacts in various circumstances by controlling various functionalities of our body like heart and breathing rates.\n\nDespite the simplification of [humans having only 5 senses](https://www.sciencefocus.com/the-human-body/how-many-senses-do-we-have/), the idea is understood... basically senses=sensors that collect data. I think it would have been nice to acknowledge the [[brain-as-a-computer]] paradigm it takes for granted.\n\n- Views the neuron as the smallest processing unit.\n\n- The author gives a high-level abstraction of the human brain reminiscent of an input/ouput model but using receptor and effector terminology and with feedback loops.\n\n![](/images/reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence-parikshit-gupta/2021-12-27-01-22-49.png)\n\n>image from the aforementioned article, CC BY 4.0\n\n### Working of the Biological Neural Network\n\nThis part basically is a collections of fundamentals of neurobiology: neurons,soma,dendrites,axons,action potential, etc.\n\nAlthough not explicitly mentioned, it refers to the hebbian learning principle when explaining how neurons learn.\n\nIt ends with the idea of layers of neurons.\n\n## Advances In Computer Science As A Result Of Reverse Engineering The Human Brain\n\nIn my view, this is the most important part of the article. First, it remakes the case for [[biomimicry]] and then presents three sections, regarding the influence of brain's reverse engineering on AI, ANNs and CNNs.\n\n### Artificial Intelligence(AI)\n\nThis is the weakest section of the three as the subject matter is too broad. Overall is just a recapitulation of [[biomimicry]], [[brain-as-a-computer]]  and a model of an agent immersed in an environment with whom he interacts.\n\n### Artificial Neural Networks(ANNs)\n\n- It clarifies that the artificial neuron is loosely based on the animal neuron.\n- Has an interesting interpretation of the weights from one of the cited papers:\n\n>The processing ability of the network is stored in the interunit connection strengths, or weights, obtained by a process of adaptation to, or learning from, a set of training patterns.\n\n- Then the author explains some basics of ANNs, their types, the fundamental training algorithm,etc.\n\n- Ends with the real discussion of the paper:\n    - ANNs can be thought of as disentangled models of the BNNs.\n    \n    - For researchers interested in the brain ANNs should try to capture the \"data handling highlights\" of BNNs.\n    - For engineers this constraint is not that important.\n    - The parallel processing nature of ANNs, is interesting for engineers.\n\n### Convolutional Neural Networks(CNNs)\n\nI think this last section is the most interesting of the whole paper.\n\n- Defines (in suggestion of a cited source) the CNNs as \"a specialized ANN for processing data that has a known grid-like topology\".\n\n- Then, some similarities are drawn between CNNs and the [[primary-visual-cortex]] (PVC) and the [[inferotemporal-cortex]] (ITC). See the paper for more clarification as I couldnt summarize it as I dont yet understand it fully. What i took is that the CNN:\n\n    - Has 2D maps as features, similar to the PVC (source?)\n    - Its neuron units imitate the spatially localized receptive field of the PVC. I guess at least in some of the artificial layers.\n    - Apparently those neurons also are a linear function of the image projected to them (not exactly sure why though?), and supposedly this is similar to the PVC.\n    - Cross channel pooling (idk what that is) allow for invariance against linear shifts. Somehow this imitates the PVC too.\n    - The Fully Connected Ouput Layer (FCOL) imitates the ITC.\n    - Apparently the info goes through many layers reminescent of the PVC and then ends with the FCOL as the ITC.\n    - The ITC seems to collect information from ALL of the neurons just before it. Thus inspiring the FCOL.\n\n- After the similarities, goes on with the differences:\n    - The main one, is that CNN is mostly about spatial features. The temporal dimension is not accounted for, which the brain do incorporate. He argues combining CNNs and RNNs into a network supporting spatiotemporal features would be fruitful.\n    - The brain also incoporates and connects information from other senses, not only visual info.\n    - The other similarities exist on the spatial side, even though is the one being imitated:\n        - Human eye is low res (except for the fovea). Not accounted for in CNNs\n        - No context/scenario awareness for the CNNs, which the brain does.\n        - No feedback loops, which are really common in BNNs.\n\n- Finally, the author restates that CNNs are mainly for grid-like data and that they are scalable; making them great for image-based problems. There is a lot of inspiration from the brain, but still lots of differences and possible ways to incorporate more ideas from the brain.\n\n- I feel that this section is missing a lot of relevant literature that could have traced the provenance of these primordial claims; as they constitute the real substance of the paper.\n\n## The conclusion of the author\n\nThe conclusion is somewhat shallow when compared to the last section. Basically, a lot done, very useful and lots of things to explore in the neuro-ai area.\n\n## The references\n\nI think the paper could have explored more references, in example:\n\n- Neuroscience-Inspired Artificial Intelligence, Demis Hassabis et al, 2017.\n\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[biomimicry]: .././bubbles/biomimicry \"biomimicry\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[connectome]: .././bubbles/stub \"connectome\"\n[modularism-vs-holism-in-neuroscience]: .././bubbles/modularism-vs-holism-in-neuroscience \"modularism-vs-holism-in-neuroscience\"\n[brain-as-a-computer]: .././bubbles/brain-as-a-computer \"brain-as-a-computer\"\n[brain-as-a-computer]: .././bubbles/brain-as-a-computer \"brain-as-a-computer\"\n[biomimicry]: .././bubbles/biomimicry \"biomimicry\"\n[biomimicry]: .././bubbles/biomimicry \"biomimicry\"\n[brain-as-a-computer]: .././bubbles/brain-as-a-computer \"brain-as-a-computer\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "amor-y-fantasias",
            "url": ".././poems/amor-y-fantasias",
            "category": "poems",
            "title": "Amor y Fantasías",
            "content": "```yaml\n---\ntitle:  \"Amor y Fantasías\"\n---\n```\n\n```markdown\nMi vida se reflejaba en tus ojos\ny la luz se escapaba por tus pupilas.\n-¿Qué es la vida?- hermosa me dijiste.\nRespondí tan sólo -amor y fantasías-.\n\n\nEn ese juego de reflejos de tus ojos y mis ojos,\nque alegremente jugábamos cuando nos veían;\nintrigada preguntaste si acaso somos todos,\nparte de algo mucho más grande que la vida.\n\n\nNo supe responder y ni estaba seguro\nde aquel tema tan desconocido y ¿trivial?;\ntan solo respire, vacile un poco\ny sentí algo así en tu alma ¿lo recordarás?\n\n\nFue aquella vez que miré tus ojos\ny lentamente con mis manos los cerré.\nSentí esa paz en el alma y en la mente,\ncomo la que tú sola sientes amor, cuando me ves.\n\n\nDespués cerré mis ojos y me acerqué a ti;\nestábamos frente a frente a ojos cerrados,\nno sé cómo lo supiste ni cómo conectamos,\npero sentí aquel húmedo roce de labios.\nAquel tierno beso tuyo a ojos cerrados\nque nos mató por instantes para juntos renacer.\n\n\nAlguna vez dijiste -Acompáñame en el viaje-.\n-¿A qué viaje te refieres?- respondí deprisa.\nAclaraste tú -Ese que no quiero que se acabe-.\nSuspire yo -Aquel hermoso viaje que es la vida-.\n\n\nSentí de repente la duda apoderarse de mí,\nbusqué y busqué respuestas en los astros y en los cielos.\nNo sabía que se hallaban siempre junto a ti,\njusto cuando deletreaban mis labios tus besos.\n\n\n-¿Qué es la vida?- otra vez dijiste\ny de nuevo vacile con un respiro.\nEsta vez te respondí -cariño-\n-La vida es tan solo lo que ya viviste-.\n\n\nSalió de tu boca -Eso no me complace.\nYo ya sé que es lo que ya viví,\npara mí la vida es algo mucho más grande,\npara mí la vida es lo que aun no conocí-.\n\n\nY añadiste -lo que más aspiro\nes...- pero yo te interrumpí.\nTe dije -Amor mío entonces la vida\nson nuestros sueños y deseos del vivir-.\n\n\nLa vida es amor y fantasías.\nLa vida es conocer y darte a conocer.\nLa vida son los sueños, los deseos, las caricias\nque tú me das amor, cuando me ves.\n\n\nPero realmente no logro responder:\n¿Qué es la vida?\n¿Qué es el amor?\n¿Qué es la fantasía?\n\n\nAy cariño! ¿Qué eres tú? ¿Qué soy yo?\nTan solo actores del amor y de la vida,\nmientras la fantasía se apodera\nde nuestros sueños y deseos.\n¿Qué más da? ¿Quién lo diría?\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "ashes",
            "url": ".././poems/ashes",
            "category": "poems",
            "title": "Cenizas Delirantes - Delusional Ashes",
            "content": "```yaml\n---\ntitle:  \"Cenizas Delirantes - Delusional Ashes\"\n---\n```\n\n## Cenizas Delirantes\n\n```markdown\nDigamos pues que entre tú y yo no hay diferencia alguna,\nque ambos somos hijos del mismo universo\ny que el viento que pasó... rozándote el rostro,\nes el mismo viento que recogió mis suspiros\ny espero también estos versos.\n\n\nPero que más da,\nque sé yo realmente del aire,\nque sé yo realmente del oxigeno,\ndel dióxido de carbono\ny de la mielina que rodea tus neuronas;\nsolo supongo que existen,\nno lo puedo comprobar si no salgo de mi mismo;\ny entonces vienes y me das un beso\ny salgo yo de mi mismo, salto en ti,\nme adentro en tu boca,\ntrazo el puente a la par de que lo cruzo,\nsé entonces que existes,\nno por tus labios,\nno por tus ojos,\nsino porque salte en ti,\ny me encontré.\n\n\nPodemos pues,\npararnos ambos frente a un espejo,\nde repente sonreir,\ny en el reflejo no saber realmente\nquién es quién.\n\n\nVoy pues creando escritos\n-antes eran para alguien, ahora son para un fantasma-,\npropósito nulo,escribo porque yo mismo soy texto,\nsoy un libro, que se escribe y se lee a si mismo,\nsoy una paradoja divida entre cero sin conocer la existencia de los limites,\nvoy y cometo errores logicos y la ceniza de eso se convierte en música.\n\n\nLa ceniza,\n            La ceniza,\n                        Tan sólo la ceniza.\n```\n\n## Delusional Ashes\n\n```markdown\nLet's say then, that between you and me there is no difference,\nthat we are both children of the same universe,\nand that the wind that blew... caressing your face\nwas the same wind that took away my sighs;\nand hopefully these verses...\n\n\nBut what gives...\nWhat do I really know of air?\nWhat do I really know of oxygen?\nof carbon dioxide...\nand of the myelin surrounding your nerves;\nI can only suppose they exist;\nbut I cannot prove it if I dont get outside of my own self...\nand then you come, and startle me with a kiss,\nand I get out of myself, leaping into you\nand I venture into your mouth.\nI build the bridge at the same time that I cross it.\nI now know that you exist,\nnot because of your lips,\nnot because of your eyes,\nbut because I leapt into you\n... and I found myself\n\n\nWe could then\nstand side by side in front of a mirror,\nsuddenly smile;\nand in the reflection we won't really know\nwho is who.\n\n\nSo I go by creating writings\n-before they were for someone, now they are for a ghost-.\nNull purpose. I write because I'm text myself.\nI am a book which is written and read by itself.\nI am a paradox divided by 0 without knowing the existence of limits.\nI go and make logical mistakes, and the ashes of that becomes music\n\n\nThe ashes,\n            The ashes,\n                        Only the ashes\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "bailarina",
            "url": ".././poems/bailarina",
            "category": "poems",
            "title": "Bailarina",
            "content": "```yaml\n---\ntitle:  \"Bailarina\"\n---\n```\n\n![Ballerina](/images/ballerina.jpg)\n\n```markdown\nElla bailaba bajo el cielo y las estrellas,\nsus pasos le daban tranquilidad\ne inmersa en el encanto de melodías bellas\nella bailaba bajo el hechizo de su felicidad.\n\nElla tenía por música: su baile,\nmientras él por baile: su musicalidad,\ny bajo los pasos de ese amor deseable,\nel sólo pensó en verla bailar.\n\nÉl no sabía si ella bailaba según la música\no si la música se inspiraba en su bailar,\nno sabía si sus movimientos eran pasión melódica\no si sus pasos eran historias sin contar.\n\nElla bailaba como arco-iris entre nubes,\nella bailaba en el aire y sobre el mar,\nbailaba como la princesa que no tuvo nunca\ny como la que no hallará nunca más.\n\nElla quiere descubrir lo bailable\ny por eso sus ojos lloran en la tempestad,\ny bajo los destellos de ese amor inflamable,\nél lo que hizo fue invitarla…\n\n            …yo lo que hice fue invitarte a bailar.\n\nTú tenías por música: tu baile,\nmientras yo por amor: tu felicidad.\nSoltaste el paraguas para enseñarme,\nlo que realmente significa bailar.\n\nLas gotas de lluvia se deslizaban,\nsobre tu pelo para yo vislumbrar,\nmientras mis versos te acariciaban,\ny mi alma tan solo quería llorar…\n\nYo no sabía si bailabas según mi música\no si mi música se inspiraba en tu bailar,\nno sabía si tus movimientos eran progresión armónica\no si tus pasos eran melodías sin cantar.\n\nNuestras miradas transmitían las palabras,\nque ni la música ni el baile se atrevían a contar,\ntu infinito se reflejaba en mis ojos,\nmientras tus ojos reflejaban mi eternidad.\n\nBaila un verso, un poema y un destello,\nbaila una estrofa y una canción,\nbaila este poema que te he hecho\ny lo imbailable será tan sólo\n\nficción.\n```\n\n{% include license.md %}\n\n## References\n\nLa imagen no es mía. Es de Stewart Jones, la pueden  encontrar [aquí](https://500px.com/photo/4885082/prima-ballerina-by-stewart-jones).<br/>\n\nBueno este es un poema que hice en el 2013 aproximadamente, pero cuando lo fui a publicar aquí (para tener un bendito primer post) se me ocurrieron unas cuantas maneras de modificarlo (y mejorar su consistencia). La versión original la pueden encontrar [aquí](http://yogimgurt.deviantart.com/art/Ella-bailaba-374000649).\n\n"
        },
        {
            "id": "canta-y-pinta",
            "url": ".././poems/canta-y-pinta",
            "category": "poems",
            "title": "Canta y pinta",
            "content": "```yaml\n---\ntitle:  \"Canta y pinta\"\n---\n```\n\n```markdown\nCanta y pinta\ntanto como puedas.\nCanta y pinta tanto,\nque encuentres la luz de tu propia oscuridad.\n\nCanta y pinta, tanto como puedas;\nyo confío en tu misticidad;\nquizás a la vuelta de la esquina encuentres magia,\ny te haga de nuevo suspirar.\n\nEncuentra tus mitos, reconstruyelos\nconfía en el amor que llevas dentro, para ti.\nCuidado y mimalo, como  negro terciopelo.\nAnda amiga mía, déjate vivir!\n\nCanta y pinta, amiga mía.\nEncuentra ya tu libertad!\nEres tanto y a cada segundo eres algo,\nno dejes que tu mente o tu pasado,\napague la luz de tu viento extraño.\nEres misterio y en el fondo escondes algo.\n\nVe y descúbrelo , hazlo tu canto,\ny si quieres convierte en dibujo,\ny si quieres conviértete en relampago.\nBusca en el fondo tu rayo abrupto,\nbusca en cielo el piso llano.\n\nCanta y pinta, amiga mía.\nLlora y ríe, dejate sentir...\nque en el fondo escondes algo\nque sé que quieres descubrir.\n\nCanta y pinta, amiga mía.\nBusca tu reflejo en el espejo\ny en el agua sana tus heridas\npara que seas una con el viento\n\nAferrate al pulso que sientes en tu cuerpo,\ny como campo llena tu espacio;\ncómo magnetar en su apogeo\ncómo la magnetoestrella de tus labios.\n\nCanta y pinta, amiga mía\ncome dulces japoneses;\nNo comas ramen, que eso duele...\nColorea tus dibujos Acuarela,\nque en tu corazón un mundo se conmueve.\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "cielos",
            "url": ".././poems/cielos",
            "category": "poems",
            "title": "Cielos",
            "content": "```yaml\n---\ntitle:  \"Cielos\"\n---\n```\n\n```markdown\nEs que dejaste uno de tus cielos en mi alma,\ny ya yo no puedo dejar de volar.\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "color",
            "url": ".././poems/color",
            "category": "poems",
            "title": "Color",
            "content": "```yaml\n---\ntitle:  \"Color\"\n---\n```\n\n```markdown\nYo sé que a vos te gusta\ndar color a las paredes\ny a los rostros de la gente\nmientras cantas a la luna.\n\nY es que la luz con que tú alumbras\nda calor, sonrisa y juegos\ny -no sé amor-, se para el tiempo\nmientras pintas el espacio\ndel color que a mí me gusta.\n\nY yo que de la raya me salía\ncuando niño... es que\nde verdad -amor- yo de pintar\nno sé nada, te lo admito.\nTan solo reconozco\na lo mucho tres colores\nel amarillo, azul y rojo\nde dos banderas y mil flores.\n\nAún así estoy tratando\nde pintarte algunos versos.\nCombino azul y amarillo\nSegún vos: verde esperanza.\nMezclando amarillo y rojo\nSegún tú: naranja fuego.\nCombinando azul y rojo:\nquizás el violeta qué te calma.\nY combinándolos todos\nno sé si da blanco\no si da negro...\n\n\nY es que cuando niño\nme salía de la raya\nla verdad amor, de pintar\n... yo sé es nada.\nTan solo distingo\na lo mucho tres colores\nel amarillo, azul y rojo\nde mis banderas y naciones.\n\n\nY es que ( sí ), la verdad cariño\nyo...\n....( ¿no? ) tengo miedo\nde pintarte una sonrisa\nde decirte que te espero\nde escribirte tristes poesías\nde perdernos ambos en el tiempo\nde qué no tenga un buen pincel\ny de qué este lienzo donde pinto\nno es eterno.\nDe no poder pintarte el futuro que tú quieres\n-y es que todavía no sé\ncon qué color pintar\ntodos tus sueños-\ny de que no pueda\namor decirte...\n\n\n\nque te cielo.\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "de-que-vale",
            "url": ".././poems/de-que-vale",
            "category": "poems",
            "title": "De qué vale",
            "content": "```yaml\n---\ntitle:  \"De qué vale\"\n---\n```\n\n## I\n\n```markdown\nDe qué vale ser poeta\nsi ya nadie lee poesía,\nquizás sea suficiente\ncon poner -amor-,\nuna lagrima en tus ojos,\nen tu cara una sonrisa.\n\nPero amor por favor dime,\nde qué vale ser poeta\nsi ya nadie quiere poesía.\n```\n\n## II\n\n```markdown\nDe qué vale ser poeta\nsi ya nadie lee poesía,\nquizás sea suficiente\ncomponer -amor-,\nun verso que te llore,\nuna canción que te describa,\nun poema, un dibujo, mis pasiones\no quizás toda mi vida.\n\nPero amor por favor dime\nde qué vale hacer poesía\nsi ya nadie lee a los poetas.\n```\n\n## III\n\n```markdown\nDe que vale ser poeta\nsi las letras no mejoran\nla realidad que nos devora.\n\nY si de la muerte no hay escape,\nsi del amor no hay salida,\nsi no hay testigos de mis lágrimas\npero cuantos si hay de mis risas.\n```\n\n## IV\n\n```markdown\nLa razón quizás sea,\nel sonrojar de tus mejillas,\nel leve temblor de tus manos\ny el dilatar de tus pupilas.\n\nPoner en tus labios mis besos,\ncausar en tu cuerpo esos orgasmos,\ncumplir junto a ti nuestros sueños,\ny ver pasar juntos los años.\n```\n\n## V\n\n```markdown\nMientras en tus ojos viva mi reflejo\ny en tu cuello jueguen mis labios,\n-amor- puedes tener por seguro\nque la poesía servirá para algo,\nqué es ese algo -no lo sé\npero al fin y al cabo\nalgo es algo.\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "descomponerte",
            "url": ".././poems/descomponerte",
            "category": "poems",
            "title": "Descomponerte",
            "content": "```yaml\n---\ntitle:  \"Descomponerte\"\n---\n```\n\n```markdown\nDescomponerte en tus partes más simples\nConvertirte en sueño, transformarte en lágrima\nDespertarme y ver tus párpados, de repente ríes.\nY después de tu risa, tu mirada.\n\nDescomponerte, descomponerte.\nDesentrelazarte el alma.\nDesvestirte hasta el pasado.\nDesvestirte hasta los sueños.\nMorir en tu pecho.\nTransformarte en lágrima.\nDevolverte al cielo\na donde perteneces.\nConvertirte en sueño.\nDevorarte el alma.\n\nDesnudarte hasta el pasado,\nque te viste todo el tiempo.\nAcariciarte los recuerdos,\narrancarlos de tus labios,\nremoverlos de tu cuerpo.\nDesnudarte hasta los sueños\nque te desvisten todo el tiempo.\nVer tus ojos como si los sueños\nse contagiaran con la mirada,\nComo si vibraran en la luz.\n\nDescomponerte y componerte.\nDesentrelazarte el alma.\nDesvestirte hasta el pasado.\nDesvestirte hasta los sueños.\nDormir en tu pecho.\nTransformarte en lágrima.\nDevolverte al cielo,\na donde perteneces\nConvertirte en verso.\nY empezar de nuevo.\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "distillation",
            "url": ".././poems/distillation",
            "category": "poems",
            "title": "Distillation",
            "content": "```yaml\n---\ntitle:  \"Distillation\"\n---\n```\n\n```markdown\nSo it has been a really really bumpy road,\nthat of distilling my feelings.\nI tried to dissect my emotional being,\nlittle by little,\nfeeling by feeling,\nto unmask those who are fake\nand those who are not mutual,\nthose who are selfish,\nand those who are purely\n\nmy gift to you.\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "fondo",
            "url": ".././poems/fondo",
            "category": "poems",
            "title": "Fondo",
            "content": "```yaml\n---\ntitle:  \"Fondo\"\n---\n```\n\n```markdown\nUno no sabe si ha tocado el fondo,\no si acaso puede seguir y seguir,\nen su vacía dirección.\n\nAlguna veces en las calles solitarias,\nde esta vida,\nyo encontré forma y refugio,\nen el amor.\n\nPero por ratos y ratas parece ser solo ilusión.\nCada quien atrapado en cuerpos separados.\nNadie sabe exactamente si existe alguien más que el yo.\nSolo sabemos que con el pasar de los años...\nocurre el afortunado infortunio, y\nveremos si había algo más, o\nlo que fué, fué y ya pasó.\n\nSi acaso hemos de soñar,\ncon aquel tierno descanso,\ncon aquel momento en el que poder decir\n    \"la vida me venció\".\n\nEntreteneremos su idea,\nla dejaremos pasar a la casa\n    un rato...\nTomaremos té, con su mirada\napuntando directo al\n    corazón.\n\nPero cuanto amaría la voluntad de vida,\nno quiero té, quizás sí una birra!\nBailar eternamente,\nsucumbir de la emoción.\n\nConstruir túneles en las montañas de dolor\n    limitrofes.\nSalir de la ciudad,\ndelirar las letras que el valle\n    soñó.\n\nVoluntad de vida,\nte busco y no te encuentro,\npero quizás cuando al fin acepte\nque \"la vida me venció\"...\n\nEntenderé que no era lucha\n    mi camino...\nNi mi corazón, un guerrero.\nQue podía haber elegido destinos serenos, \nsi hubiese aceptado el misterioso vacío\n    que ofreció.\n\nNo llores más, o llora más;\nnadie sabe el camino por el que debes cruzar,\nni el cielo donde caerás muerto,\nni la vida donde te levantarás triunfal.\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "its-different-in-the-rain-though",
            "url": ".././poems/its-different-in-the-rain-though",
            "category": "poems",
            "title": "It's different in the rain though",
            "content": "```yaml\n---\ntitle:  \"It's different in the rain though\"\n---\n```\n\n```markdown\nShe said:\n                It's different in the rain though.\n                It's freeing.\n                Like the rain washed away all your troubles with each step.\n\nWith each droplet, it washed your sorrows away.\nI don't know if you danced to the sound of the rain,\nor if that rain fell down to the sound of your steps.\n\n\n                I believe we danced in a rhythm of our own,.\n                Unheard by those who have never truly experienced that sort of freedom.\n\n\nWas it magic that fell with the rain?\nOr was it your soul going up to sky?\nClimbing along the droplets that fell.\nClimbing to the clouds that cried.\n\nAnd they told you:\n\"Are you pursuing the freedom of the air?\"\n\"Did you dance all the way up here to learn the secrets of the sky?\"\n\"Did you want to fly and dance like a bird?\"\n\"Are you pursuing the dance-full life?\"\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "no-me-importaria",
            "url": ".././poems/no-me-importaria",
            "category": "poems",
            "title": "No me importaría",
            "content": "```yaml\n---\ntitle:  \"No me importaría\"\n---\n```\n\n```markdown\nY si me pierdo en la clave,\ny en los movimientos que vos haces,\nen la canción con su mito sonoro,\nen el poema curvo de nuestro baile.\n\nNo me importaría,\npor un momento dilatado,\nel dolor dentro de mi alma,\nni el dolor fuera de mí.\n\nDaría tiempo fuera,\na la cognición de los estragos,\nal peso de la tierra volcado en tu sufrir.\n\nUna pausa finita a la infinita violencia,\nun descanso a nuestro llanto,\nun instante por vivir.\n```\n\n[//]: # (This may be the most platform independent comment)\n\n[comment]: <> ('infinita quimera' en vez de 'infinita violencia')\n\n[comment]: <> ('para vivir' en vez de 'por vivir')\n\n[//]: <> (This is also a comment.)\n\n\n{% comment %} \n    These commments will not include inside the source.\n{% endcomment %}\n\n{% include license.md %}\n"
        },
        {
            "id": "o-quizas-del-sexto-piso",
            "url": ".././poems/o-quizas-del-sexto-piso",
            "category": "poems",
            "title": "O quizás del sexto piso",
            "content": "```yaml\n---\ntitle:  \"O quizás del sexto piso\"\n---\n```\n\n```markdown\nDonde estará mi corazon,\ndonde será que esta metido.\nQuizás este debajo de la almohada,\no entre las cobijas y sabanas escondido.\nLo he buscado hasta debajo de la cama,\ny ni un recuerdo de donde lo he visto.\n\nNo lo encuentro, no lo encuentro\nni entre tecla y tecla de mi piano,\nni en el minutero del relog, adormecido;\nni entre cuerda y cuerda de mi guitarra,\nni en su caja acustica, mal herido.\n\nNo lo encuentro ni en mis palabras,\nni en las hojas pocas que derramo.\nQuizás algun dia lo encuentre moribundo,\nporque le ha caido un rayo;\no quizás del sexto piso,\nle cayo desafortunado el piano.\n\nAmigo, amiga, ¿no lo has visto?,\na mi corazón en las calles merodeando,\nvistiendo oscuras ropas,\ncon los zapatos todos desgastados,\nla mirada taciturna en tu mirada,\ncon su conciencia roja rebotando.\n\nQuizás buscando yo me lo imagino\nalgun dueño o dueña desesperado;\nél no recuerda que es solo mio,\ny que lo necesito para vivir mis años.\n\nCorazón corazón, donde estes vuelve conmigo;\nno busques dueño imaginario.\nAmigo, amiga; si lo has visto\ndejalo que te hable un rato,\nque juegue tranquilo con tus perros,\nque se quede maullando con tus gatos,\nque pronto ya yo llego,\ndistraelo con tus labios mientras tanto,\ny apenas llegue me lo colocas en el pecho,\ny si quieres seguimos conversando.\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "pain",
            "url": ".././poems/pain",
            "category": "poems",
            "title": "Pain",
            "content": "```yaml\n---\ntitle:  \"Pain\"\n---\n```\n\n```markdown\nMaybe for example\none should decompose\npain into pieces\neat it 3 times a day and no more,\nexcept...\nthat you find yourself eating snacks of it\neverytime you are not distracted.\n\n\nProbably you would find your pain\nbecoming friends with your pulse.\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "parada-de-manos",
            "url": ".././poems/parada-de-manos",
            "category": "poems",
            "title": "Parada de manos",
            "content": "```yaml\n---\ntitle:  \"Parada de manos\"\n---\n```\n\n```markdown\nSi algo arde, si algo arde...\nSi tienes cenizas en el cuerpo.\nLevanta tus pies al aire, tus ojos en el suelo.\nSi llevas lluvia roja, adentro... bien adentro...\n\nLevanta tus pies al aire,\nTu alma y el corazón al suelo.\nVuélvete poesía, cuando caes.\nVuélvete danza, en el aprieto.\n\nVuélvete música, cuando calles.\nGira tus pies al cielo.\nQue eres lluvia que fluye...\nadentro, adentro bien adentro;\ncon tus pies cayendo al cielo.\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "por-donde-pisas",
            "url": ".././poems/por-donde-pisas",
            "category": "poems",
            "title": "Por donde pisas",
            "content": "```yaml\n---\ntitle : Por donde pisas\n---\n```\n\n```markdown\nSi vos vas creando agravios,\npor dónde caes muerto y desolado,\nSi vos vas creando sonrisas,\npor dónde vas, por dónde pisas.\n\nEnamórate de la realidad,\nerosiona sus tímidas paredes,\nrompe sus muros elocuentes;\ncolisionando supernovas.\n\nDistorsiona la realidad,\nBusca las rosas en sus pétalos,\nApaga la llama del mar, con fuego,\nresuelve la recursiva paradoja del espejo.\n\nFuiste así la lluvia que cae hacia arriba,\ny quizás el viento asfixiado del espacio;\nSi fuiste creando agravios o sonrisas,\nen los desolados pasos que caen dónde pisas.\n\nY si encuentras por donde vas,\nun instante radiante;\nno olvides cuidarlo,\npedazo de mar.\n```\n\n[comment]: <> ('en el cielo' en vez de 'por donde vas')\n\n{% include license.md %}\n"
        },
        {
            "id": "roloc",
            "url": ".././poems/roloc",
            "category": "poems",
            "title": "Roloc",
            "content": "```yaml\n---\ntitle:  \"Roloc\"\n---\n```\n\n```markdown\nVerde\nsi alguna vez\nsientes\nbajo tus pies\nla tierra inerte.\n\nY blanco\nsi eres canto\no si alguna vez\nlloran\ntus ojos\nraros.\n\nNavega azul\nla mar que sueñas\nsi buscas a(l)mar\naunque no quieras.\n\nNegro\nsi sientes\nmiedo\nlevanta y mueve\ntus cabellos\n...si te mueves tanto\nquizás\nmuevas el cielo.\n\nCielo \ncielo rojo\npor las veces\nque has \nde sentir \nodio.\n\nCon la tenue luz\nde dos de la mañana\nquizás puedas volar\narcoiris de mi alma.\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "romper-un-arcoiris",
            "url": ".././poems/romper-un-arcoiris",
            "category": "poems",
            "title": "Romper un arcoiris",
            "content": "```yaml\n---\ntitle: Romper un arcoiris\n---\n```\n\n```markdown\nSi rompes un arcoiris, en el centro de la tierra\nsalta y mueve tu quimera, a la superficie de tu ser\ny si encuentras en tu centro, el recuerdo de tu fiera\nojala te liberes, para siempre recorrer.\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "sin",
            "url": ".././poems/sin",
            "category": "poems",
            "title": "Sin",
            "content": "```yaml\n---\ntitle:  \"Sin\"\n---\n```\n\n```markdown\nQuiero que sueñes tan bonita,\ny que sonrias relajada.\nQue tus días se vistan de colores,\ny que agradezcas cada mañana.\n\nQue duermas tranquila \n        aventurera,\nque aprendas curiosa,   \n        cientifica.\nQue te muevas risueña,  \n        bailarina\nQue vueles muy alto\n        buhita.\n\nSé que ya no soy el mismo ante tus ojos...\nquizás ya solo sea unos rayos y unos truenos;\npero aún así tu corazón debe ser \n    cascada que \n        fluye\n    cometa que \n        explora el firmamento\n    La vida misma descubriendo \n        su secreto.\n\nSé que no tengo la voz  \n    que vos querías;\ny a veces pinté\n    colores feos;\npero aún así tu sonrisa \n    ilumina\nlos corazones del hogar en que \n    naciste;\ny cuando te ven, yo sé que\n    sonrien,\nLos rostros del hogar en que\n    creciste\n\nTengo miedo de no tener el corazón que vos querías;\ny por eso llueve mi voz un huracán de cantos...\n\nTengo miedo, sí, de no poder crearte más sonrisas.\nDe solo ser una ilusión en desencanto.\n\nPero yo soy feliz, aún si no es por mi,\nde que vos cantes\nde que ría cada día tu sonrisa\nde que sueñe cada noche tu mirada\nde que la lluvia sane nuestras heridas.\n\nPorque tienes qué seguir siendo curiosa,\nAventurera, Científica, Guerrera.\nBailarina y Culinaria Risueña.\nViajera de países encantados.\nAdmiradora de abstractas pinturitas.\nMientras escuchas la indie musica de tu iphone.\nDando lo mejor de ti, cada día.\n\nTen un hermoso día, \n    linda\nHas magia a donde vayas,\n    bella\nIlumina mis noches,\n    luna\nCada día es un cielo nuevo para ti,\n    estrella.\n```\n\n{% include license.md %}\n\n"
        },
        {
            "id": "sire",
            "url": ".././poems/sire",
            "category": "poems",
            "title": "Sire",
            "content": "```yaml\n---\ntitle:  \"Sire\"\n---\n```\n\n```markdown\n¿Quién eres hoy?\nQuizás polvo de estrellas,\ncomo dijo Sagan,\ncuando olvido su identidad.\n\n¿Quién eres hoy?\nQuizás una luciérnaga,\nen la tenue noche,\nsin luminosidad.\n\n¿Un desastre? ¿Un tornado?\nUn volcán... o un náufrago.\nUna frase en mis labios,\ncon mil signos de interrogación.\n\n¿Quién eres hoy?\nUna mochila viajando sin rumbo,\no el rayo más rayo del Catatumbo;\ntres versos sin terminar\npunto y coma, y tres puntos.\n\nSiempre hay algo raro\nen definirnos con algo.\nSomos tanto y tanto,\ny es verdad nosotros,\nderramamos y amamos;\npero aun así,\nsomos más que sólo amor.\n\n¿Quién eres tú?\nYo no sé quién eres, Eris\n...pero sé que dejas un rastro\nde dibujos a tu paso.\nSé que dices ser un desastre, un ocaso;\nquizás con incontables marcas del pasado.\nSomos tanto y tanto, \ny a cada segundo somos algo;\nqué solo sé que hay algo raro\ncon definirnos con algo.\n\n¿Eris, eres arte?\nno creo, pero quiero\nerizarte.\nY no eres arte,\neres artista,\ny somos incluso\nnuestras aristas;\naunque hay quien diría\nque no es bueno definirse\ncon las líneas que limitan.\n\nY si somos lo que hacemos,\nentonces ¿somos verbos?\nNo lo creo, no es que cuadre;\nquizás somos algo que se escapa del lenguaje.\n\n¿Somos tiempo en el espacio?\n¿La geometría del substrato?\nY si el sujeto es inseparable del objeto,\nsegún el Dasein que todavía no entiendo,\nsomos todo excepto la nada,\nsomos todo, todo excepto.\n\nLa transitoriedad que nos asusta,\nla eternidad que nos aterra,\nla definición que nos limita,\nla incertidumbre que nos tiembla,\nla intrascendencia que permea,\nla trascendencia que disuelve,\nla imperfección que nos molesta,\nla perfección que solo hiede.\n\nWabi-sabi, mono-no-aware\n¿Nada importa?, ¿todo importa?\nyo no sé... ¿Qué te importa? :V\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "su-roja-armonia",
            "url": ".././poems/su-roja-armonia",
            "category": "poems",
            "title": "Su roja armonía",
            "content": "```yaml\n---\ntitle : Su roja armonía\n---\n```\n\n```markdown\nPorque tienes una estaca clavada en el corazón,\ny nada la saca...\ny nada la toca...\npero de vez en cuando alguna nota,\nla roza con su roja armonía...\ny su maldita nostalgia.\n... y escuchas, y escuchas\n... y no sabes, si la estaca\nestá entrandose o saliendo.\n\n¿Sientes algo?¿Algún sollozo?\nNo...\n:(\nNo...\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "the-timed-arts",
            "url": ".././poems/the-timed-arts",
            "category": "poems",
            "title": "The timed arts",
            "content": "```yaml\n---\ntitle:  \"The timed arts\"\n---\n```\n\n```markdown\nPoetry like music...\n        needs cadence.\nAt least metered poetry,\nso verses must feel like a melody,\nand verse after verse they resemble each other.\n\nYou won't even know the same melody reached your ears,\nthey were after all different words.\n\nPoetry, music, and dancing;\nthe beautiful triad of the timed arts.\nIt is time that flows through\nyour body, your eyes, your ears, and your heart.\n\nIf you wanted, \n        you could dance to spoken poetry.\nIf you wanted,\n        you could make poetry out of dance.\nIf I could,\n    I would make you dance forever\n    to the verses that flow out of my hand.\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "universo",
            "url": ".././poems/universo",
            "category": "poems",
            "title": "Universo",
            "content": "```yaml\n---\ntitle:  \"Universo\"\n---\n```\n\n```markdown\n\nEl universo lloraba\ny los astros contemplaban\ncomo la energía oscura\nreía sin cesar.\n\nLas galaxias se quejaban\nla gravedad no soportaba más\ny la materia oscura lloraba\nlloraba sin cesar.\n\nUniverso me intrigas\nya que no sé si eres\nuna sagrada mentira\no a duras penas una\nprostituta verdad.\n\nNo sé si eres un cuento, una historia\no tal ves parte de una imposibilidad;\neres como la vida misma, poéticamente\nhecha de amor, tristeza y un poquito\ntan sólo un poquito de todo lo demás.\n\nEres descifrable hasta cierto punto;\ngracias a las explosiones y a las cuerdas;\ntramando oscuras dimensiones junto\na tramposas riendas de realidades contrapuestas.\n\nUniverso ¿eres tú el todo?\no quizás un minúscula parte\nde lo que no sé y en parte\nde una inmensa totalidad.\n\nEscondes pura energía\noscura, de la independencia\ny también oscura materia\nde la unión, uno que otro\nagujero negro que une\nespacios y tiempos\nsin sentido, sin control.\n\nUn multiverso inverso\ntransverso, sin reverso\nun poco anverso creado\npor choques de membranas\nn-dimensional.\n\nAsí son los universos\ncomo estos versos\nque han de llorar\nla carga pura de la existencia:\nuna pasión sin controlar.\n\nMientras sigan oscilando tus cuerdas\nseguiran viviendo tus dimensiones\ny junto a ellas, las emociones nuestras\njunto a la vida y a las pasiones.\n\nMientras sigan vibrando tus cuerdas\nseguiran viviendo tus dimensiones\ny junto a ellas, las pasiones nuestras\nhaciendo palpitar nuestros corazones.\n\nMientras sigan palpitando tus cuerdas\nseguiran sobreviviendo tus dimensiones\ny junto a ellas, las lagrimas nuestras\n¡Ay! La existencia y sus intenciones.\n```\n\n# Universe\n\n```markdown\nThe universe cried\nand the stars contemplated\nhow the dark energy laughed\nlaughed without ceasing\n\nGalaxies complained\nGravity could not stand it any more\nwhile the dark matter cried\ncried without ceasing\n\nUniverse you intrigue me\nsince I dont know if you are\na sacred lie\nor hardly even\na whorish truth\n\nI dont know if you are a tale, a story\nor maybe part of an impossibility\nyou are like life itself, poetically\nmade out of love, sadness and a little\njust barely a little... of everything else\n\nYou are decipherable, up to a certain point\nthanks to the explosions and the strings\nplotting dark dimensions together to\ndeceitful reins of opposing realities\n\nUniverse, are you the everything?\nor maybe just a small part\nof what I do not know and in another part\na part of an immense totality\n\nYou hide pure energy\ndark at it, of independence\nand also dark matter\nof the union, some black holes\nover here and over there \nthat unite spaces and times\nwithout sense nor control\n\nAn inverse multiverse\ntransverse, without reverse\na little verse created\nby n-dimensional\nmembrane collisions\n\nSo are the universes\nlike these verses\nwho have to cry\nthe pure weight of existence\nand a passion without controlling\n\nWhile your strings continue oscillating\nyour dimensions will carry on living\nand with them, those emotions and passing hours\nnext to life and passions within no limits\n\nWhile your strings are still vibrating\nyour dimensions will continue beating\nand next to them, time and our passions\nmaking our hearts beat to your rhythm\n\nWhile your strings are still beating\nyour dimensions will keep on surviving\nand next to them, our flowing tears\nOh! The intentions of existence\n```\n\n{% include license.md %}\n"
        },
        {
            "id": "0google-scholar",
            "url": ".././research/0google-scholar",
            "category": "research",
            "title": "Google Scholar",
            "link": "https://scholar.google.com/citations?user=9W-bHVkAAAAJ&hl=en",
            "content": "```yaml\n---\n  title: Google Scholar\n  link: https://scholar.google.com/citations?user=9W-bHVkAAAAJ&hl=en\n---\n```\n\n<html>\n    <head>\n        <meta http-equiv=\"refresh\" content=\"0; url={{ page.link }}\" />\n    </head>\n    <body>\n    </body>\n</html>"
        },
        {
            "id": "1orcid",
            "url": ".././research/1orcid",
            "category": "research",
            "title": "(ORCID) 0000-0003-4473-0876",
            "link": "https://orcid.org/0000-0003-4473-0876",
            "content": "```yaml\n---\n  title: (ORCID) 0000-0003-4473-0876\n  link: https://orcid.org/0000-0003-4473-0876\n---\n```\n\n<html>\n    <head>\n        <meta http-equiv=\"refresh\" content=\"0; url={{ page.link }}\" />\n    </head>\n    <body>\n    </body>\n</html>"
        },
        {
            "id": "2we-got-your-bacc",
            "url": ".././research/2we-got-your-bacc",
            "category": "research",
            "title": "(Preprint) Class imbalance should not throw you off balance - Choosing the right classifiers and performance metrics for brain decoding with imbalanced data",
            "frame": "/images/your-bacc.png",
            "link": "https://www.biorxiv.org/content/10.1101/2022.07.18.500262v2.abstract",
            "content": "```yaml\n---\n  title: (Preprint) Class imbalance should not throw you off balance - Choosing the right classifiers and performance metrics for brain decoding with imbalanced data\n  frame: /images/your-bacc.png\n  link: https://www.biorxiv.org/content/10.1101/2022.07.18.500262v2.abstract\n---\n```\n\n<html>\n    <head>\n        <meta http-equiv=\"refresh\" content=\"0; url={{ page.link }}\" />\n    </head>\n    <body>\n    </body>\n</html>"
        },
        {
            "id": "3ica-for-prep-evaluation",
            "url": ".././research/3ica-for-prep-evaluation",
            "category": "research",
            "title": "Evaluation of Strategies Based on Wavelet-ICA and ICLabel for Artifact Correction in EEG Recordings",
            "frame": "/images/ica-for-prep.png",
            "link": "https://revistas.udistrital.edu.co/index.php/revcie/article/view/19068",
            "content": "```yaml\n---\n  title: Evaluation of Strategies Based on Wavelet-ICA and ICLabel for Artifact Correction in EEG Recordings\n  frame: /images/ica-for-prep.png\n  link: https://revistas.udistrital.edu.co/index.php/revcie/article/view/19068\n---\n```\n\n<html>\n    <head>\n        <meta http-equiv=\"refresh\" content=\"0; url={{ page.link }}\" />\n    </head>\n    <body>\n    </body>\n</html>"
        },
        {
            "id": "4normalizacion",
            "url": ".././research/4normalizacion",
            "category": "research",
            "title": "Efectos de la normalización por “constante específica del registro” en la calidad de separación del ICA grupal de señales EEG.",
            "frame": "https://img.youtube.com/vi/sQ5tkBgxo5U/0.jpg",
            "link": "https://youtu.be/sQ5tkBgxo5U",
            "content": "```yaml\n---\n  title: Efectos de la normalización por “constante específica del registro” en la calidad de separación del ICA grupal de señales EEG.\n  frame: https://img.youtube.com/vi/sQ5tkBgxo5U/0.jpg\n  link: https://youtu.be/sQ5tkBgxo5U\n---\n```\n\n<html>\n    <head>\n        <meta http-equiv=\"refresh\" content=\"0; url={{ page.link }}\" />\n    </head>\n    <body>\n    </body>\n</html>"
        },
        {
            "id": "5umbrales",
            "url": ".././research/5umbrales",
            "category": "research",
            "title": "Inferencia automática de umbrales para la detección de épocas artefactuales en señales EEG - Un enfoque estadístico centrado en los conjuntos de datos",
            "frame": "https://img.youtube.com/vi/w_RDcBSt1S8/0.jpg",
            "link": "https://youtu.be/w_RDcBSt1S8",
            "content": "```yaml\n---\n  title: Inferencia automática de umbrales para la detección de épocas artefactuales en señales EEG - Un enfoque estadístico centrado en los conjuntos de datos\n  frame: https://img.youtube.com/vi/w_RDcBSt1S8/0.jpg\n  link: https://youtu.be/w_RDcBSt1S8\n---\n```\n\n\n<html>\n    <head>\n        <meta http-equiv=\"refresh\" content=\"0; url={{ page.link }}\" />\n    </head>\n    <body>\n    </body>\n</html>"
        },
        {
            "id": "0color-space-lab",
            "url": ".././sims/0color-space-lab",
            "category": "sims",
            "title": "Color Space Lab (in browser, in development)",
            "link": "https://yjmantilla.github.io/color-space-lab/",
            "frame": "/images/color-space-lab.png",
            "content": "```yaml\n---\n  title: Color Space Lab (in browser, in development)\n  link: https://yjmantilla.github.io/color-space-lab/\n  frame: /images/color-space-lab.png\n---\n```\n\n<html>\n    <head>\n        <meta http-equiv=\"refresh\" content=\"0; url={{ page.link }}\" />\n    </head>\n    <body>\n    </body>\n</html>"
        },
        {
            "id": "1random-walkers",
            "url": ".././sims/1random-walkers",
            "category": "sims",
            "title": "Random Walkers",
            "link": "/sims/random-walkers.html",
            "frame": "/images/random-walkers.png",
            "content": "```yaml\n---\n  title: Random Walkers\n  link: /sims/random-walkers.html\n  frame: /images/random-walkers.png\n---\n```\n\n<html>\n    <head>\n        <meta http-equiv=\"refresh\" content=\"0; url={{ page.link }}\" />\n    </head>\n    <body>\n    </body>\n</html>"
        },
        {
            "id": "2pendulum-waves",
            "url": ".././sims/2pendulum-waves",
            "category": "sims",
            "title": "Pendulum Waves",
            "link": "/sims/pendulum-waves.html",
            "frame": "/images/pendulum-waves.png",
            "content": "```yaml\n---\n  title: Pendulum Waves\n  link: /sims/pendulum-waves.html\n  frame: /images/pendulum-waves.png\n---\n```\n\n<html>\n    <head>\n        <meta http-equiv=\"refresh\" content=\"0; url={{ page.link }}\" />\n    </head>\n    <body>\n    </body>\n</html>"
        },
        {
            "id": "3boxcar",
            "url": ".././sims/3boxcar",
            "category": "sims",
            "title": "Boxcar Spectrum",
            "link": "/sims/boxcar.html",
            "frame": "/images/boxcar-spectrum.png",
            "content": "```yaml\n---\n  title: Boxcar Spectrum\n  link: /sims/boxcar.html\n  frame: /images/boxcar-spectrum.png\n---\n```\n\n<html>\n    <head>\n        <meta http-equiv=\"refresh\" content=\"0; url={{ page.link }}\" />\n    </head>\n    <body>\n    </body>\n</html>"
        },
        {
            "id": "4campong",
            "url": ".././sims/4campong",
            "category": "sims",
            "title": "Campong!",
            "link": "https://yjmantilla.github.io/juego-pdi/",
            "frame": "/images/campong.png",
            "content": "```yaml\n---\n  title: Campong!\n  link: https://yjmantilla.github.io/juego-pdi/\n  frame: /images/campong.png\n---\n```\n\n<html>\n    <head>\n        <meta http-equiv=\"refresh\" content=\"0; url={{ page.link }}\" />\n    </head>\n    <body>\n    </body>\n</html>"
        },
        {
            "id": "5fields-hockey",
            "url": ".././sims/5fields-hockey",
            "category": "sims",
            "title": "Field Hockey (in browser, in development)",
            "link": "https://yjmantilla.github.io/fields_hockey/",
            "frame": "/images/fields-hockey.png",
            "content": "```yaml\n---\n  title: Field Hockey (in browser, in development)\n  link: https://yjmantilla.github.io/fields_hockey/\n  frame: /images/fields-hockey.png\n---\n```\n\n<html>\n    <head>\n        <meta http-equiv=\"refresh\" content=\"0; url={{ page.link }}\" />\n    </head>\n    <body>\n    </body>\n</html>"
        },
        {
            "id": "6not-air-hockey",
            "url": ".././sims/6not-air-hockey",
            "category": "sims",
            "title": "(Not) Air Hockey!",
            "link": "https://www.youtube.com/watch?v=meLD5UZH6Qk",
            "frame": "/images/not-air-hockey.png",
            "content": "```yaml\n---\n  title: (Not) Air Hockey!\n  link: https://www.youtube.com/watch?v=meLD5UZH6Qk\n  frame: /images/not-air-hockey.png\n---\n```\n\n<html>\n    <head>\n        <meta http-equiv=\"refresh\" content=\"0; url={{ page.link }}\" />\n    </head>\n    <body>\n    </body>\n</html>"
        },
        {
            "id": "automatic-unsave-facebook",
            "url": ".././tutorials/automatic-unsave-facebook",
            "category": "tutorials",
            "title": "Automatic Unsave Facebook",
            "content": "```yaml\n---\ntitle: Automatic Unsave Facebook\n---\n```\n"
        },
        {
            "id": "bookmark-repository-random-knowledge-system",
            "url": ".././tutorials/bookmark-repository-random-knowledge-system",
            "category": "tutorials",
            "title": "Bookmark Repository Random Knowledge System",
            "content": "```yaml\n---\ntitle: Bookmark Repository Random Knowledge System\n---\n```\n"
        },
        {
            "id": "conda-and-vs-code",
            "url": ".././tutorials/conda-and-vs-code",
            "category": "tutorials",
            "title": "Conda and VS Code",
            "content": "```yaml\n---\ntitle: Conda and VS Code\n---\n```\n\nI used to have some problems when importing numpy in vscode with the conda environment.\n\nApparently I was starting vscode the wrong way.\n\nThe correct way seems to be:\n\n1. Open your conda terminal\n2. enter ```code``` and press enter.\n3. It should open vscode with the conda environment correclty initialized.\n\n\n## Here are the comments I posted on facebook regarding this topic:\n\nAbre El terminal de anaconda y escribe \"code\" y das enter. Deberia de abrirse vscode con los environments de anaconda disponibles.\n\n![](https://scontent-bog1-1.xx.fbcdn.net/v/t1.6435-9/102774210_10219829053589026_3998607676344606585_n.jpg?_nc_cat=106&ccb=1-3&_nc_sid=dbeb18&_nc_ohc=scfry69vLakAX9tcBQT&_nc_oc=AQkvlTc6byLymz54KaxiuktcyrrGe2aq_FIu4JiWjPyIMxlr7lqf9PM_nY6dfD10hwNCVxE8NHa2dqv1xu_AfwiE&_nc_ht=scontent-bog1-1.xx&oh=bc10d9806c210d9b4ea1cf951cbbd2f2&oe=60C5B762)\n\n![](https://scontent-bog1-1.xx.fbcdn.net/v/t1.6435-9/101440621_10219829055469073_5217499476893729166_n.jpg?_nc_cat=105&ccb=1-3&_nc_sid=dbeb18&_nc_ohc=IGIqALVGSZIAX8MzUQh&_nc_ht=scontent-bog1-1.xx&oh=f5f7a7e2e89b533641f1896aa2bc623e&oe=60C8ABDC)\n\n\nEn teoria ya luego puedes seleccionar el interprete con ctrl shift P y luego escribiendo python. Así mismo si abres un terminal debería aparecerte un terminal de anaconda dónde puedes escribir \"activate xxx\" para activar el environment xxx de anaconda.\n\n\n![](https://scontent.feoh4-3.fna.fbcdn.net/v/t1.6435-9/101801140_10219829058269143_7898156791571153439_n.jpg?_nc_cat=103&ccb=1-3&_nc_sid=dbeb18&_nc_ohc=c5uGJ_sFJEEAX_san8Q&_nc_ht=scontent.feoh4-3.fna&oh=a8ce8d686d0b4b71680e0f2ebc7f1cda&oe=60C73CE3)\n\n![](https://scontent.feoh4-3.fna.fbcdn.net/v/t1.6435-9/101790978_10219829060869208_8096226944815149256_n.jpg?_nc_cat=100&ccb=1-3&_nc_sid=dbeb18&_nc_ohc=S1dvrG0kOtEAX_2KJAt&_nc_ht=scontent.feoh4-3.fna&oh=0fc518cb3b6256b0dd34f0dc22276a0f&oe=60C6765F)\n\nYo abogo por el método de arrancar vscode desde el terminal de anaconda ya que si se arranca por si solo a veces al tratar de utilizar los módulos de python da un \"import dll error\" para algunos módulos como numpy. Esto me trajo muchos dolores de cabeza en su día. Cómo referencia dejo este [issue](https://stackoverflow.com/questions/56622152/dll-load-failed-in-visual-studio-code-when-trying-to-open-any-python-library-o)\n\nTambien se puede por el conda navigator.Yo prefiero simplemente abrir el terminal de anaconda y luego poner code y dar enter. Así hago yo generalmente ya que es más rápido.\n"
        },
        {
            "id": "debug-flask-vscode",
            "url": ".././tutorials/debug-flask-vscode",
            "category": "tutorials",
            "title": "Debug Flask Code Using VSCODE",
            "content": "```yaml\n---\ntitle: Debug Flask Code Using VSCODE\n---\n```\n\nYou can debug flask apps by running the app launcher in debug mode and placing debug points wherever you want.\n\nAs you use the app on the browser vscode will stop when it reaches a debug point.\n\nFor example see sovabids/sovabids/front/app/app.py in my github"
        },
        {
            "id": "example",
            "url": ".././tutorials/example",
            "category": "tutorials",
            "title": "Github Pages Example",
            "content": "```yaml\n---\ntitle:  \"Github Pages Example\"\n---\n```\n\n{% include mermaid.html %}\n{% include mathjax.html %}\n## Welcome to GitHub Pages\n\nYou can use the [editor on GitHub](https://github.com/yjmantilla/yjmantilla.github.io/edit/master/README.md) to maintain and preview the content for your website in Markdown files.\n\nWhenever you commit to this repository, GitHub Pages will run [Jekyll](https://jekyllrb.com/) to rebuild the pages in your site, from the content in your Markdown files.\n\n### Markdown\n\nMarkdown is a lightweight and easy-to-use syntax for styling your writing. It includes conventions for\n\n```markdown\nSyntax highlighted code block\n\n# Header 1\n## Header 2\n### Header 3\n\n- Bulleted\n- List\n\n1. Numbered\n2. List\n\n**Bold** and _Italic_ and `Code` text\n\n[Link](url) and ![Image](src)\n```\n\nFor more details see [GitHub Flavored Markdown](https://guides.github.com/features/mastering-markdown/).\n\n### Jekyll Themes\n\nYour Pages site will use the layout and styles from the Jekyll theme you have selected in your [repository settings](https://github.com/yjmantilla/yjmantilla.github.io/settings). The name of this theme is saved in the Jekyll `_config.yml` configuration file.\n\n### Support or Contact\n\nHaving trouble with Pages? Check out our [documentation](https://help.github.com/categories/github-pages-basics/) or [contact support](https://github.com/contact) and we’ll help you sort it out.\n\n### Mermaid\n\n```mermaid\ngraph TD;\n    A-->B;\n```\n\n<pre><code class=\"language-mermaid\">graph LR\nA--&gt;B\n</code></pre>\n\n<div class=\"mermaid\">graph LR\nA--&gt;B\n</div>\n\n<div class=\"mermaid\">graph LR\n    graph TD\n    A[Client] --> B[Load Balancer]\n    B --> C[Server1]\n    B --> D[Server2]\n</div>\n\n<body>\n\n    Here is one mermaid diagram:\n    <div class=\"mermaid\">\n      graph TD\n      A[Client] --> B[Load Balancer]\n      B --> C[Server1]\n      B --> D[Server2]\n    </div>\n\n    This doesnt work...\n    \n    And here is another:\n    <div class=\"mermaid\">\n      graph TD\n      A[Client] -->|tcp_123| B(Load Balancer)\n      B -->|tcp_456| C[Server1]\n      B -->|tcp_456| D[Server2]\n    </div>\n</body>\n\n### Math\nyou can use an inline formula $$\\forall x \\in R$$ like this one\n\n$$\nM = \\left( \\begin{array}{ccc}\nx_{11} & x_{12} & \\ldots \\\\\nx_{21} & x_{22} & \\ldots \\\\\n\\vdots & \\vdots & \\ldots \\\\\n\\end{array} \\right)\n$$\n\n"
        },
        {
            "id": "export-facebook-saved",
            "url": ".././tutorials/export-facebook-saved",
            "category": "tutorials",
            "title": "Export Facebook Saved",
            "content": "```yaml\n---\ntitle: Export Facebook Saved\n---\n```\n"
        },
        {
            "id": "fixed-order-for-automatic-yaml-lists",
            "url": ".././tutorials/fixed-order-for-automatic-yaml-lists",
            "category": "tutorials",
            "title": "Fixed Order For Automatic Yaml Lists",
            "content": "```yaml\n---\ntitle: Fixed Order For Automatic Yaml Lists\n---\n```\n\nIn my approach I make the content yaml list automatically with python. The problem is that any order I had is lost to alphabetical order.\n\nThe fix is to prefix the files with the order you want to show them.\n\nExample:\n\n```markdown\nimportant-file --> 1-important-file\nirrelevant-file --> 2-irrelevant-file\n```\n\nNow, with poems it may be more advantageous to have them in alphabetical order; they look better that way.\n\nYou may even just want to highlight some files rather than giving an order to everyone. For that just prefix with a number the files that you want to leave highlighted and leave the other ones as they were.\n"
        },
        {
            "id": "foam",
            "url": ".././tutorials/foam",
            "category": "tutorials",
            "title": "Foam",
            "content": "```yaml\n---\ntitle : \"Foam\"\n---\n```\n\nSe pueden hacer referencias de hypertexto al estilo [wiki](https://foambubble.github.io/foam/user/features/wikilinks)\n\n>The Foam for VSCode extension automatically generates Link Reference Definitions at >the bottom of the file to make wiki-links compatible with Markdown tools and parsers.\n\nI prefer to control these by myself though, so I use:\n\n![](/images/foam/2023-01-04-02-25-02.png)\n\nand instead use custom code to generate these links on build time (see gen-static-data.py in the website github repo).\n\nYou can make a network of thoughts bubbles or ideas with the help of <https://github.com/vasturiano/force-graph>\n\nIdealmente los bubbles deberían tener nombre único y siguiendo el [kebab case](https://www.theserverside.com/blog/Coffee-Talk-Java-News-Stories-and-Opinions/Why-you-should-make-kebab-case-a-URL-naming-convention-best-practice)\n\nPodrían usarse [tags](https://foambubble.github.io/foam/user/features/tags). Esto podría aprovecharse para organizar poemas con base en tematicas?. O quizás la idea de categorías de jekyll.\n\nPara empezar ver el [menú de recetas](https://foambubble.github.io/foam/user/recipes/recipes)\n\nSe pueden incluir facilmente imagenes con [esto](https://foambubble.github.io/foam/user/recipes/add-images-to-notes)\n\n![](/images/foam/2021-05-15-03-25-31.png)\n\nThe configuration I like to use is:\n\n![](/images/foam/2023-01-04-02-27-34.png)\n![](/images/foam/2023-01-04-02-28-09.png)\n![](/images/foam/2023-01-04-02-28-49.png)\n"
        },
        {
            "id": "force-graph-in-brave-browser-bug",
            "url": ".././tutorials/force-graph-in-brave-browser-bug",
            "category": "tutorials",
            "title": "Force Graph in Brave Browser Bug",
            "content": "```yaml\n---\ntitle: Force Graph in Brave Browser Bug\n---\n```\n\nIn Brave force graph has some bugs with onNodeHover and onNodeClick: https://github.com/vasturiano/force-graph/issues/177\n\nSolution is to turn shields down:\n\n![solution](/images/graph-shield-bug-in-brave.png)\n"
        },
        {
            "id": "git-for-windows-with-conda",
            "url": ".././tutorials/git-for-windows-with-conda",
            "category": "tutorials",
            "title": "Git for windows with conda",
            "content": "```yaml\n---\ntitle: Git for windows with conda\n---\n```\n\nHow to use a bash style terminal in windows with conda commands activated.\n\n## Download and install git for windows\n\n[install this](https://gitforwindows.org/)\n\n## Search for your .bash_profile file in your user folder\n\nIn my case is here ```C:\\Users\\user```\n\n## Edit it and add\n\n```. \"C:\\software\\anaconda3\\etc\\profile.d\\conda.sh\"```\n\nYou should edit this path accordingly. Find your ```conda.sh``` file.\n"
        },
        {
            "id": "ica-music",
            "url": ".././tutorials/ica-music",
            "category": "tutorials",
            "title": "ICA Music Decomposition Example (open with google colaboratory)",
            "frame": "/images/music-ica.png",
            "link": "https://drive.google.com/file/d/1_9PPNA8b1eKY3gHNWtOAg0sQ1onMlpf4/view?usp=sharing",
            "content": "```yaml\n---\ntitle : \"ICA Music Decomposition Example (open with google colaboratory)\"\nframe : \"/images/music-ica.png\"\nlink : \"https://drive.google.com/file/d/1_9PPNA8b1eKY3gHNWtOAg0sQ1onMlpf4/view?usp=sharing\"\n---\n```\n\n<html>\n    <head>\n        <meta http-equiv=\"refresh\" content=\"0; url={{ page.link }}\" />\n    </head>\n    <body>\n    </body>\n</html>\n"
        },
        {
            "id": "local-jekyll",
            "url": ".././tutorials/local-jekyll",
            "category": "tutorials",
            "title": "Run Local Jekyll to preview github-pages",
            "content": "```yaml\n---\n title : \"Run Local Jekyll to preview github-pages\"\n---\n```\n\nSo you wanna preview github pages locally so that you don't over stress the build limit of github or because of speed.\n\nHere is how I did it (on windows). Note that I already had setup my github page in question. I just didn't have a way to locally preview it.\n\n### 1 Read [this url](https://docs.github.com/en/pages/setting-up-a-github-pages-site-with-jekyll/testing-your-github-pages-site-locally-with-jekyll)\n\nFrom here the obvious conclusion is that one needs to install jekyll (duh!). Now, I didn't do it the \"bundler\" way because I just happened to skip that part when I read it. I jumped directly to the instruction on the oficial jekyll page.\n\n### 2 Install jekyll as said on [this url](https://jekyllrb.com/docs/installation/windows/)\n\nThis is basically installing the Ruby+Devkit version from RubyInstaller using default options for installation.\nYou also need to run the ```ridk install command```, for me that was automatic. It prompts you to choose a mode, I choose mode 1 which I think said something like \"basic installation\". I don't remember.\n\n### 3 Test jekyll was installed\nOn windows a new shortcut should say \"Start command prompt with Ruby\". I clicked on that one and I ran ```jekyll -v```. It worked.\nNow, I have [git for windows](https://gitforwindows.org/) installed. I checked jekyll also worked there.\n\n### 4 Go to your page source code and try to \"serve\" your page, fix some errors\nThat is, open a command window (i opened git bash) on that folder and run ```bundle exec jekyll serve```.\n\nIt will give some errors:\n\n- The first is that \"the jekyll-theme-hacker theme could not be found\" or something of the sort.\n\nI searched that and I found the [github repo of the theme](https://github.com/pages-themes/hacker) and there it said that I should try adding ```gem \"github-pages\", group: :jekyll_plugins``` to the gem file.\n\nSo now, one gotta figure how to do a gem file... A quick search will lead you to [this url](https://stackoverflow.com/questions/30358612/how-to-create-a-gemfile). A gem file is just a plain text file on the root of your page's  source code. It is named \"Gemfile\" with no extension.\n\nSo I just did that, created the file and edited it with notepad++ to add the suggested lines.\n\n\n- The other is that it doesn't recognize the theme of the github-page\n\nThis is understandable since they are from github. It happens if you try to serve the page just after fixing the previous error.\nSo, now we gotta figure out how to install a github-page theme. Some more search will lead you to \n\nSo you basically have to run ```gem install github-pages``` (I did this on the git bash prompt).\n\n\n### 5 Finally serve your page\nThe command ```bundle exec jekyll serve``` should now run. It should be hosted at http://127.0.0.1:4000 .\nNotice that changes you do in real time will be updated automatically.  \n\nI added `*Gemfile*` to the gitignore because I was unsure if it was going to collide with a possible gemfile in the github workflow.\n\n### Troubleshoot\n\nhttps://stackoverflow.com/questions/65989040/bundle-exec-jekyll-serve-cannot-load-such-file\n\n### Postdata\n\nYou can reference stuff outside of this md folder with the wiki-links plugin [[foam]]\nExample: [[notetaking]]\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[foam]: .././tutorials/foam \"foam\"\n[notetaking]: .././bubbles/notetaking \"notetaking\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "mermaid",
            "url": ".././tutorials/mermaid",
            "category": "tutorials",
            "title": "Mermaid Example",
            "content": "```yaml\n---\ntitle : \"Mermaid Example\"\n---\n```\n<html>\n  <body>\n    <script src=\"https://cdnjs.cloudflare.com/ajax/libs/mermaid/8.5.2/mermaid.min.js\"></script>\n    <script>mermaid.initialize({startOnLoad:true});</script>\n\n    Here is one mermaid diagram:\n    <div class=\"mermaid\">\n      graph TD\n      A[Client] --> B[Load Balancer]\n      B --> C[Server1]\n      B --> D[Server2]\n    </div>\n\n    And here is another:\n    <div class=\"mermaid\">\n      graph TD\n      A[Client] -->|tcp_123| B(Load Balancer)\n      B -->|tcp_456| C[Server1]\n      B -->|tcp_456| D[Server2]\n    </div>\n  </body>\n</html>"
        },
        {
            "id": "naming-md-docs",
            "url": ".././tutorials/naming-md-docs",
            "category": "tutorials",
            "title": "Naming Markdown Docs",
            "content": "```yaml\n---\ntitle: Naming Markdown Docs\n---\n```\n\nThis jekyll sites uses 3 possible naming configurations:\n\n## Through a yaml front-matter\n\n```yaml\n  --- #first line of file\n  title : the title \n  ---\n```\n\n## Through the first header\n\n```markdown\n# The Title\n```\n\n## Through the file name\n\n```markdown\nthe-title.md\n```\n\nThe collector (gen-static-data.py) will try to get the above in the same order as presented here; being the worst case the filename.\n\nFor files inside the knowledge graph though the filename will always be chosen. This is to be able to generate the urls easily and avoid duplicate names.\n\nIdealmente deberían tener nombre único y siguiendo el [kebab case](https://www.theserverside.com/blog/Coffee-Talk-Java-News-Stories-and-Opinions/Why-you-should-make-kebab-case-a-URL-naming-convention-best-practice)\n"
        },
        {
            "id": "notepad-pp",
            "url": ".././tutorials/notepad-pp",
            "category": "tutorials",
            "title": "Notepad++",
            "content": "```yaml\n---\ntitle: Notepad++\n---\n```\n\n- Seleccion vertical\n- Macros\n- Text Fx\n- Reducir a una sola linea"
        },
        {
            "id": "onenote-to-svg",
            "url": ".././tutorials/onenote-to-svg",
            "category": "tutorials",
            "title": "OneNote to SVG",
            "content": "```yaml\n---\ntitle: OneNote to SVG\n---\n```\n\n- Print it to pdf\n- Use [this page](https://cloudconvert.com/pdf-to-svg)\n to convert the pdf to svg\n- Edit it further with Illustrator or whatever svg editor for final adjustment.\n\n[This](https://graphicdesign.stackexchange.com/questions/71667/svg-file-excessive-white-space) may be useful for cutting extra space.\n"
        },
        {
            "id": "sending-automatic-emails-google-forms",
            "url": ".././tutorials/sending-automatic-emails-google-forms",
            "category": "tutorials",
            "title": "Sending automatic emails from Google Forms",
            "content": "```yaml\n---\ntitle: Sending automatic emails from Google Forms\n---\n```\n\n- https://developers.google.com/workspace/solutions/content-signup\n- https://alicekeeler.com/2018/03/19/google-forms-pre-fill-answer"
        },
        {
            "id": "ssh-win10",
            "url": ".././tutorials/ssh-win10",
            "category": "tutorials",
            "title": "SSH in Windows 10",
            "content": "```yaml\n---\ntitle: SSH in Windows 10\n---\n```\n\nhttps://github.com/PowerShell/Win32-OpenSSH/issues/1625\n\nssh-add path_to_private_key\n\nssh <user name on the remote computer>@<remote host>\n\nUseful:\n\n- https://4sysops.com/archives/powershell-remoting-with-ssh-public-key-authentication/\n- https://stackoverflow.com/questions/52113738/starting-ssh-agent-on-windows-10-fails-unable-to-start-ssh-agent-service-erro\n- https://www.makeuseof.com/tag/windows-10-ssh-vs-putty/\n- https://superuser.com/questions/467398/how-do-i-exit-an-ssh-connection"
        },
        {
            "id": "sumatra-pdf-dark-mode",
            "url": ".././tutorials/sumatra-pdf-dark-mode",
            "category": "tutorials",
            "title": "Dark Mode (Modo Oscuro) en el pc para libros",
            "content": "```yaml\n---\ntitle: Dark Mode (Modo Oscuro) en el pc para libros\n---\n```\n\nEl dark mode para leer libros es habitual en Android (por ejemplo con ebook reader). En pc se puede hacer con adobe acrobat (uck!), y con Microsoft Edge si tienes el tema de alto contraste de windows.\n\nSin embargo mi forma preferida es usar Sumatra pdf reader. Este lector pesa muy poco y es simple.\n\n## 1. Instalar Sumatra PDF\n\nEhh si, instalalo... [este](https://www.sumatrapdfreader.org/free-pdf-reader) es el link.\n\n## 2. Ubica el archivo SumatraPDF-settings.txt\n\nEn mi caso estaba en ```\"C:\\Users\\user\\AppData\\Roaming\\SumatraPDF\\SumatraPDF-settings.txt\"```\n\n![](/images/sumatra-pdf-dark-mode/2021-05-16-20-16-34.png)\n\n## 3. Editar el archivo\n\nLas 3 variables de interes son:\n```\n    TextColor = #000000\n    BackgroundColor = #ffffff\n    SelectionColor = #00ff00\n```\n![](/images/sumatra-pdf-dark-mode/2021-05-16-20-18-19.png)\n\nEl fondo será BackgroundColor. Poner un color oscuro.\nEl texto será TextColor. Poner un color que resalte con el fondo, por ejemplo verde claro.\nLa seleccion será SelectionColor. Poner tambien un color que resalte con el fondo pero distinto.\n\nEl número que hay que colocar es un código RGB. Un selector de color útil para esto es [este](https://www.rapidtables.com/web/color/RGB_Color.html).\n\nYo usaré en este ejemplo:\n\n```\nBackgroundColor Negro --> #000000\nTextColor Verde --> #00FF00\nSelectionColor Magenta --> #FF00FF\n```\n![](/images/sumatra-pdf-dark-mode/2021-05-16-20-39-35.png)\n\n### Antes\n\n![](/images/sumatra-pdf-dark-mode/2021-05-16-20-41-50.png)\n\nDe Street-Fighting Mathematics - The Art of Educated Guessing and Opportunistic Problem Solving.pdf\n\n![](/images/sumatra-pdf-dark-mode/2021-05-16-20-37-20.png)\n\nDe Luigi Serafini - Codex Seraphinianus-Abbeville Press (1983).djvu\n\n### Despues\n![](/images/sumatra-pdf-dark-mode/2021-05-16-20-34-40.png)\n\nEsto tambien afecta imágenes:\n\n![](/images/sumatra-pdf-dark-mode/2021-05-16-20-37-01.png)"
        },
        {
            "id": "tags-in-filenames",
            "url": ".././tutorials/tags-in-filenames",
            "category": "tutorials",
            "title": "Tags in filenames",
            "content": "```yaml\n---\ntitle: Tags in filenames\n---\n```\n\nThis idea comes from tagspaces software (but without the software).\n\nOther idea: put tags with weird characters as prefix and/or suffix [source](https://productivityist.com/merlin-x-factor-evernote/)\n\nAnd this would be specially nice for creating dynamic playlist based on tags customized by the user, and cross-platform.\n\nIt seems that this dream would be finally be feasible by a combination of onedrive, foobar in android (to play files) and Rs File Manager in Android (access onedrive, is able to rename on the fly and calls foobar).\n\nI need to do a python script to manage the tag ontology. From a text (the full filenames list) get the unique used tags set.\n"
        },
        {
            "id": "traducir-terminos",
            "url": ".././tutorials/traducir-terminos",
            "category": "tutorials",
            "title": "Traduccion de términos",
            "content": "```yaml\n---\ntitle: Traduccion de términos\n---\n```\n\nA veces traducir términos en un ambiente acádemico es complicado, ya que la traducción no suele ser literal sino que en español se conoce con otro nombre. Dos formas que he encontrado para solventar esto son:\n\n1. Utilizar Proz\n\nEste [link](https://www.proz.com/search/) sirve para traducir términos de algún campo entre lenguajes y te da la fuente de donde sacó la traducción.\n\n2. Wikipedia\n\nLa idea es ir a la página del concepto en wikipedia en un idioma y luego en esa página cambiar el idioma. \n\n3. LLMs\n\nHoy en dia los LLMs son muy buenos para traducir términos.\n\n## Sitios para traducción\nTomado de [este post en facebook](https://www.facebook.com/CienciaLabu/posts/690276574980687)\n\nA todos los investigadores y estudiantes...💡🔍\n\nCuando queremos traducir largas frases en Google, la traducción es literal. Significa traducir palabra por palabra.\n\nPor eso compartimos algunos de sitios de traducción más eficaces.\n\n📍 Estos sitios web no tienen traducción literal:\n- http://mobile.reverso.net/en\n- https://www.wordreference.com/\n- http://www.worldlingo.com/\n- https://www.babelfish.com/\n- http://translation2.paralink.com/\n- https://www.freetranslation.com/\n\n📍 Sitios web para corregir Spelling, Grammar y para poder ver si tu escrito es correcto:\n- https://www.grammarly.com/m\n- https://www.grammarcheck.net/\n- http://mobile.reverso.net/en\n- https://www.onlinecorrection.com/\n- https://spellcheckplus.com/\n\n📍 Sitios donde buscas los significados de las palabras, los términos y las palabras que tienen sinónimos:\n- https://www.thesaurus.com/\n- http://www.englishdaily626.com/\n\n📍 Los mejores sitios para traducir a nivel mundial, pruébalos, elige los mejores para ti y cuenta con ellos en tus tareas o trabajos:\n- http://www.worldlingo.com/\n- https://www.freetranslation.com/\n- https://www.babelfish.com/\n- https://www.wordreference.com/\n- https://www.translation2.paralink.com/\n- https://www.onlinecorrection.com/\n- https://www.grammarcheck.net/\n- https://www.deepl.com/translator\n\n📍 Un sitio web que permite traducir un documento completo o un artículo sobre él:\n- http://www.worldlingo.com/\n\n📍 Sitio web para traducir investigaciones y archivos:\n- http://translation2.paralink.com/translator/default.asp\n\n📍 Sitios para corregir la escritura:\n- http://www.afterthedeadline.com/\n- http://www.reverso.net/spell-chec/english-spelling-grammar/\n- https://prowritingaid.com/"
        },
        {
            "id": "using-everything-for-searchs",
            "url": ".././tutorials/using-everything-for-searchs",
            "category": "tutorials",
            "title": "Using Everything for Searchs",
            "content": "```yaml\n---\ntitle: Using Everything for Searchs\n---\n```\n"
        },
        {
            "id": "vs-code-run-shortcuts",
            "url": ".././tutorials/vs-code-run-shortcuts",
            "category": "tutorials",
            "title": "VS Code Run Shortcuts",
            "content": "```yaml\n---\ntitle: VS Code Run Shortcuts\n---\n```\n"
        },
        {
            "id": "wsl2-move-vhdx",
            "url": ".././tutorials/wsl2-move-vhdx",
            "category": "tutorials",
            "title": "Move WSL2 vhdx",
            "content": "```yaml\n---\ntitle: Move WSL2 vhdx\n---\n```\n\n## The problem\n\n- Your primary drive has low space\n- WSL2 is consuming a lot of space\n\n## Causes\n\n- The vhdx is a no-shrinking file\n\n## Solution\n\n- Move the vhdx to another drive\n\n## How\n\nExecute this code i got from [here](https://github.com/microsoft/WSL/issues/4699#issuecomment-660104214)\n\n```cmd\nwsl --shutdown\nwsl -l -v\nwsl --export <DistroName> <PathToTarArchive>\nwsl --unregister <DistroName>\nwsl --import <DistroName> <PathToDistroNewDirectory> <PathToTarArchive>\nwsl -l -v\n```\n\n## Example\n\n![example](/images/wsl2-move-vhdx/2021-06-03-19-32-22.png)\n\nNote you have to put the .tar, otherwise the access is denied at the beginning happens.\n\n## Additionally clean docker vhdx space\n\n- This space doesn't show in docker except in the troubleshoot page.\n- Press Clean/Purge data\n\n![purge docker](https://user-images.githubusercontent.com/505065/80283019-066b9c00-8715-11ea-9b5f-083beecd0829.png)\n"
        },
        {
            "id": "2023-01-01",
            "url": ".././wayward/2023-01-01",
            "category": "wayward",
            "title": "2023-01-01 Wayward",
            "content": "```yaml\n---\ntitle: 2023-01-01 Wayward\n---\n```\n\nIt has been far too long since I had the first impulse of doing my own thing, and carving my own path. For some reason I picture it as a descend into myself. It's dark... I need solitude to achieve this. For many years I've loved sharing and discovering knowledge with others but right now, I want to advance by myself... Make no mistake, I love sharing... But it seems like I'm losing time on stuff that does not align enough with my own interests. It may sound selfish, but I need to be selfish right now.\n\n[[you-research-what-strikes-you-deeply]]\n\n> *Se investiga lo que te atraviesa*\n\nRMB\n\n> *unless it's something personal it's very hard to keep yourself motivated*\n\n[Irina Rish](https://www.youtube.com/watch?v=8-ilcF0R7mI)\n\nI know it... I'm missing some fire I had before, it is depleting. And yet, something inside of me is screaming:\n\n> *I want to go beyond*\n\nFor what its worth, doing things for and with other people is motivating; you can really feel the dopamine hits with each smile... But I'm tired... And I want to go beyond. It's been a long time since I have tried to do my own thing *seriously*, I mean, sure I can do little projects, but nothing that really shakes the core... Maybe because I'm scared of failing... I read about all of these topics, I get excited to the point of having an adrenaline rush... But... I dont know where to begin... There is simply too much, and I want to do it well, with the will of someone who wants to be truly deep, to have something valuable to say and add to this endeavor.\n\n[[understanding-and-innovation]]\n\n> El que no entiende no innova\n\nCastro, un profesor de física de la USB\n\nAnd so, I want to understand, beyond and as deep as I can... It seems like time is not enough ever, there is always some project to do. How to be deep in such circumstances? Without the smile of the other as motivation? There must be a way -the wayward way-, to go the left-hand path. Why write so emotionally about such an intellectual pursuit... Because I need it to have meaning, for someone so mythologically minded, what I do must fit my arc, and I cannot do science without passion as much as I cannot give a lecture without doing heavy gestures and dancing. If anything, my tenacity comes from them.\n\n[[the-power-of-emotional-investment]]\n\n>La razón es fría, pero ve claro; darle calor y no ofuscar su claridad; las pasiones son ciegas, pero dan fuerza; darles dirección y aprovecharse de su fuerza.\n\nJaime Balmes\n\nIn restropective, it seems I hid myself on doing things with others as a way to run from the things I truly want to do. When I do things where I'm not so invested, where failure is tolerable, my mind can run more free and careless. But for things at the core, I'm afraid, almost like an intellectual version of paralysis by analysis. A procrastination of what truly matters to you... Surely, the consequences of this are devastating for your arc.\n\n[[fear-of-failure]] , [[paralysis-by-analysis]]\n\nSo, I have decided to start 2023 with an honest effort to ammend this. Somehow, the vicinity of the 30s, is telling me that time is running out, that im no longer full of potential but that I finally MUST BE. I sense the call, and broken-hearted, with the blessing in the breaking, I'm trying to answer it.\n\n[[kids-are-pure-potential]] [[the-blessing-is-in-the-breaking]]\n\n>All I have is my honor, a tolerance for pain. A couple of college credits and my top-notch brain\n\nLin Manuel Miranda @ Hamilton. I alledgedly have a top-notch brain, but I dont reckon that. I at least have curiosity, my rapt attention, my rarified approach, the Life authentic.\n[[hamilton]] [[rapt-attention]] [[life-authentic]]\n\n\nHow to start? I want to truly know this, how to do that... And so, I start procrastinating with stuff regarding \"learning how to learn\"..., \"how to take notes\". How do you do that? When you dont care is easy... When you do, whats the way to do it properly?\n\n[[notetaking]]\n\nI vaguely remember doing Barbara Oakley's course of \"learning how to learn\", the insights of the focused and diffused modes of the brain, the importance of actually engaging problem-solvingly with the material; the idea of chunking, kolb's learning cycle. Scott Young's *visceralization* concept. The *insight machine* of [Colin Galen](https://youtu.be/Dm68uFy6gus) (which is somewhat what Rosty Bruce -an old pal of mine-referred to as being a system that takes topics and outputs shit about them). [Karen L. McKee's](https://youtu.be/tX9asHdFSv4) *writing is thinking* [[scientific-writing-with-karen-mckee]]. I hope these ideas lead me to the optimal way of learning deeply. I have the dream of creating here my knowledge-graph. Maybe that would be useless, sort of like the failure of the semantic web... On one hand, creating a corpus for the whole web is just too big, but maybe for learning-purposes, digesting ideas the old fashioned way, by connecting them and writing them and so on... maybe that would help me to gain insight.\n\n[[how-to-learn]] [[focused-and-diffused]] [[visceralization]] [[knowledge-graph]]\n\nSide note: I think I may have a thing for summarizing ideas into aforisms, that is, short phrases that are easy to recall (alas *the map is no the territory*). While writing this my mind just jumps where it desires, people have told me that it seems that my thought is chaotic, entangled, and that I easily lose track when I talk. I always thought of myself as quite organized and structured, almost devoid of chaos...\n\n[[phrase-compression]]\n[[flight-of-ideas-racing-thoughts]]\n\nIn any case, I will try to maintatin a periodic diary of concepts, ideas, ([\"an intellectual diary\",the logbook of the trip](https://en.wikipedia.org/wiki/Logbook_(nautical))--> [*cuaderno de viaje*, *bitacora*](https://es.wikipedia.org/wiki/Cuaderno_de_bit%C3%A1cora), what beautiful names for this wayward trip I I will be taking). This reminds me of RMB, she told us about the importance of writing during a trip, that writings done during the trip, and afterwards are different. She cited some books, I gotta ask her about them. [[writting-during-vs-after-journey]]\n\nThat makes me thing of her story about how her mentor taught her... Damn... I have to ask her about lots of things. Somehow during my first trip to Canada I could not be bothered to write about my day, but maybe this way, by writing about the ideas I encounter, it will be easier for me. I do have words for ideas...and as always, yet another thought branches...\n[[flight-of-ideas-racing-thoughts]]\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[understanding-and-innovation]: .././bubbles/understanding-and-innovation \"understanding-and-innovation\"\n[the-power-of-emotional-investment]: .././bubbles/the-power-of-emotional-investment \"the-power-of-emotional-investment\"\n[fear-of-failure]: .././bubbles/fear-of-failure \"fear-of-failure\"\n[paralysis-by-analysis]: .././bubbles/paralysis-by-analysis \"paralysis-by-analysis\"\n[kids-are-pure-potential]: .././bubbles/kids-are-pure-potential \"kids-are-pure-potential\"\n[the-blessing-is-in-the-breaking]: .././bubbles/the-blessing-is-in-the-breaking \"the-blessing-is-in-the-breaking\"\n[hamilton]: .././bubbles/hamilton \"hamilton\"\n[rapt-attention]: .././bubbles/rapt-attention \"rapt-attention\"\n[life-authentic]: .././bubbles/life-authentic \"life-authentic\"\n[notetaking]: .././bubbles/notetaking \"notetaking\"\n[scientific-writing-with-karen-mckee]: .././bubbles/scientific-writing-with-karen-mckee \"scientific-writing-with-karen-mckee\"\n[how-to-learn]: .././bubbles/how-to-learn \"how-to-learn\"\n[focused-and-diffused]: .././bubbles/focused-and-diffused \"focused-and-diffused\"\n[visceralization]: .././bubbles/visceralization \"visceralization\"\n[knowledge-graph]: .././bubbles/knowledge-graph \"knowledge-graph\"\n[phrase-compression]: .././bubbles/phrase-compression \"phrase-compression\"\n[flight-of-ideas-racing-thoughts]: .././bubbles/flight-of-ideas-racing-thoughts \"flight-of-ideas-racing-thoughts\"\n[writting-during-vs-after-journey]: .././bubbles/writting-during-vs-after-journey \"writting-during-vs-after-journey\"\n[flight-of-ideas-racing-thoughts]: .././bubbles/flight-of-ideas-racing-thoughts \"flight-of-ideas-racing-thoughts\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "2023-01-02",
            "url": ".././wayward/2023-01-02",
            "category": "wayward",
            "title": "2023-01-02 How the hell will I do this",
            "content": "```yaml\n---\ntitle: 2023-01-02 How the hell will I do this\n---\n```\n\nChronolink: [[2023-01-01]]\n\nI need to figure out two things:\n\n1. How will I assimilate stuff\n1. How will I record the process and product of assimilation here.\n\nFor the last one, I think the bubbles will be merely chunks of self contained but hyperlinked units of information.\n\nBut for this to be a journey, it needs to have a time dimension. So, Im kind of conceptualicing the \"wayward\" as the spinal chord that mentions and links to the bubbles in the time dimension. Of course, the bubbles connect themselves without time in their \"bubble dimension\".\n\nThis approach is mentioned in https://www.thoughtasylum.com/2021/07/03/i-do-not-use-zettelkasten/ as a \"journal\".\n\nAnother problem, is that my thought process jumps fast towards topics I havent fully digested nor have the focus right now to do this. For this, I think that if I made the bubble and point it towards the source of the information that brought it up may be sufficient. Later, I can add my own thoughts to it.\n[[flight-of-ideas-racing-thoughts]]\n[[perfection-is-paralyzing]]\n\n> 12 hours later...\n\nA more important problem is that something is blocking me from actually doing what I want. Probably anxiety, I just spend the whole day procrastinating instead of executing my original plan. I'm so afraid of doing it wrong that I just dont do it... Too much emotional investment can be a double-edged sword.\n\n[[fear-of-failure]] [[the-power-of-emotional-investment]]\n\nI at least got to hyperlink the previous entry... and this one.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[2023-01-01]: .././wayward/2023-01-01 \"2023-01-01\"\n[flight-of-ideas-racing-thoughts]: .././bubbles/flight-of-ideas-racing-thoughts \"flight-of-ideas-racing-thoughts\"\n[perfection-is-paralyzing]: .././bubbles/perfection-is-paralyzing \"perfection-is-paralyzing\"\n[fear-of-failure]: .././bubbles/fear-of-failure \"fear-of-failure\"\n[the-power-of-emotional-investment]: .././bubbles/the-power-of-emotional-investment \"the-power-of-emotional-investment\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "2023-01-03",
            "url": ".././wayward/2023-01-03",
            "category": "wayward",
            "title": "2023-01-03 Link Reference Definition Autogenerator",
            "content": "```yaml\n---\ntitle: 2023-01-03 Link Reference Definition Autogenerator\n---\n```\n\nChronolink: [[2023-01-02]]\n\nSadly, I didnt do much today. Had a discussion with my aunt (monjita) about formative research.\n\nApart from that I just fixed the Link Reference Definition Autogenerator (see [[foam]])\n\n\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[2023-01-02]: .././wayward/2023-01-02 \"2023-01-02\"\n[foam]: .././tutorials/foam \"foam\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "2023-01-04",
            "url": ".././wayward/2023-01-04",
            "category": "wayward",
            "title": "2023-01-04 I'm finally starting",
            "content": "```yaml\n---\ntitle: 2023-01-04 I'm finally starting\n---\n```\n\nChronolink: [[2023-01-03]]\n\nAfter a family visit, my plan is to digest two videos at least:\n\n- [You’re Not Stupid: How to Easily Learn Difficult Things - \nElizabeth Filips](https://youtu.be/Kz_brQBl8xk)\n- [Focusing Your Unconscious Mind: Learn Hard Concepts Intuitively (And Forever) - Colin Galen](https://youtu.be/Dm68uFy6gus)\n\nBefore even starting I'm encountering a lot of blockage, sort of like unconciously sabotaging myself not to do it... procrastination??. I also have a mild headache. Anyway, I just gotta do it...\n\nI'm going to test linking to a specific section of a document too. That would be useful for subchunking.\n\nBefore starting though, I had [[overheating]] problems on my laptop, which I hope I solved them with temperature throttling.\n\nIt just ocurred to me that if I want to spend my life talking about ideas, then I need to have a [[bestiary]], inventory... and so on of ideas. [[archeology-of-knowledge]]\n\nIn anycase, during the process of assimilating just the first video (Elizabeth's) I got infinitely lost in the way [[curiosity-jumping]]. This makes me think that I should probably have balance between this wayward project and other intellectual duties (such as paper writing).\n\nConclusion--> At least I did the first video. [[how-to-learn]]\n\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[2023-01-03]: .././wayward/2023-01-03 \"2023-01-03\"\n[overheating]: .././bubbles/overheating \"overheating\"\n[bestiary]: .././bubbles/bestiary \"bestiary\"\n[archeology-of-knowledge]: .././bubbles/archeology-of-knowledge \"archeology-of-knowledge\"\n[curiosity-jumping]: .././bubbles/curiosity-jumping \"curiosity-jumping\"\n[how-to-learn]: .././bubbles/how-to-learn \"how-to-learn\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "2023-01-05",
            "url": ".././wayward/2023-01-05",
            "category": "wayward",
            "title": "2023-01-05 Sis' birthday",
            "content": "```yaml\n---\ntitle: 2023-01-05 Sis' birthday\n---\n```\n\nChronolink: [[2023-01-04]]\n\nDidnt do anything besides researching stuff related to [[novelty-search]], inspired by some facebook debate on AI art. I trying to remember an article I read on the importance of the AI to explore freely rather than only go for the immediate reward. The article consisted of like an image generation AI that would be fedback with user input. And that by ignoring most interesting images at first, you could arrive at better solutions later. I cant find the article though. I think one of the examples was trying to generate an image similar to an animal. The article had a dark background (it was on the internet, not a pdf).\n\nI also saw a post on facebook that directed me towards [[are_yes_or_no_questions_science]]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[2023-01-04]: .././wayward/2023-01-04 \"2023-01-04\"\n[novelty-search]: .././bubbles/novelty-search \"novelty-search\"\n[are_yes_or_no_questions_science]: .././bubbles/are_yes_or_no_questions_science \"are_yes_or_no_questions_science\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "2023-01-06-to-2023-01-08",
            "url": ".././wayward/2023-01-06-to-2023-01-08",
            "category": "wayward",
            "title": "2023-01-06 to 2023-01-08 Unproductive",
            "content": "```yaml\n---\ntitle: 2023-01-06 to 2023-01-08 Unproductive\n---\n```\n\nChronolink: [[2023-01-05]]\n\nThese days I haven't been able to concentrate much. My mental state ain't the best and there were some family-related important stuff I had to do (my aunt and backup of family photos).\n\nI did read here and there about some stuff and relevant concepts crossed my mind:\n\n- The [[avatar-of-challenge]], which is something I have been thinking for a while as a result of my emotional struggles. I was reminded of it also by the character of the Big Bad Wolf from Puss in boots 2.\n- The [[will-of-places]] which is a concept I have thought about whenever Im about to move from a place.\n- This idea of a study of thought [[representation]]s, or information representations in general. How we think and how machines think.\n- This idea of [[algorithms-as-abstract-representations]]\n- About [[the-can-that-moves]] (Massimo's game).\n- Some books: [[text-horizonte-de-sucesos]],[[text-libro-de-animales]]\n- Relato [[text-i-have-no-mouth-and-i-must-scream]]\n- The [[squire-attire]]\n- [[video-the-paradox-of-rules-in-games-and-life]]\n\n\n\n\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[2023-01-05]: .././wayward/2023-01-05 \"2023-01-05\"\n[avatar-of-challenge]: .././bubbles/avatar-of-challenge \"avatar-of-challenge\"\n[will-of-places]: .././bubbles/will-of-places \"will-of-places\"\n[representation]: .././bubbles/representation \"representation\"\n[algorithms-as-abstract-representations]: .././bubbles/algorithms-as-abstract-representations \"algorithms-as-abstract-representations\"\n[the-can-that-moves]: .././bubbles/the-can-that-moves \"the-can-that-moves\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[text-libro-de-animales]: .././bubbles/text-libro-de-animales \"text-libro-de-animales\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[squire-attire]: .././bubbles/squire-attire \"squire-attire\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "2023-01-09-to-inifinity",
            "url": ".././wayward/2023-01-09-to-inifinity",
            "category": "wayward",
            "title": "2023-01-09 to infinity",
            "content": "```yaml\n---\ntitle: 2023-01-09 to infinity\n---\n```\n\nChronolink: [[2023-01-06-to-2023-01-08]]\n\nI wasnt able to commit to writing everyday, too much friction. But the waywardness of this project is still very much alive.\n\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[2023-01-06-to-2023-01-08]: .././wayward/2023-01-06-to-2023-01-08 \"2023-01-06-to-2023-01-08\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "reverse-engineering-games",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "reverse-engineering-games",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "phosphenes",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "phosphenes",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "imagine-24-balls",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "imagine-24-balls",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "video-the-paradox-of-rules-in-games-and-life",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "video-the-paradox-of-rules-in-games-and-life",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "connectome",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "connectome",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "burden-of-proof.md",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "burden-of-proof.md",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "intuitive-physics",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "intuitive-physics",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "text-i-have-no-mouth-and-i-must-scream",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "text-i-have-no-mouth-and-i-must-scream",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "building-before-knowing",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "building-before-knowing",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "primary-visual-cortex",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "primary-visual-cortex",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "wayward",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "wayward",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "inferotemporal-cortex",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "inferotemporal-cortex",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "text-horizonte-de-sucesos",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "text-horizonte-de-sucesos",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "computation",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "computation",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        },
        {
            "id": "you-research-what-strikes-you-deeply",
            "url": ".././bubbles/stub",
            "category": "bubbles",
            "title": "you-research-what-strikes-you-deeply",
            "content": "```yaml\n---\ntitle: Stub\n---\n```\n\nYou got here because the node you clicked doesn't exist yet :( .\n\n\n\n\n\n[//begin]: # \"Autogenerated link references for markdown compatibility\"\n[video-the-paradox-of-rules-in-games-and-life]: .././bubbles/stub \"video-the-paradox-of-rules-in-games-and-life\"\n[connectome]: .././bubbles/stub \"connectome\"\n[inferotemporal-cortex]: .././bubbles/stub \"inferotemporal-cortex\"\n[burden-of-proof.md]: .././bubbles/stub \"burden-of-proof.md\"\n[phosphenes]: .././bubbles/stub \"phosphenes\"\n[text-horizonte-de-sucesos]: .././bubbles/stub \"text-horizonte-de-sucesos\"\n[intuitive-physics]: .././bubbles/stub \"intuitive-physics\"\n[text-i-have-no-mouth-and-i-must-scream]: .././bubbles/stub \"text-i-have-no-mouth-and-i-must-scream\"\n[you-research-what-strikes-you-deeply]: .././bubbles/stub \"you-research-what-strikes-you-deeply\"\n[imagine-24-balls]: .././bubbles/stub \"imagine-24-balls\"\n[reverse-engineering-games]: .././bubbles/stub \"reverse-engineering-games\"\n[primary-visual-cortex]: .././bubbles/stub \"primary-visual-cortex\"\n[building-before-knowing]: .././bubbles/stub \"building-before-knowing\"\n[wayward]: .././bubbles/stub \"wayward\"\n[computation]: .././bubbles/stub \"computation\"\n[//end]: # \"Autogenerated link references\"\n\n"
        }
    ],
    "links": [
        {
            "source": "aesthethic-of-deepness",
            "target": "curiosity-jumping"
        },
        {
            "source": "aesthethic-of-deepness",
            "target": "archeology-of-knowledge"
        },
        {
            "source": "are_yes_or_no_questions_science",
            "target": "burden-of-proof.md"
        },
        {
            "source": "avatar-of-challenge",
            "target": "wolf-of-reality"
        },
        {
            "source": "avatar-of-challenge",
            "target": "eyes-i-see-at-close-eyes"
        },
        {
            "source": "avatar-of-challenge",
            "target": "abyss-gaze"
        },
        {
            "source": "convencion-signos-optica",
            "target": "intuitive-physics"
        },
        {
            "source": "curiosity-jumping",
            "target": "focused-and-diffused"
        },
        {
            "source": "curiosity-jumping",
            "target": "wayward"
        },
        {
            "source": "curiosity-jumping",
            "target": "for-the-sake-of-play"
        },
        {
            "source": "eyes-i-see-at-close-eyes",
            "target": "phosphenes"
        },
        {
            "source": "how-to-learn",
            "target": "the-power-of-emotional-investment"
        },
        {
            "source": "how-to-learn",
            "target": "problem-solvingly"
        },
        {
            "source": "how-to-learn",
            "target": "aesthethic-of-deepness"
        },
        {
            "source": "how-to-learn",
            "target": "por-las-ramas"
        },
        {
            "source": "how-to-learn",
            "target": "flight-of-ideas-racing-thoughts"
        },
        {
            "source": "how-to-learn",
            "target": "curiosity-jumping"
        },
        {
            "source": "how-to-learn",
            "target": "mere-exposure-effect"
        },
        {
            "source": "how-to-learn",
            "target": "focused-and-diffused"
        },
        {
            "source": "how-to-learn",
            "target": "memory-retention"
        },
        {
            "source": "knowledge-graph",
            "target": "knowledge-cartography"
        },
        {
            "source": "la-ilogica-de-las-cosas",
            "target": "chaos-magick"
        },
        {
            "source": "perfection-is-paralyzing",
            "target": "paralysis-by-analysis"
        },
        {
            "source": "perfection-is-paralyzing",
            "target": "fear-of-failure"
        },
        {
            "source": "representation",
            "target": "learn-from-the-machine"
        },
        {
            "source": "representation",
            "target": "imagine-24-balls"
        },
        {
            "source": "scientific-writing-with-karen-mckee",
            "target": "writing-and-thinking"
        },
        {
            "source": "soft-vs-hard-computing",
            "target": "computation"
        },
        {
            "source": "the-can-that-moves",
            "target": "reverse-engineering-games"
        },
        {
            "source": "the-minimal-viable-product",
            "target": "paralysis-by-analysis"
        },
        {
            "source": "the-minimal-viable-product",
            "target": "perfection-is-paralyzing"
        },
        {
            "source": "the-power-of-emotional-investment",
            "target": "neuroscience-of-curiosity"
        },
        {
            "source": "to-do",
            "target": "curiosity-jumping"
        },
        {
            "source": "wolf-of-reality",
            "target": "perspective-reality"
        },
        {
            "source": "writing-and-thinking",
            "target": "knowledge-graph"
        },
        {
            "source": "reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence-parikshit-gupta",
            "target": "biomimicry"
        },
        {
            "source": "reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence-parikshit-gupta",
            "target": "building-before-knowing"
        },
        {
            "source": "reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence-parikshit-gupta",
            "target": "connectome"
        },
        {
            "source": "reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence-parikshit-gupta",
            "target": "modularism-vs-holism-in-neuroscience"
        },
        {
            "source": "reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence-parikshit-gupta",
            "target": "brain-as-a-computer"
        },
        {
            "source": "reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence-parikshit-gupta",
            "target": "brain-as-a-computer"
        },
        {
            "source": "reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence-parikshit-gupta",
            "target": "biomimicry"
        },
        {
            "source": "reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence-parikshit-gupta",
            "target": "biomimicry"
        },
        {
            "source": "reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence-parikshit-gupta",
            "target": "brain-as-a-computer"
        },
        {
            "source": "reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence-parikshit-gupta",
            "target": "primary-visual-cortex"
        },
        {
            "source": "reverse-engineering-of-human-brain-for-the-field-of-artificial-intelligence-parikshit-gupta",
            "target": "inferotemporal-cortex"
        },
        {
            "source": "local-jekyll",
            "target": "foam"
        },
        {
            "source": "local-jekyll",
            "target": "notetaking"
        },
        {
            "source": "2023-01-01",
            "target": "you-research-what-strikes-you-deeply"
        },
        {
            "source": "2023-01-01",
            "target": "understanding-and-innovation"
        },
        {
            "source": "2023-01-01",
            "target": "the-power-of-emotional-investment"
        },
        {
            "source": "2023-01-01",
            "target": "fear-of-failure"
        },
        {
            "source": "2023-01-01",
            "target": "paralysis-by-analysis"
        },
        {
            "source": "2023-01-01",
            "target": "kids-are-pure-potential"
        },
        {
            "source": "2023-01-01",
            "target": "the-blessing-is-in-the-breaking"
        },
        {
            "source": "2023-01-01",
            "target": "hamilton"
        },
        {
            "source": "2023-01-01",
            "target": "rapt-attention"
        },
        {
            "source": "2023-01-01",
            "target": "life-authentic"
        },
        {
            "source": "2023-01-01",
            "target": "notetaking"
        },
        {
            "source": "2023-01-01",
            "target": "scientific-writing-with-karen-mckee"
        },
        {
            "source": "2023-01-01",
            "target": "how-to-learn"
        },
        {
            "source": "2023-01-01",
            "target": "focused-and-diffused"
        },
        {
            "source": "2023-01-01",
            "target": "visceralization"
        },
        {
            "source": "2023-01-01",
            "target": "knowledge-graph"
        },
        {
            "source": "2023-01-01",
            "target": "phrase-compression"
        },
        {
            "source": "2023-01-01",
            "target": "flight-of-ideas-racing-thoughts"
        },
        {
            "source": "2023-01-01",
            "target": "writting-during-vs-after-journey"
        },
        {
            "source": "2023-01-01",
            "target": "flight-of-ideas-racing-thoughts"
        },
        {
            "source": "2023-01-02",
            "target": "2023-01-01"
        },
        {
            "source": "2023-01-02",
            "target": "flight-of-ideas-racing-thoughts"
        },
        {
            "source": "2023-01-02",
            "target": "perfection-is-paralyzing"
        },
        {
            "source": "2023-01-02",
            "target": "fear-of-failure"
        },
        {
            "source": "2023-01-02",
            "target": "the-power-of-emotional-investment"
        },
        {
            "source": "2023-01-03",
            "target": "2023-01-02"
        },
        {
            "source": "2023-01-03",
            "target": "foam"
        },
        {
            "source": "2023-01-04",
            "target": "2023-01-03"
        },
        {
            "source": "2023-01-04",
            "target": "overheating"
        },
        {
            "source": "2023-01-04",
            "target": "bestiary"
        },
        {
            "source": "2023-01-04",
            "target": "archeology-of-knowledge"
        },
        {
            "source": "2023-01-04",
            "target": "curiosity-jumping"
        },
        {
            "source": "2023-01-04",
            "target": "how-to-learn"
        },
        {
            "source": "2023-01-05",
            "target": "2023-01-04"
        },
        {
            "source": "2023-01-05",
            "target": "novelty-search"
        },
        {
            "source": "2023-01-05",
            "target": "are_yes_or_no_questions_science"
        },
        {
            "source": "2023-01-06-to-2023-01-08",
            "target": "2023-01-05"
        },
        {
            "source": "2023-01-06-to-2023-01-08",
            "target": "avatar-of-challenge"
        },
        {
            "source": "2023-01-06-to-2023-01-08",
            "target": "will-of-places"
        },
        {
            "source": "2023-01-06-to-2023-01-08",
            "target": "representation"
        },
        {
            "source": "2023-01-06-to-2023-01-08",
            "target": "algorithms-as-abstract-representations"
        },
        {
            "source": "2023-01-06-to-2023-01-08",
            "target": "the-can-that-moves"
        },
        {
            "source": "2023-01-06-to-2023-01-08",
            "target": "text-horizonte-de-sucesos"
        },
        {
            "source": "2023-01-06-to-2023-01-08",
            "target": "text-libro-de-animales"
        },
        {
            "source": "2023-01-06-to-2023-01-08",
            "target": "text-i-have-no-mouth-and-i-must-scream"
        },
        {
            "source": "2023-01-06-to-2023-01-08",
            "target": "squire-attire"
        },
        {
            "source": "2023-01-06-to-2023-01-08",
            "target": "video-the-paradox-of-rules-in-games-and-life"
        },
        {
            "source": "2023-01-09-to-inifinity",
            "target": "2023-01-06-to-2023-01-08"
        },
        {
            "source": "stub",
            "target": "reverse-engineering-games"
        },
        {
            "source": "stub",
            "target": "phosphenes"
        },
        {
            "source": "stub",
            "target": "imagine-24-balls"
        },
        {
            "source": "stub",
            "target": "video-the-paradox-of-rules-in-games-and-life"
        },
        {
            "source": "stub",
            "target": "connectome"
        },
        {
            "source": "stub",
            "target": "burden-of-proof.md"
        },
        {
            "source": "stub",
            "target": "intuitive-physics"
        },
        {
            "source": "stub",
            "target": "text-i-have-no-mouth-and-i-must-scream"
        },
        {
            "source": "stub",
            "target": "building-before-knowing"
        },
        {
            "source": "stub",
            "target": "primary-visual-cortex"
        },
        {
            "source": "stub",
            "target": "wayward"
        },
        {
            "source": "stub",
            "target": "inferotemporal-cortex"
        },
        {
            "source": "stub",
            "target": "text-horizonte-de-sucesos"
        },
        {
            "source": "stub",
            "target": "computation"
        },
        {
            "source": "stub",
            "target": "you-research-what-strikes-you-deeply"
        }
    ]
}